
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一章：异步：现在 & 以后 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch2.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：异步：现在 & 以后
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：回调
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：Promises
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：生成器
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第一章：异步：现在 & 以后</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4F60;&#x4E0D;&#x77E5;&#x9053;js&#xFF1A;&#x5F02;&#x6B65;">&#x4F60;&#x4E0D;&#x77E5;&#x9053;JS&#xFF1A;&#x5F02;&#x6B65;</h1>
<h1 id="&#x7B2C;&#x4E00;&#x7AE0;&#xFF1A;&#x5F02;&#x6B65;&#xFF1A;&#x73B0;&#x5728;--&#x4EE5;&#x540E;&#xFF08;now--later&#xFF09;">&#x7B2C;&#x4E00;&#x7AE0;&#xFF1A;&#x5F02;&#x6B65;&#xFF1A;&#x73B0;&#x5728; &amp; &#x4EE5;&#x540E;&#xFF08;Now &amp; Later&#xFF09;</h1>
<p>&#x5728;&#x50CF;JavaScript&#x8FD9;&#x79CD;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x4E5F;&#x662F;&#x5E38;&#x88AB;&#x8BEF;&#x89E3;&#x7684;&#x4E00;&#x70B9;&#x662F;&#x5982;&#x4F55;&#x8868;&#x793A;&#x548C;&#x63A7;&#x5236;&#x7A0B;&#x5E8F;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x4F7F;&#x5176;&#x6269;&#x5C55;&#x5230;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x3002;</p>
<p>&#x8FD9;&#x5E76;&#x4E0D;&#x53EA;&#x662F;&#x4ECE;<code>for</code>&#x5FAA;&#x73AF;&#x5F00;&#x59CB;&#x5230;<code>for</code>&#x5FAA;&#x73AF;&#x7ED3;&#x675F;&#x6240;&#x53D1;&#x751F;&#x7684;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x5B83;&#x4F1A;&#x82B1;&#x8D39;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#xFF08;&#x51E0;&#x5FAE;&#x79D2;&#x5230;&#x51E0;&#x6BEB;&#x79D2;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x5F53;&#x4F60;&#x7684;&#x90E8;&#x5206;&#x7A0B;&#x5E8F;&#x73B0;&#x5728;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x90E8;&#x5206;&#x4E4B;&#x540E;&#x8FD0;&#x884C;&#x65F6;&#x6240;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;--&#x5728; <em>&#x73B0;&#x5728;</em> &#x548C; <em>&#x4EE5;&#x540E;</em> &#xFF08;&#x5BF9;&#x5E94;&#x7684;&#x7A0B;&#x5E8F;&#x5E76;&#x4E0D;&#x662F;&#x4E3B;&#x52A8;&#x6267;&#x884C;&#x7684;&#xFF09;&#x4E4B;&#x95F4;&#x6709;&#x4E2A;&#x754C;&#x9650;&#xFF08;gap&#xFF09;&#x3002;</p>
<p>&#x65E5;&#x5E38;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x5199;&#x8FC7;&#x7684;&#x4F18;&#x79C0;&#x7A0B;&#x5E8F;&#xFF08;&#x5C24;&#x5176;&#x662F;&#x5728;JS&#x4E2D;&#xFF09;&#x90FD;&#x6216;&#x591A;&#x6216;&#x5C11;&#x5730;&#x9700;&#x8981;&#x7BA1;&#x7406;&#x8FD9;&#x4E2A;&#x754C;&#x9650;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x7B49;&#x5F85;&#x7528;&#x6237;&#x8F93;&#x5165;&#x3001;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x6216;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#x3001;&#x8DE8;&#x7F51;&#x7EDC;&#x53D1;&#x9001;&#x6570;&#x636E;&#x548C;&#x7B49;&#x5F85;&#x54CD;&#x5E94;&#xFF0C;&#x8FD8;&#x662F;&#x5B9A;&#x671F;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x91CD;&#x590D;&#x4EFB;&#x52A1;&#xFF08;&#x6BD4;&#x5982;&#x52A8;&#x753B;&#xFF09;&#x3002;&#x5728;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x573A;&#x666F;&#x5F53;&#x4E2D;&#xFF0C;&#x4F60;&#x90FD;&#x5F97;&#x53CA;&#x65F6;&#x5730;&#x5728;&#x754C;&#x9650;&#x95F4;&#x7BA1;&#x7406;&#x72B6;&#x6001;&#x3002;&#x6B63;&#x5982;&#x4F26;&#x6566;&#x5730;&#x94C1;&#x8457;&#x540D;&#x7684;&#x90A3;&#x53E5;&#xFF1A;&#x5C0F;&#x5FC3;&#x95F4;&#x9699;&#xFF08;mind the gap&#xFF09;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E2D; <em>&#x73B0;&#x5728;</em> &#x548C; <em>&#x4EE5;&#x540E;</em> &#x7684;&#x5173;&#x7CFB;&#x662F;&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#x7684;&#x6838;&#x5FC3;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x786E;&#x8BA4;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x81EA;&#x51FA;&#x73B0;JS&#xFF0C;&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#x5C31;&#x4E00;&#x76F4;&#x8D2F;&#x7A7F;&#x59CB;&#x7EC8;&#x3002;&#x4F46;&#x7EDD;&#x5927;&#x591A;&#x6570;JS&#x5F00;&#x53D1;&#x8005;&#x6CA1;&#x6709;&#x8BA4;&#x771F;&#x8003;&#x8651;&#x8FC7;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x662F;&#x600E;&#x4E48;&#x4EE5;&#x53CA;&#x4E3A;&#x4EC0;&#x4E48;&#x7A81;&#x7136;&#x51FA;&#x73B0;&#x5F02;&#x6B65;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x7814;&#x7A76;&#x8FC7;&#x5982;&#x4F55;&#x7528;&#x5176;&#x5B83;&#x65B9;&#x6CD5;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4E00;&#x76F4;&#x90FD;&#x662F;&#x5F88;&#x68D2;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x81F3;&#x4ECA;&#x4ECD;&#x6709;&#x8BB8;&#x591A;&#x4EBA;&#x575A;&#x6301;&#x8BA4;&#x4E3A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x4F5C;&#x4E3A;&#x8FD0;&#x884C;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x7AEF;&#xFF0C;&#x4EE5;&#x53CA;&#x6BCF;&#x4E2A;&#x80FD;&#x60F3;&#x8C61;&#x7684;&#x5230;&#x7684;&#x8BBE;&#x5907;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x7B49;&#x8BED;&#x8A00;&#xFF0C;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x5E7F;&#x6CDB;&#x7684;&#x9700;&#x6C42;&#xFF0C;JS&#x5728;&#x8303;&#x56F4;&#x548C;&#x590D;&#x6742;&#x5EA6;&#x4E0A;&#x9762;&#x90FD;&#x5728;&#x4E0D;&#x65AD;&#x589E;&#x957F;&#xFF0C;&#x6211;&#x4EEC;&#x7BA1;&#x7406;&#x5F02;&#x6B65;&#x7684;&#x75DB;&#x82E6;&#x4E0E;&#x65E5;&#x4FF1;&#x589E;&#x3002;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x5BFB;&#x6C42;&#x4E00;&#x79CD;&#x529F;&#x80FD;&#x66F4;&#x597D;&#x3001;&#x66F4;&#x5408;&#x7406;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x76EE;&#x524D;&#x770B;&#x8D77;&#x6765;&#x5341;&#x5206;&#x62BD;&#x8C61;&#xFF0C;&#x968F;&#x7740;&#x4E0D;&#x65AD;&#x6DF1;&#x5165;&#x6B64;&#x4E66;&#xFF0C;&#x6211;&#x5411;&#x4F60;&#x4EEC;&#x4FDD;&#x8BC1;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x66F4;&#x5B8C;&#x6574;&#x548C;&#x5F7B;&#x5E95;&#x5730;&#x5904;&#x7406;&#x5F02;&#x6B65;&#x3002;&#x5728;&#x4E4B;&#x540E;&#x51E0;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x63A2;&#x7D22;JS&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x5404;&#x79CD;&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#x3002;</p>
<p>&#x4F46;&#x5728;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x6DF1;&#x523B;&#x7406;&#x89E3;&#x4E0B;&#x4EC0;&#x4E48;&#x662F;&#x5F02;&#x6B65;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5728;JS&#x4E2D;&#x5B9E;&#x73B0;&#x3002;</p>
<h3 id="&#x5757;&#x72B6;&#x5F62;&#x5F0F;&#x7684;&#x7A0B;&#x5E8F;&#xFF08;a-program-in-chunks&#xFF09;">&#x5757;&#x72B6;&#x5F62;&#x5F0F;&#x7684;&#x7A0B;&#x5E8F;&#xFF08;A Program in Chunks&#xFF09;</h3>
<p>&#x4F60;&#x53EF;&#x80FD;&#x5728;&#x4E00;&#x4E2A;<code>.js</code>&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#x5199;JS&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x662F;&#x7531;&#x51E0;&#x5757;&#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x662F; <em>&#x73B0;&#x5728;</em> &#x6267;&#x884C;&#x7684;&#xFF0C;&#x5176;&#x4F59;&#x7684;&#x662F; <em>&#x4EE5;&#x540E;</em> &#x6267;&#x884C;&#x7684;&#x3002;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5757;&#x5355;&#x5143;&#x662F;<code>function</code>&#x3002;</p>
<p>&#x7EDD;&#x5927;&#x591A;&#x6570;JS&#x65B0;&#x624B;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x8BA4;&#x4E3A; <em>&#x4EE5;&#x540E;</em> &#x4E0D;&#x662F;&#x4E25;&#x683C;&#x5730;&#x5728; <em>&#x73B0;&#x5728;</em> &#x4E4B;&#x540E;&#x7ACB;&#x5373;&#x53D1;&#x751F;&#x7684;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4ECE;&#x5B9A;&#x4E49;&#x4E0A;&#x8BB2;&#xFF0C;&#x4E0D;&#x80FD; <em>&#x73B0;&#x5728;</em> &#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#x5C06;&#x4F1A;&#x5F02;&#x6B65;&#x5B8C;&#x6210;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x4F60;&#x76F4;&#x89C2;&#x4E0A;&#x671F;&#x671B;&#x6216;&#x60F3;&#x8981;&#x7684;&#x963B;&#x585E;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5982;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-comment">// ajax(..) is some arbitrary Ajax function given by a library</span>
<span class="hljs-keyword">var</span> data = ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span> );

<span class="hljs-built_in">console</span>.log( data );
<span class="hljs-comment">// Oops! `data` generally won&apos;t have the Ajax results</span>
</code></pre>
<p>&#x4F60;&#x4E5F;&#x8BB8;&#x6CE8;&#x610F;&#x5230;&#x4E86;&#x6807;&#x51C6;&#x7684;Ajax&#x8BF7;&#x6C42;&#x5E76;&#x4E0D;&#x662F;&#x540C;&#x6B65;&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;<code>ajax(...)</code>&#x8FD8;&#x6CA1;&#x6709;&#x8FD4;&#x56DE;&#x503C;&#x7528;&#x6765;&#x8D4B;&#x7ED9;<code>data</code>&#x53D8;&#x91CF;&#x3002;&#x5982;&#x679C;<code>ajax(...)</code>&#x80FD;&#x591F;&#x963B;&#x585E;&#x7A0B;&#x5E8F;&#x76F4;&#x5230;&#x8FD4;&#x56DE;&#x54CD;&#x5E94;&#xFF0C;&#x5219;<code>data=...</code>&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x80FD;&#x591F;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x4F46;&#x8FD9;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x8FD0;&#x7528;Ajax&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x6211;&#x4EEC; <em>&#x73B0;&#x5728;</em> &#x4F5C;&#x4E86;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x7684;Ajax&#x8BF7;&#x6C42;&#xFF0C;&#x76F4;&#x5230; <em>&#x4EE5;&#x540E;</em> &#x624D;&#x83B7;&#x5F97;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x6700;&#x7B80;&#x5355;&#x7684;&#xFF08;&#x4F46;&#x663E;&#x7136;&#x4E0D;&#x662F;&#x552F;&#x4E00;&#xFF0C;&#x66F4;&#x4E0D;&#x662F;&#x6700;&#x597D;&#x7684;&#xFF09;&#x4ECE; <em>&#x73B0;&#x5728;</em> &#x201C;&#x7B49;&#x201C;&#xFF0C;&#x76F4;&#x5230; <em>&#x4EE5;&#x540E;</em> &#x7684;&#x65B9;&#x6CD5;&#x662F;&#x91C7;&#x7528;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-comment">// ajax(..) is some arbitrary Ajax function given by a library</span>
ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">myCallbackFunction</span>(<span class="hljs-params">data</span>)</span>{

    <span class="hljs-built_in">console</span>.log( data ); <span class="hljs-comment">// Yay, I gots me some `data`!</span>

} );
</code></pre>
<p><strong>&#x8B66;&#x544A;&#xFF1A;</strong> &#x4F60;&#x53EF;&#x80FD;&#x542C;&#x8BF4;&#x8FC7;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x540C;&#x6B65;Ajax&#x8BF7;&#x6C42;&#x3002;&#x5C3D;&#x7BA1;&#x6280;&#x672F;&#x4E0A;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x7EDD;&#x5BF9;&#x4E0D;&#x8981;&#x5728;&#x4EFB;&#x4F55;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x4F1A;&#x9501;&#x6B7B;&#x6D4F;&#x89C8;&#x5668;UI&#xFF08;&#x6309;&#x94AE;&#x3001;&#x83DC;&#x5355;&#x3001;&#x6EDA;&#x52A8;&#x7B49;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x4F1A;&#x963B;&#x6B62;&#x4EFB;&#x4F55;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x3002;&#x8FD9;&#x662F;&#x4E2A;&#x5F88;&#x7CDF;&#x7CD5;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5E94;&#x6781;&#x529B;&#x907F;&#x514D;&#x3002;</p>
<p>&#x5728;&#x4F60;&#x63D0;&#x51FA;&#x5F02;&#x8BAE;&#x4E4B;&#x524D;&#xFF0C;&#x4E0D;&#xFF0C;&#x4F60;&#x7684;&#x907F;&#x514D;&#x56DE;&#x8C03;&#x6DF7;&#x4E71;&#x7684;&#x60F3;&#x6CD5;&#x5E76;&#x4E0D;&#x662F;&#x91C7;&#x7528;&#x963B;&#x585E;&#x7684;&#x3001;&#x540C;&#x6B65;Ajax&#x7684;&#x6B63;&#x5F53;&#x7406;&#x7531;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">now</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-number">21</span>;
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">later</span>(<span class="hljs-params"></span>) </span>{
    answer = answer * <span class="hljs-number">2</span>;
    <span class="hljs-built_in">console</span>.log( <span class="hljs-string">&quot;Meaning of life:&quot;</span>, answer );
}

<span class="hljs-keyword">var</span> answer = now();

setTimeout( later, <span class="hljs-number">1000</span> ); <span class="hljs-comment">// Meaning of life: 42</span>
</code></pre>
<p>&#x8FD9;&#x6BB5;&#x7A0B;&#x5E8F;&#x6709;&#x4E24;&#x5927;&#x5757;(chunk)&#xFF0C;&#x4E00;&#x5757;&#x662F; <em>&#x73B0;&#x5728;</em> &#x6267;&#x884C;&#x7684;&#xFF0C;&#x53E6;&#x4E00;&#x5757;&#x662F; <em>&#x4EE5;&#x540E;</em> &#x6267;&#x884C;&#x7684;&#x3002;&#x8FD9;&#x4E24;&#x5757;&#x5E94;&#x8BE5;&#x5F88;&#x6E05;&#x695A;&#x5C31;&#x80FD;&#x770B;&#x51FA;&#x6765;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x660E;&#x786E;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#xFF1A;</p>
<p><em>&#x73B0;&#x5728;</em>&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">now</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">return</span> <span class="hljs-number">21</span>;
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">later</span>(<span class="hljs-params"></span>) </span>{ .. }

<span class="hljs-keyword">var</span> answer = now();

setTimeout( later, <span class="hljs-number">1000</span> );
</code></pre>
<p><em>&#x4EE5;&#x540E;</em>&#xFF1A;</p>
<pre><code class="lang-javascript">answer = answer * <span class="hljs-number">2</span>;
<span class="hljs-built_in">console</span>.log( <span class="hljs-string">&quot;Meaning of life:&quot;</span>, answer );
</code></pre>
<p>&#x53EA;&#x8981;&#x4F60;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#xFF0C;<em>&#x73B0;&#x5728;</em>&#x5757;&#x7ACB;&#x5373;&#x8FD0;&#x884C;&#x3002;&#x4F46;&#x662F;<code>setTimeout(...)</code>&#x4E5F;&#x8BBE;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF08;&#x4E00;&#x4E2A;&#x8D85;&#x65F6;&#xFF09;&#xFF0C;&#x7528;&#x6765;<em>&#x4EE5;&#x540E;</em>&#x6267;&#x884C;&#xFF0C;&#x56E0;&#x6B64;<code>later()</code>&#x51FD;&#x6570;&#x7684;&#x5185;&#x5BB9;&#x4F1A;&#x5728;&#x4E4B;&#x540E;&#x7684;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6267;&#x884C;&#xFF08;&#x4ECE;&#x73B0;&#x5728;&#x8D77;1000&#x6BEB;&#x79D2;&#x540E;&#xFF09;&#x3002;</p>
<p>&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x628A;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x5305;&#x88F9;&#x5230;<code>function</code>&#x4E2D;&#xFF0C;&#x5E76;&#x6307;&#x5B9A;&#x5230;&#x5BF9;&#x5E94;&#x4E8B;&#x4EF6;&#xFF08;&#x5B9A;&#x65F6;&#x5668;&#x3001;&#x9F20;&#x6807;&#x5355;&#x51FB;&#x3001;Ajax&#x8BF7;&#x6C42;&#x7B49;&#xFF09;&#x6267;&#x884C;&#xFF0C;&#x4F60;&#x5C31;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;<em>&#x4EE5;&#x540E;</em>&#x4EE3;&#x7801;&#x5757;&#xFF0C;&#x4ECE;&#x800C;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x5F15;&#x5165;&#x5F02;&#x6B65;&#x3002;</p>
<h3 id="&#x5F02;&#x6B65;-console&#xFF08;async-console&#xFF09;">&#x5F02;&#x6B65; Console&#xFF08;Async Console&#xFF09;</h3>
<p>&#x6CA1;&#x6709;&#x89C4;&#x8303;&#x6216;&#x8981;&#x6C42;&#x5B9A;&#x4E49;<code>console.*</code>&#x65B9;&#x6CD5;&#x662F;&#x5982;&#x4F55;&#x8FD0;&#x884C;&#x7684;--&#x5B83;&#x4EEC;&#x5E76;&#x4E0D;&#x662F;JavaScript&#x7684;&#x5B98;&#x65B9;&#x90E8;&#x5206;&#xFF0C;&#x800C;&#x662F;&#x4E3B;&#x673A;&#x73AF;&#x5883;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x5982;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x7B49;&#xFF09;&#x52A0;&#x5165;&#x5230;JS&#x5F53;&#x4E2D;&#x7684;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x548C;JS&#x73AF;&#x5883;&#x968F;&#x610F;&#x5B9E;&#x73B0;&#xFF0C;&#x6709;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4EE4;&#x4EBA;&#x56F0;&#x60D1;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x5C24;&#x5176;&#x662F;&#x6709;&#x4E9B;&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;<code>console.log(...)</code>&#x5E76;&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x8F93;&#x51FA;&#x7ED9;&#x5B9A;&#x7684;&#x503C;&#x3002;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x53EF;&#x80FD;&#x662F;I/O&#x5728;&#x8BB8;&#x591A;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF08;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;JS&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7F13;&#x6162;&#x548C;&#x963B;&#x585E;&#x6027;&#x7684;&#x90E8;&#x5206;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5BF9;&#x6D4F;&#x89C8;&#x5668;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x540E;&#x53F0;&#x5F02;&#x6B65;&#x5904;&#x7406;<code>console</code>I/O&#x53EF;&#x80FD;&#x6027;&#x80FD;&#x66F4;&#x597D;&#xFF08;&#x4ECE;&#x9875;&#x9762;/UI&#x89D2;&#x5EA6;&#xFF09;&#xFF0C;&#x4F60;&#x751A;&#x81F3;&#x4E0D;&#x77E5;&#x9053;&#x5B83;&#x7684;&#x53D1;&#x751F;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x4E0D;&#x592A;&#x5E38;&#x89C1;&#xFF0C;&#x4F46;&#x53EF;&#x80FD;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#xFF08;&#x4E0D;&#x662F;&#x4ECE;&#x4EE3;&#x7801;&#x5C42;&#x9762;&#xFF0C;&#x800C;&#x662F;&#x4ECE;&#x5916;&#x90E8;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x6267;&#x884C;&#x7ED3;&#x679C;&#xFF09;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> a = {
    index: <span class="hljs-number">1</span>
};

<span class="hljs-comment">// later</span>
<span class="hljs-built_in">console</span>.log( a ); <span class="hljs-comment">// ??</span>

<span class="hljs-comment">// even later</span>
a.index++;
</code></pre>
<p>&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x8BA4;&#x4E3A;<code>a</code>&#x5BF9;&#x8C61;&#x5728;<code>console.log(...)</code>&#x8BED;&#x53E5;&#x6267;&#x884C;&#x65F6;&#x662F;&#x4E2A;&#x5FEB;&#x7167;&#xFF0C;&#x8F93;&#x51FA;&#x6BD4;&#x5982;<code>{index:1}</code>&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5F53;<code>a.index++</code>&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x662F;&#x4E25;&#x683C;&#x5730;&#x5728;&#x8F93;&#x51FA;   &#x4E4B;&#x540E;&#x4FEE;&#x6539;<code>a</code>&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#xFF0C;&#x524D;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5728;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x4E2D;&#x7684;&#x63A7;&#x5236;&#x53F0;&#x80FD;&#x591F;&#x4EA7;&#x751F;&#x4F60;&#x671F;&#x671B;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x4F46;&#x540C;&#x6837;&#x7684;&#x4EE3;&#x7801;&#x4E5F;&#x53EF;&#x80FD;&#x5728;&#x89C9;&#x5F97;&#x9700;&#x8981;&#x63A8;&#x8FDF;<code>console</code>I/O&#x5230;&#x540E;&#x53F0;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x90A3;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x63A7;&#x5236;&#x53F0;&#x4E2D;&#xFF0C;&#x663E;&#x793A;&#x51FA;<code>a</code>&#x7684;&#x65F6;&#x5019;&#xFF0C;<code>a.index++</code>&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x6267;&#x884C;&#x4E86;&#xFF0C;&#x4ECE;&#x800C;&#x8F93;&#x51FA;<code>{index:2}</code>&#x3002;</p>
<p>&#x5230;&#x5E95;&#x5728;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;<code>console</code>I/O&#x4F1A;&#x88AB;&#x63A8;&#x8FDF;&#x6267;&#x884C;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5426;&#x80FD;&#x89C2;&#x6D4B;&#x5230;&#x8FD9;&#x4E00;&#x73B0;&#x8C61;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x3002;&#x8BB0;&#x4F4F;&#xFF0C;&#x6BCF;&#x5F53;&#x4F60;&#x8C03;&#x8BD5;&#x4E00;&#x4E2A;&#x5728;<code>console.log(...)</code>&#x8BED;&#x53E5;&#x540E;&#x4FEE;&#x6539;&#x5BF9;&#x8C61;&#x7684;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x6CE8;&#x610F;&#x53EF;&#x80FD;&#x7684;&#x5F02;&#x6B65;I/O&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x770B;&#x5230;&#x4E0D;&#x53EF;&#x601D;&#x8BAE;&#x7684;&#x7ED3;&#x679C;&#x51FA;&#x73B0;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong> &#x5982;&#x679C;&#x4F60;&#x78B0;&#x5230;&#x8FD9;&#x79CD;&#x5F88;&#x5C11;&#x89C1;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x9009;&#x62E9;&#x662F;&#x91C7;&#x7528;JS&#x8C03;&#x8BD5;&#x5668;&#x7684;&#x65AD;&#x70B9;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F9D;&#x8D56;<code>console</code>&#x8F93;&#x51FA;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x8F83;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x67E5;&#x8BE2;&#x7684;&#x5BF9;&#x8C61;&#x5E8F;&#x5217;&#x5316;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x6BD4;&#x5982;<code>JSON.stringify(...)</code>&#x3002;</p>
<h2 id="&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#xFF08;event-loop&#xFF09;">&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#xFF08;Event Loop&#xFF09;</h2>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x5C0F;&#x5C0F;&#x62B1;&#x6028;&#x4E00;&#x4E0B;&#xFF1A;&#x5C3D;&#x7BA1;&#x5141;&#x8BB8;&#x5F02;&#x6B65;JS&#x4EE3;&#x7801;&#xFF08;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x521A;&#x521A;&#x770B;&#x5230;&#x7684;timeout&#x4E00;&#x6837;&#xFF09;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x8FD1;&#xFF08;ES6&#xFF09;&#xFF0C;JS&#x672C;&#x8EAB;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x5185;&#x5EFA;&#x7684;&#x76F4;&#x63A5;&#x8868;&#x793A;&#x5F02;&#x6B65;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p><strong>&#x7EB3;&#x5C3C;!?</strong>&#x4F3C;&#x4E4E;&#x5F88;&#x75AF;&#x72C2;&#x5BF9;&#x4E0D;&#x5BF9;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x662F;&#x771F;&#x7684;&#x3002;&#x5F53;&#x88AB;&#x8981;&#x6C42;&#x7684;&#x65F6;&#x5019;&#xFF0C;JS&#x5F15;&#x64CE;&#x9664;&#x4E86;&#x5728;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x65F6;&#x523B;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x5355;&#x4E2A;&#x4EE3;&#x7801;&#x5757;&#x4EE5;&#x5916;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x505A;&#x3002;</p>
<p>&quot;&#x8C01;&#x8981;&#x6C42;&#x7684;&#xFF1F;&quot;&#x8FD9;&#x662F;&#x5173;&#x952E;&#x6240;&#x5728;&#xFF01;</p>
<p>JS&#x5F15;&#x64CE;&#x5E76;&#x4E0D;&#x662F;&#x5B64;&#x7ACB;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x5B83;&#x5904;&#x5728;&#x4E3B;&#x673A;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x5BF9;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x8BF4;&#x662F;&#x666E;&#x901A;&#x7684;web&#x6D4F;&#x89C8;&#x5668;&#x3002;&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x51E0;&#x5E74;&#x91CC;&#xFF0C;JS&#x5DF2;&#x7ECF;&#x4ECE;&#x6D4F;&#x89C8;&#x5668;&#x6269;&#x5C55;&#x5230;&#x5176;&#x5B83;&#x73AF;&#x5883;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x901A;&#x8FC7;Node.js&#x6269;&#x5C55;&#x5230;&#x670D;&#x52A1;&#x7AEF;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5982;&#x4ECA;JS&#x5DF2;&#x7ECF;&#x88AB;&#x5D4C;&#x5165;&#x5230;&#x5404;&#x79CD;&#x8BBE;&#x5907;&#x5F53;&#x4E2D;&#xFF0C;&#x5927;&#x5230;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x5C0F;&#x5230;&#x706F;&#x6CE1;&#x3002;</p>
<p>&#x4F46;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x73AF;&#x5883;&#x6709;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7684;&#x201C;&#x7EBF;&#x7A0B;&#x201D;&#xFF0C;&#x5373;&#x5728;&#x6BCF;&#x4E2A;&#x6FC0;&#x6D3B;JS&#x5F15;&#x64CE;&#x7684;&#x65F6;&#x523B;&#xFF0C;&#x6309;&#x65F6;&#x95F4;&#x5904;&#x7406;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x4EE3;&#x7801;&#x5757;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x8FD9;&#x79F0;&#x4F5C;&#x201C;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x201D;&#x3002;</p>
<p>&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;JS&#x5F15;&#x64CE;&#x5929;&#x751F;&#x5C31;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x5BF9;&#x4EFB;&#x4F55;JS&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x6309;&#x9700;&#x6267;&#x884C;&#x7684;&#x73AF;&#x5883;&#x3002;&#x6B63;&#x662F;&#x8FD9;&#x4E2A;&#x73AF;&#x5883;&#x8C03;&#x5EA6;&#x201C;&#x4E8B;&#x4EF6;&#x201D;&#xFF08;JS&#x4EE3;&#x7801;&#x6267;&#x884C;&#xFF09;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6BD4;&#x5982;&#x5F53;&#x4F60;&#x7684;JS&#x4EE3;&#x7801;&#x53D1;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;Ajax&#x8BF7;&#x6C42;&#x4ECE;&#x670D;&#x52A1;&#x7AEF;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x4F60;&#x5728;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF08;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x201C;&#x56DE;&#x8C03;&#x201D;&#xFF09;&#x4E2D;&#x8BBE;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x201C;&#x54CD;&#x5E94;&#x201D;&#x4EE3;&#x7801;&#xFF0C;&#x7136;&#x540E;JS&#x5F15;&#x64CE;&#x544A;&#x8BC9;&#x4E3B;&#x673A;&#x73AF;&#x5883;&#xFF0C;&#x201C;&#x55E8;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x51C6;&#x5907;&#x4E2D;&#x6B62;&#x6267;&#x884C;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x4F60;&#x5B8C;&#x6210;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x4E14;&#x6709;&#x6570;&#x636E;&#x4E86;&#xFF0C;&#x8BF7;&#x8C03;&#x7528;&#x540E;&#x9762;&#x7684;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x201D;&#x3002;</p>
<p>&#x7136;&#x540E;&#x6D4F;&#x89C8;&#x5668;&#x5BF9;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x54CD;&#x5E94;&#x8BBE;&#x7F6E;&#x76D1;&#x542C;&#xFF0C;&#x5F53;&#x6709;&#x4E1C;&#x897F;&#x8FD4;&#x56DE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x901A;&#x8FC7;&#x628A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x63D2;&#x5165;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x6267;&#x884C;&#x56DE;&#x8C03;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x4F2A;&#x4EE3;&#x7801;&#x5C06;&#x5B83;&#x6982;&#x5FF5;&#x5316;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-comment">// `eventLoop` is an array that acts as a queue (first-in, first-out)</span>
<span class="hljs-keyword">var</span> eventLoop = [ ];
<span class="hljs-keyword">var</span> event;

<span class="hljs-comment">// keep going &quot;forever&quot;</span>
<span class="hljs-keyword">while</span> (<span class="hljs-literal">true</span>) {
    <span class="hljs-comment">// perform a &quot;tick&quot;</span>
    <span class="hljs-keyword">if</span> (eventLoop.length &gt; <span class="hljs-number">0</span>) {
        <span class="hljs-comment">// get the next event in the queue</span>
        event = eventLoop.shift();

        <span class="hljs-comment">// now, execute the next event</span>
        <span class="hljs-keyword">try</span> {
            event();
        }
        <span class="hljs-keyword">catch</span> (err) {
            reportError(err);
        }
    }
}
</code></pre>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x7528;&#x6765;&#x8BF4;&#x660E;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;&#x7684;&#x7B80;&#x5316;&#x4F2A;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x662F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x7406;&#x89E3;&#x7684;&#x8BDD;&#xFF0C;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x4E86;&#x3002;</p>
<p>&#x5982;&#x4F60;&#x6240;&#x89C1;&#xFF0C;&#x6709;&#x5982;<code>while</code>&#x5FAA;&#x73AF;&#x6240;&#x793A;&#x7684;&#x4E00;&#x4E2A;&#x6301;&#x7EED;&#x8FD0;&#x884C;&#x7684;&#x5FAA;&#x73AF;&#xFF0C;&#x6BCF;&#x6B21;&#x5FAA;&#x73AF;&#x904D;&#x5386;&#x79F0;&#x4E3A;&#x4E00;&#x4E2A;&#x201C;tick&#x201D;&#x3002;&#x5BF9;&#x6BCF;&#x4E2A;tick&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x961F;&#x5217;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#xFF0C;&#x5219;&#x79BB;&#x5F00;&#x961F;&#x5217;&#x7ACB;&#x5373;&#x6267;&#x884C;&#x3002;&#x8FD9;&#x4E9B;&#x4E8B;&#x4EF6;&#x5C31;&#x662F;&#x4F60;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;<code>setTimeout(...)</code>&#x5E76;&#x4E0D;&#x4F1A;&#x628A;&#x4F60;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x653E;&#x5165;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x961F;&#x5217;&#xFF0C;&#x5B83;&#x5E72;&#x7684;&#x53EA;&#x662F;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x5B9A;&#x65F6;&#x5668;&#xFF0C;&#x5F53;&#x5B9A;&#x65F6;&#x5668;&#x8FC7;&#x671F;&#x65F6;&#xFF0C;&#x4E3B;&#x673A;&#x73AF;&#x5883;&#x628A;&#x4F60;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x653E;&#x5165;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#xFF0C;&#x8FD9;&#x6837;&#x67D0;&#x4E2A;&#x672A;&#x6765;&#x7684;tick&#x5C31;&#x4F1A;&#x62FE;&#x8D77;&#x5E76;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x5047;&#x5982;&#x90A3;&#x65F6;&#x4E8B;&#x4EF6;&#x961F;&#x5217;&#x4E2D;&#x5DF2;&#x7ECF;&#x6709;20&#x9879;&#x4E86;&#x5462;&#xFF1F;&#x4F60;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x5F97;&#x7B49;&#xFF0C;&#x6392;&#x961F;&#x7AD9;&#x5728;&#x5176;&#x5B83;&#x7684;&#x540E;&#x9762;&#x3002;&#x901A;&#x5E38;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x62A2;&#x5360;&#x961F;&#x5217;&#x4EE5;&#x8DF3;&#x5230;&#x961F;&#x5217;&#x524D;&#x5934;&#x3002;&#x8FD9;&#x5C31;&#x89E3;&#x91CA;&#x4E86;&#x4E3A;&#x4EC0;&#x4E48;<code>setTimeout(...)</code>&#x5B9A;&#x65F6;&#x5668;&#x53EF;&#x80FD;&#x6CA1;&#x6070;&#x597D;&#x5728;&#x8BBE;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x89E6;&#x53D1;&#x3002;&#xFF08;&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF09;&#x6267;&#x884C;&#x73AF;&#x5883;&#x80FD;&#x591F;&#x786E;&#x4FDD;&#x4F60;&#x7684;&#x56DE;&#x8C03;&#x4E0D;&#x4F1A;&#x5728;&#x4F60;&#x8BBE;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x524D;&#x89E6;&#x53D1;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x80FD;&#x5728;&#x4F60;&#x8BBE;&#x5B9A;&#x7684;&#x6216;&#x8005;&#x4E4B;&#x540E;&#x7684;&#x65F6;&#x95F4;&#x89E6;&#x53D1;&#xFF0C;&#x4F9D;&#x4E8B;&#x4EF6;&#x961F;&#x5217;&#x7684;&#x72B6;&#x6001;&#x800C;&#x5B9A;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x88AB;&#x5206;&#x4E3A;&#x51E0;&#x5C0F;&#x5757;&#xFF0C;&#x5728;&#x4E8B;&#x4EF6;&#x961F;&#x5217;&#x4E2D;&#x4E00;&#x4E2A;&#x63A5;&#x7740;&#x4E00;&#x4E2A;&#x7684;&#x6267;&#x884C;&#x3002;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x8BB2;&#xFF0C;&#x548C;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x6CA1;&#x6709;&#x76F4;&#x63A5;&#x5173;&#x7CFB;&#x7684;&#x4E8B;&#x4EF6;&#x4E5F;&#x80FD;&#x591F;&#x5728;&#x961F;&#x5217;&#x4E2D;&#x63D2;&#x5165;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong> &#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x7684;ES6&#x6539;&#x53D8;&#x4E86;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x961F;&#x5217;&#x7684;&#x7BA1;&#x7406;&#x65B9;&#x6CD5;&#x3002;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6B63;&#x5F0F;&#x7684;&#x672F;&#x8BED;&#xFF0C;&#x4F46;ES6&#x6307;&#x5B9A;&#x4E86;&#x4E8B;&#x4EF6;&#x961F;&#x5217;&#x5982;&#x4F55;&#x8FD0;&#x884C;&#xFF0C;&#x4ECE;&#x6280;&#x672F;&#x89D2;&#x5EA6;&#x8BB2;&#xFF0C;&#x5B83;&#x88AB;&#x7EB3;&#x5165;&#x4E86;JS&#x5F15;&#x64CE;&#x7684;&#x8303;&#x7574;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E3B;&#x673A;&#x73AF;&#x5883;&#x3002;&#x8FD9;&#x4E00;&#x6539;&#x53D8;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x662F;ES6 Promises&#x7684;&#x5F15;&#x5165;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x7B2C;&#x4E09;&#x7AE0;&#x8BA8;&#x8BBA;&#x3002;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x80FD;&#x591F;&#x5BF9;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x961F;&#x5217;&#x8C03;&#x5EA6;&#x4F5C;&#x76F4;&#x63A5;&#x3001;&#x7CBE;&#x7EC6;&#x5730;&#x63A7;&#x5236;&#xFF08;&#x53EF;&#x89C1;&#x201C;Cooperation&#x201D;&#x5C0F;&#x8282;&#x4E2D;<code>setTimeout(...0)</code>&#x7684;&#x8BA8;&#x8BBA;&#xFF09;</p>
<h2 id="&#x591A;&#x7EBF;&#x7A0B;&#xFF08;parallel-threading&#xFF09;">&#x591A;&#x7EBF;&#x7A0B;&#xFF08;Parallel Threading&#xFF09;</h2>
<p>&#x628A;&#x201C;&#x5F02;&#x6B65;&#x201D;&#x548C;&#x201C;&#x5E76;&#x884C;&#x201D;&#x7406;&#x89E3;&#x4E3A;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x7684;&#x60F3;&#x6CD5;&#x5F88;&#x5E38;&#x89C1;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x5176;&#x5B9E;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x540C;&#x3002;&#x8BB0;&#x4F4F;&#xFF0C;&#x5F02;&#x6B65;&#x662F;&#x5173;&#x4E8E;<em>&#x73B0;&#x5728;</em> &#x548C; <em>&#x4EE5;&#x540E;</em> &#x7684;&#x754C;&#x9650;&#x3002;&#x4F46;&#x5E76;&#x884C;&#x662F;&#x5141;&#x8BB8;&#x4E8B;&#x60C5;&#x80FD;&#x591F;&#x540C;&#x65F6;&#x53D1;&#x751F;&#x3002;</p>
<p>&#x6700;&#x5E38;&#x7528;&#x7684;&#x5E76;&#x884C;&#x8BA1;&#x7B97;&#x5DE5;&#x5177;&#x662F;&#x591A;&#x8FDB;&#x7A0B;&#x548C;&#x591A;&#x7EBF;&#x7A0B;&#x3002;&#x591A;&#x8FDB;&#x7A0B;&#x548C;&#x591A;&#x7EBF;&#x7A0B;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#xFF1A;&#x5728;&#x5355;&#x72EC;&#x7684;&#x5904;&#x7406;&#x5668;&#x6216;&#x8005;&#x5355;&#x72EC;&#x7684;&#x7535;&#x8111;&#xFF0C;&#x4F46;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x5171;&#x4EAB;&#x5355;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x76F8;&#x53CD;&#xFF0C;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x628A;&#x5DE5;&#x4F5C;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x5E76;&#x6309;&#x5E8F;&#x6267;&#x884C;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x5BF9;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x7684;&#x5E76;&#x884C;&#x8BBF;&#x95EE;&#x548C;&#x4FEE;&#x6539;&#x3002;&#x5E76;&#x884C;&#x5316;&#x548C;&#x201C;&#x5E8F;&#x5217;&#x5316;&#x201D;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7EBF;&#x7A0B;&#x4E2D;&#x4EE5;&#x534F;&#x4F5C;&#x7684;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x5F62;&#x5F0F;&#x5171;&#x5B58;&#x3002;</p>
<p>&#x591A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x7684;&#x63D2;&#x5165;&#x548C;&#x5F02;&#x6B65;&#x4E8B;&#x4EF6;&#x7684;&#x63D2;&#x5165;&#x53D1;&#x751F;&#x7684;&#x7C92;&#x5EA6;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">later</span>(<span class="hljs-params"></span>) </span>{
    answer = answer * <span class="hljs-number">2</span>;
    <span class="hljs-built_in">console</span>.log( <span class="hljs-string">&quot;Meaning of life:&quot;</span>, answer );
}
</code></pre>
<p>&#x5C3D;&#x7BA1;<code>later()</code>&#x7684;&#x5185;&#x5BB9;&#x88AB;&#x89C6;&#x4F5C;&#x5355;&#x4E2A;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x5165;&#x53E3;&#xFF0C;&#x5F53;&#x8003;&#x8651;&#x5230;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x6240;&#x5728;&#x7684;&#x7EBF;&#x7A0B;&#x65F6;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x53EF;&#x80FD;&#x6709;&#x8BB8;&#x591A;&#x4F4E;&#x7B49;&#x7EA7;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x6BD4;&#x5982;&#xFF0C;<code>answer = answer * 2</code>&#x9700;&#x8981;&#x9996;&#x5148;&#x52A0;&#x8F7D;<code>answer</code>&#x7684;&#x5F53;&#x524D;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x628A;<code>2</code>&#x653E;&#x5728;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x7136;&#x540E;&#x6267;&#x884C;&#x4E58;&#x6CD5;&#x64CD;&#x4F5C;&#xFF0C;&#x83B7;&#x5F97;&#x7ED3;&#x679C;&#x5E76;&#x628A;&#x5B83;&#x5B58;&#x56DE;<code>answer</code>&#x53D8;&#x91CF;&#x4E2D;&#x3002;</p>
<p>&#x5728;&#x5355;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x7EBF;&#x7A0B;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x4EFB;&#x52A1;&#x9879;&#x662F;&#x4F4E;&#x7B49;&#x7EA7;&#x64CD;&#x4F5C;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x65E0;&#x6CD5;&#x4E2D;&#x65AD;&#x7EBF;&#x7A0B;&#x3002;&#x4F46;&#x5982;&#x679C;&#x662F;&#x5728;&#x5E76;&#x884C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E2D;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x9884;&#x6599;&#x4E0D;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5982;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> a = <span class="hljs-number">20</span>;

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">foo</span>(<span class="hljs-params"></span>) </span>{
    a = a + <span class="hljs-number">1</span>;
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">bar</span>(<span class="hljs-params"></span>) </span>{
    a = a * <span class="hljs-number">2</span>;
}

<span class="hljs-comment">// ajax(..) is some arbitrary Ajax function given by a library</span>
ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, foo );
ajax( <span class="hljs-string">&quot;http://some.url.2&quot;</span>, bar );
</code></pre>
<p>&#x5728;JS&#x5355;&#x7EBF;&#x7A0B;&#x4E0B;&#xFF0C;&#x5982;&#x679C;<code>foo()</code>&#x5728;<code>bar()</code>&#x4E4B;&#x524D;&#x8FD0;&#x884C;&#xFF0C;&#x7ED3;&#x679C;&#x5C31;&#x662F;<code>a</code>&#x4E3A;42&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;<code>bar()</code>&#x5728;<code>foo()</code>&#x4E4B;&#x524D;&#x8FD0;&#x884C;&#xFF0C;&#x5219;<code>a</code>&#x4E3A;41&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x5171;&#x4EAB;&#x76F8;&#x540C;&#x6570;&#x636E;&#x7684;JS&#x4E8B;&#x4EF6;&#x5E76;&#x884C;&#x6267;&#x884C;&#xFF0C;&#x95EE;&#x9898;&#x53EF;&#x80FD;&#x66F4;&#x96BE;&#x4EE5;&#x6349;&#x6478;&#x3002;&#x8003;&#x8651;&#x5982;&#x4E0B;&#x4E24;&#x4E2A;&#x4F2A;&#x4EE3;&#x7801;&#x4EFB;&#x52A1;&#xFF0C;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x5404;&#x81EA;&#x8FD0;&#x884C;<code>foo()</code>&#x548C;<code>bar()</code>&#x4EE3;&#x7801;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x4EEC;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#xFF0C;&#x8003;&#x8651;&#x4E0B;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1A;</p>
<p>&#x7EBF;&#x7A0B;1:&#xFF08;<code>x</code>&#x548C;<code>y</code>&#x662F;&#x4E34;&#x65F6;&#x5185;&#x5B58;&#x4F4D;&#x7F6E;&#xFF09;</p>
<pre><code class="lang-javascript">foo():
  a. load value <span class="hljs-keyword">of</span> <span class="hljs-string">`a`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`X`</span>
  b. store <span class="hljs-string">`1`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`Y`</span>
  c. add <span class="hljs-string">`X`</span> and <span class="hljs-string">`Y`</span>, store result <span class="hljs-keyword">in</span> <span class="hljs-string">`X`</span>
  d. store value <span class="hljs-keyword">of</span> <span class="hljs-string">`X`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`a`</span>
</code></pre>
<p>&#x7EBF;&#x7A0B;2:&#xFF08;<code>x</code>&#x548C;<code>y</code>&#x662F;&#x4E34;&#x65F6;&#x5185;&#x5B58;&#x4F4D;&#x7F6E;&#xFF09;</p>
<pre><code class="lang-javascript">bar():
  a. load value <span class="hljs-keyword">of</span> <span class="hljs-string">`a`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`X`</span>
  b. store <span class="hljs-string">`2`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`Y`</span>
  c. multiply <span class="hljs-string">`X`</span> and <span class="hljs-string">`Y`</span>, store result <span class="hljs-keyword">in</span> <span class="hljs-string">`X`</span>
  d. store value <span class="hljs-keyword">of</span> <span class="hljs-string">`X`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`a`</span>
</code></pre>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x662F;&#x771F;&#x6B63;&#x5E76;&#x884C;&#x8FD0;&#x884C;&#x7684;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x6CE8;&#x610F;&#x5230;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x662F;&#x5427;&#xFF1F;&#x5B83;&#x4EEC;&#x5728;&#x4E34;&#x65F6;&#x6B65;&#x9AA4;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x4F4D;&#x7F6E;<code>x</code>&#x548C;<code>y</code>&#x3002;</p>
<p>&#x5982;&#x679C;&#x6309;&#x5982;&#x4E0B;&#x6B65;&#x9AA4;&#x6267;&#x884C;&#x4E0B;&#x6765;&#xFF0C;<code>a</code>&#x662F;&#x591A;&#x5C11;&#xFF1F;</p>
<pre><code class="lang-javascript"><span class="hljs-number">1</span>a  (load value <span class="hljs-keyword">of</span> <span class="hljs-string">`a`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`X`</span>   ==&gt; <span class="hljs-string">`20`</span>)
<span class="hljs-number">2</span>a  (load value <span class="hljs-keyword">of</span> <span class="hljs-string">`a`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`X`</span>   ==&gt; <span class="hljs-string">`20`</span>)
<span class="hljs-number">1</span>b  (store <span class="hljs-string">`1`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`Y`</span>   ==&gt; <span class="hljs-string">`1`</span>)
<span class="hljs-number">2</span>b  (store <span class="hljs-string">`2`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`Y`</span>   ==&gt; <span class="hljs-string">`2`</span>)
<span class="hljs-number">1</span>c  (add <span class="hljs-string">`X`</span> and <span class="hljs-string">`Y`</span>, store result <span class="hljs-keyword">in</span> <span class="hljs-string">`X`</span>   ==&gt; <span class="hljs-string">`22`</span>)
<span class="hljs-number">1</span>d  (store value <span class="hljs-keyword">of</span> <span class="hljs-string">`X`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`a`</span>   ==&gt; <span class="hljs-string">`22`</span>)
<span class="hljs-number">2</span>c  (multiply <span class="hljs-string">`X`</span> and <span class="hljs-string">`Y`</span>, store result <span class="hljs-keyword">in</span> <span class="hljs-string">`X`</span>   ==&gt; <span class="hljs-string">`44`</span>)
<span class="hljs-number">2</span>d  (store value <span class="hljs-keyword">of</span> <span class="hljs-string">`X`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`a`</span>   ==&gt; <span class="hljs-string">`44`</span>)
</code></pre>
<p>&#x7ED3;&#x679C;<code>a</code>&#x4E3A;<code>44</code>&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x987A;&#x5E8F;&#x5462;&#xFF1F;</p>
<pre><code class="lang-javascript"><span class="hljs-number">1</span>a  (load value <span class="hljs-keyword">of</span> <span class="hljs-string">`a`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`X`</span>   ==&gt; <span class="hljs-string">`20`</span>)
<span class="hljs-number">2</span>a  (load value <span class="hljs-keyword">of</span> <span class="hljs-string">`a`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`X`</span>   ==&gt; <span class="hljs-string">`20`</span>)
<span class="hljs-number">2</span>b  (store <span class="hljs-string">`2`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`Y`</span>   ==&gt; <span class="hljs-string">`2`</span>)
<span class="hljs-number">1</span>b  (store <span class="hljs-string">`1`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`Y`</span>   ==&gt; <span class="hljs-string">`1`</span>)
<span class="hljs-number">2</span>c  (multiply <span class="hljs-string">`X`</span> and <span class="hljs-string">`Y`</span>, store result <span class="hljs-keyword">in</span> <span class="hljs-string">`X`</span>   ==&gt; <span class="hljs-string">`20`</span>)
<span class="hljs-number">1</span>c  (add <span class="hljs-string">`X`</span> and <span class="hljs-string">`Y`</span>, store result <span class="hljs-keyword">in</span> <span class="hljs-string">`X`</span>   ==&gt; <span class="hljs-string">`21`</span>)
<span class="hljs-number">1</span>d  (store value <span class="hljs-keyword">of</span> <span class="hljs-string">`X`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`a`</span>   ==&gt; <span class="hljs-string">`21`</span>)
<span class="hljs-number">2</span>d  (store value <span class="hljs-keyword">of</span> <span class="hljs-string">`X`</span> <span class="hljs-keyword">in</span> <span class="hljs-string">`a`</span>   ==&gt; <span class="hljs-string">`21`</span>)
</code></pre>
<p>&#x6700;&#x7EC8;<code>a</code>&#x4E3A;<code>21</code>&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x7EBF;&#x7A0B;&#x7F16;&#x7A0B;&#x975E;&#x5E38;&#x5177;&#x6709;&#x6B3A;&#x9A97;&#x6027;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x91C7;&#x53D6;&#x7279;&#x522B;&#x63AA;&#x65BD;&#x6765;&#x963B;&#x6B62;&#x8FD9;&#x79CD;&#x76F8;&#x4E92;&#x5E72;&#x6270;/&#x63D2;&#x5165;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5F97;&#x5230;&#x975E;&#x5E38;&#x5947;&#x602A;&#x5E76;&#x4E14;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x7740;&#x5B9E;&#x8BA9;&#x4EBA;&#x5934;&#x75BC;&#x3002;</p>
<p>JS&#x4ECE;&#x6765;&#x4E0D;&#x5728;&#x7EBF;&#x7A0B;&#x95F4;&#x5171;&#x4EAB;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x4E0D;&#x662F;&#x5927;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x90A3;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;JS&#x603B;&#x662F;&#x786E;&#x5B9A;&#x6027;&#x7684;&#x3002;&#x8BB0;&#x5F97;&#x65E9;&#x4E9B;&#x65F6;&#x5019;&#x7684;<code>foo()</code>&#x548C;<code>bar()</code>&#x7684;&#x76F8;&#x5BF9;&#x987A;&#x5E8F;&#x5BFC;&#x81F4;&#x7684;&#x4E0D;&#x540C;&#x7ED3;&#x679C;&#x5417;(<code>41</code>&#x8FD8;&#x662F;<code>42</code>)&#xFF1F;</p>
<p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong> &#x5C3D;&#x7BA1;&#x4E0D;&#x660E;&#x663E;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x90FD;&#x662F;&#x574F;&#x7684;&#x3002;&#x6709;&#x65F6;&#x662F;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x6709;&#x65F6;&#x662F;&#x7279;&#x610F;&#x7684;&#x3002;&#x5728;&#x4E0B;&#x6587;&#x4EE5;&#x53CA;&#x540E;&#x9762;&#x51E0;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x66F4;&#x591A;&#x793A;&#x4F8B;&#x3002;</p>
<h3 id="&#x8FD0;&#x884C;&#x76F4;&#x81F3;&#x7ED3;&#x675F;&#xFF08;run-to-completion&#xFF09;">&#x8FD0;&#x884C;&#x76F4;&#x81F3;&#x7ED3;&#x675F;&#xFF08;Run-to-Completion&#xFF09;</h3>
<p>&#x56E0;&#x4E3A;JS&#x662F;&#x5355;&#x7EBF;&#x7A0B;&#x7684;&#xFF0C;<code>foo()</code>&#xFF08;&#x548C;<code>bar()</code>&#xFF09;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x539F;&#x5B50;&#x6027;&#x7684;&#xFF0C;&#x610F;&#x601D;&#x662F;&#x4E00;&#x65E6;<code>foo()</code>&#x5F00;&#x59CB;&#x8FD0;&#x884C;&#xFF0C;&#x5B83;&#x7684;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x5C06;&#x4F1A;&#x5728;<code>bar()</code>&#x4E2D;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x524D;&#x6267;&#x884C;&#x5B8C;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x662F;&#x5982;&#x6B64;&#x3002;&#x8FD9;&#x5C31;&#x53EB;&#x505A;&#x201C;&#x8FD0;&#x884C;&#x76F4;&#x81F3;&#x7ED3;&#x675F;&#x201D;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5982;&#x679C;<code>foo()</code>&#x548C;<code>bar()</code>&#x7684;&#x5185;&#x90E8;&#x6709;&#x66F4;&#x591A;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;run-to-completion&#x8BED;&#x4E49;&#x66F4;&#x660E;&#x663E;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> a = <span class="hljs-number">1</span>;
<span class="hljs-keyword">var</span> b = <span class="hljs-number">2</span>;

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">foo</span>(<span class="hljs-params"></span>) </span>{
    a++;
    b = b * a;
    a = b + <span class="hljs-number">3</span>;
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">bar</span>(<span class="hljs-params"></span>) </span>{
    b--;
    a = <span class="hljs-number">8</span> + b;
    b = a * <span class="hljs-number">2</span>;
}

<span class="hljs-comment">// ajax(..) is some arbitrary Ajax function given by a library</span>
ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, foo );
ajax( <span class="hljs-string">&quot;http://some.url.2&quot;</span>, bar );
</code></pre>
<p>&#x56E0;&#x4E3A;<code>bar()</code>&#x65E0;&#x6CD5;&#x4E2D;&#x65AD;<code>foo()</code>&#xFF0C;&#x5E76;&#x4E14;<code>foo()</code>&#x4E5F;&#x65E0;&#x6CD5;&#x4E2D;&#x65AD;<code>bar()</code>,&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x54EA;&#x4E00;&#x4E2A;&#x9996;&#x5148;&#x8FD0;&#x884C;--&#x5047;&#x5982;&#x6709;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x8BDD;&#xFF0C;<code>foo()</code>&#x548C;<code>bar()</code>&#x4E2D;&#x7684;&#x8BED;&#x53E5;&#x5C31;&#x53EF;&#x80FD;&#x76F8;&#x4E92;&#x4EA4;&#x53C9;&#xFF0C;&#x53EF;&#x80FD;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x4F1A;&#x6025;&#x5267;&#x589E;&#x52A0;&#xFF01;</p>
<p>&#x5757;1&#x662F;&#x540C;&#x6B65;&#x7684;&#xFF08;<em>&#x73B0;&#x5728;</em> &#x53D1;&#x751F;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x5757;2&#x548C;3&#x662F;&#x5F02;&#x6B65;&#x7684;&#xFF08;<em>&#x4EE5;&#x540E;</em> &#x53D1;&#x751F;&#xFF09;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4EEC;&#x7684;&#x6267;&#x884C;&#x4F1A;&#x88AB;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x754C;&#x9650;&#x5206;&#x9694;&#x5F00;&#x3002;</p>
<p>&#x5757;1&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> a = <span class="hljs-number">1</span>;
<span class="hljs-keyword">var</span> b = <span class="hljs-number">2</span>;
</code></pre>
<p>&#x5757;2&#xFF08;<code>foo()</code>&#xFF09;:</p>
<pre><code class="lang-javascript">a++;
b = b * a;
a = b + <span class="hljs-number">3</span>;
</code></pre>
<p>&#x5757;3&#xFF08;<code>bar()</code>&#xFF09;&#xFF1A;</p>
<pre><code class="lang-javascript">b--;
a = <span class="hljs-number">8</span> + b;
b = a * <span class="hljs-number">2</span>;
</code></pre>
<p>&#x5757;2&#x548C;3&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x7B2C;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x6BB5;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x6709;&#x4E24;&#x4E2A;&#x7ED3;&#x679C;&#xFF0C;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>&#x7ED3;&#x679C;1&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> a = <span class="hljs-number">1</span>;
<span class="hljs-keyword">var</span> b = <span class="hljs-number">2</span>;

<span class="hljs-comment">// foo()</span>
a++;
b = b * a;
a = b + <span class="hljs-number">3</span>;

<span class="hljs-comment">// bar()</span>
b--;
a = <span class="hljs-number">8</span> + b;
b = a * <span class="hljs-number">2</span>;

a; <span class="hljs-comment">// 11</span>
b; <span class="hljs-comment">// 22</span>
</code></pre>
<p>&#x7ED3;&#x679C;2&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> a = <span class="hljs-number">1</span>;
<span class="hljs-keyword">var</span> b = <span class="hljs-number">2</span>;

<span class="hljs-comment">// bar()</span>
b--;
a = <span class="hljs-number">8</span> + b;
b = a * <span class="hljs-number">2</span>;

<span class="hljs-comment">// foo()</span>
a++;
b = b * a;
a = b + <span class="hljs-number">3</span>;

a; <span class="hljs-comment">// 183</span>
b; <span class="hljs-comment">// 180</span>
</code></pre>
<p>&#x540C;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x6709;&#x4E24;&#x79CD;&#x7ED3;&#x679C;&#x8868;&#x660E;&#x4ECD;&#x7136;&#x6709;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x4F46;&#x8FD9;&#x662F;&#x5728;&#x51FD;&#x6570;&#xFF08;&#x4E8B;&#x4EF6;&#xFF09;&#x7EA7;&#x7684;&#x987A;&#x5E8F;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x662F;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x65F6;&#x8BED;&#x53E5;&#x7EA7;&#xFF08;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x8868;&#x8FBE;&#x5F0F;&#x64CD;&#x4F5C;&#x7EA7;&#xFF09;&#x7684;&#x987A;&#x5E8F;&#x95EE;&#x9898;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x8FD9;&#x6BD4;&#x591A;&#x7EBF;&#x7A0B;&#x66F4;&#x5177;&#x786E;&#x5B9A;&#x6027;&#x3002;</p>
<p>JS&#x4E2D;&#x8FD9;&#x79CD;&#x51FD;&#x6570;&#x987A;&#x5E8F;&#x7684;&#x975E;&#x786E;&#x5B9A;&#x6027;&#x884C;&#x4E3A;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x201C;&#x7ADE;&#x6001;&#x201D;(race condition)&#xFF0C;<code>foo()</code>&#x548C;<code>bar()</code>&#x4F1A;&#x76F8;&#x4E92;&#x7ADE;&#x4E89;&#xFF0C;&#x770B;&#x8C01;&#x5148;&#x8FD0;&#x884C;&#x5B8C;&#x3002;&#x7279;&#x522B;&#x5730;&#xFF0C;&#x4E4B;&#x6240;&#x4EE5;&#x79F0;&#x4E3A;&#x201C;&#x7ADE;&#x6001;&#x201D;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x65E0;&#x6CD5;&#x53EF;&#x9760;&#x5730;&#x9884;&#x6D4B;<code>a</code>&#x548C;<code>b</code>&#x7684;&#x7ED3;&#x679C;&#x4F1A;&#x662F;&#x600E;&#x6837;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong> &#x5982;&#x679C;JS&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x662F;&#x8FD0;&#x884C;&#x76F4;&#x81F3;&#x7ED3;&#x675F;&#x7684;&#xFF08;run-to-completion&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x66F4;&#x591A;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5BF9;&#x5417;&#xFF1F;ES6&#x786E;&#x5B9E;&#x5F15;&#x5165;&#x4E86;&#x8FD9;&#x4E48;&#x4E2A;&#x4E1C;&#x897F;&#xFF08;&#x8BE6;&#x89C1;&#x7B2C;&#x56DB;&#x7AE0;&#x201C;&#x751F;&#x6210;&#x5668;&#x201D;&#xFF09;&#xFF0C;&#x4F46;&#x522B;&#x62C5;&#x5FC3;&#xFF0C;&#x6211;&#x4EEC;&#x56DE;&#x5934;&#x4F1A;&#x8BB2;&#x7684;&#xFF01;</p>
<h2 id="&#x5E76;&#x53D1;&#xFF08;concurrency&#xFF09;">&#x5E76;&#x53D1;&#xFF08;Concurrency&#xFF09;</h2>
<p>&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x663E;&#x793A;&#x72B6;&#x6001;&#x66F4;&#x65B0;&#x5217;&#x8868;&#x7684;&#x7AD9;&#x70B9;&#xFF08;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x7684;&#x6D88;&#x606F;&#x63D0;&#x793A;&#xFF09;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x5411;&#x4E0B;&#x6EDA;&#x52A8;&#x5217;&#x8868;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7F51;&#x7AD9;&#x9010;&#x6B65;&#x52A0;&#x8F7D;&#x5185;&#x5BB9;&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x6548;&#x679C;&#xFF0C;&#xFF08;&#x81F3;&#x5C11;&#xFF09;&#x9700;&#x8981;&#x540C;&#x65F6;&#xFF08;&#x5373;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x7A97;&#x53E3;&#xFF0C;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x8981;&#x540C;&#x4E00;&#x65F6;&#x523B;&#xFF09;&#x5206;&#x522B;&#x6267;&#x884C;&#x4E24;&#x4E2A;&#x201C;&#x8FDB;&#x7A0B;&#x201D;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong> &#x6B64;&#x5904;&#x6211;&#x4EEC;&#x5728;&#x201C;&#x8FDB;&#x7A0B;&#x201D;&#x4E0A;&#x4F7F;&#x7528;&#x4E86;&#x5F15;&#x53F7;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E2D;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7EA7;&#x7684;&#x8FDB;&#x7A0B;&#x6982;&#x5FF5;&#x3002;&#x8FD9;&#x662F;&#x865A;&#x62DF;&#x8FDB;&#x7A0B;&#xFF0C;&#x6216;&#x8005;&#x53EB;&#x4EFB;&#x52A1;&#xFF0C;&#x4EE3;&#x8868;&#x4E86;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x8FDE;&#x63A5;&#xFF0C;&#x5E8F;&#x5217;&#x5316;&#x64CD;&#x4F5C;&#x3002;&#x76F8;&#x6BD4;&#x4E8E;&#x201C;&#x4EFB;&#x52A1;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x66F4;&#x559C;&#x6B22;&#x7528;&#x201C;&#x8FDB;&#x7A0B;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x4ECE;&#x672F;&#x8BED;&#x5C42;&#x9762;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x66F4;&#x5339;&#x914D;&#x6211;&#x4EEC;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x6982;&#x5FF5;&#x5B9A;&#x4E49;&#x3002;</p>
<p>&#x5F53;&#x7528;&#x6237;&#x5411;&#x4E0B;&#x6EDA;&#x52A8;&#x9875;&#x9762;&#x4EE5;&#x83B7;&#x53D6;&#x65B0;&#x5185;&#x5BB9;&#x65F6;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x201C;&#x8FDB;&#x7A0B;&#x201D;&#x8D1F;&#x8D23;<code>onscroll</code>&#x4E8B;&#x4EF6;&#xFF08;&#x53D1;Ajax&#x8BF7;&#x6C42;&#x83B7;&#x53D6;&#x65B0;&#x5185;&#x5BB9;&#xFF09;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x201C;&#x8FDB;&#x7A0B;&#x201D;&#x8D1F;&#x8D23;&#x63A5;&#x6536;Ajax&#x54CD;&#x5E94;&#xFF08;&#x628A;&#x5185;&#x5BB9;&#x6E32;&#x67D3;&#x5230;&#x9875;&#x9762;&#x4E0A;&#xFF09;&#x3002;</p>
<p>&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#x5FEB;&#x901F;&#x6EDA;&#x52A8;&#xFF0C;&#x5728;&#x83B7;&#x53D6;&#x7B2C;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x5E76;&#x5904;&#x7406;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4E24;&#x4E2A;&#x751A;&#x81F3;&#x66F4;&#x591A;&#x7684;<code>onscroll</code>&#x4E8B;&#x4EF6;&#x89E6;&#x53D1;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;<code>onscroll</code>&#x4E8B;&#x4EF6;&#x548C;Ajax&#x54CD;&#x5E94;&#x4E8B;&#x4EF6;&#x76F8;&#x4E92;&#x4EA4;&#x53C9;&#xFF0C;&#x5FEB;&#x901F;&#x5730;&#x89E6;&#x53D1;&#x3002;</p>
<p>&#x5E76;&#x53D1;&#x662F;&#x6307;&#x4E24;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x201C;&#x8FDB;&#x7A0B;&#x201D;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x6BB5;&#x5185;&#x540C;&#x65F6;&#x6267;&#x884C;&#xFF0C;&#x4E0D;&#x7BA1;&#x5B83;&#x4EEC;&#x5404;&#x81EA;&#x7684;&#x64CD;&#x4F5C;&#x662F;&#x5426;&#x662F;&#x5E76;&#x884C;&#x7684;&#xFF08;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5904;&#x7406;&#x5668;&#x6216;&#x8005;&#x6838;&#x5FC3;&#x4E0A;&#xFF09;&#x3002;&#x76F8;&#x6BD4;&#x4E8E;&#x64CD;&#x4F5C;&#x7EA7;&#x5E76;&#x884C;&#xFF08;&#x4E0D;&#x540C;&#x7684;&#x5904;&#x7406;&#x5668;&#x7EBF;&#x7A0B;&#xFF09;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x5E76;&#x53D1;&#x662F;&#x201C;&#x8FDB;&#x7A0B;&#x201D;&#x7EA7;&#xFF08;&#x6216;&#x4EFB;&#x52A1;&#x7EA7;&#xFF09;&#x7684;&#x5E76;&#x884C;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong> &#x5E76;&#x53D1;&#x540C;&#x6837;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x53EF;&#x9009;&#x7684;&#x201C;&#x591A;&#x8FDB;&#x7A0B;&#x201D;&#x4EA4;&#x4E92;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4E4B;&#x540E;&#x4F1A;&#x6709;&#x6240;&#x63D0;&#x53CA;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7ED9;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x7A97;&#x53E3;&#xFF08;&#x51E0;&#x79D2;&#x949F;&#xFF0C;&#x5927;&#x6982;&#x4E3A;&#x7528;&#x6237;&#x7684;&#x6EDA;&#x52A8;&#x65F6;&#x95F4;&#xFF09;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5C06;&#x6BCF;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x201C;&#x8FDB;&#x7A0B;&#x201D;&#x60F3;&#x8C61;&#x4E3A;&#x4E00;&#x7CFB;&#x5217;&#x4E8B;&#x4EF6;/&#x64CD;&#x4F5C;&#xFF1A;</p>
<p>&#x201C;&#x8FDB;&#x7A0B;&#x201D;1&#xFF08;<code>onscroll</code>&#x4E8B;&#x4EF6;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-javascript">onscroll, request <span class="hljs-number">1</span>
onscroll, request <span class="hljs-number">2</span>
onscroll, request <span class="hljs-number">3</span>
onscroll, request <span class="hljs-number">4</span>
onscroll, request <span class="hljs-number">5</span>
onscroll, request <span class="hljs-number">6</span>
onscroll, request <span class="hljs-number">7</span>
</code></pre>
<p>&#x201C;&#x8FDB;&#x7A0B;&#x201D;2&#xFF08;Ajax&#x54CD;&#x5E94;&#x4E8B;&#x4EF6;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-javascript">response <span class="hljs-number">1</span>
response <span class="hljs-number">2</span>
response <span class="hljs-number">3</span>
response <span class="hljs-number">4</span>
response <span class="hljs-number">5</span>
response <span class="hljs-number">6</span>
response <span class="hljs-number">7</span>
</code></pre>
<p>&#x5F88;&#x53EF;&#x80FD;&#x4E00;&#x4E2A;<code>onscroll</code>&#x65F6;&#x95F4;&#x548C;&#x4E00;&#x4E2A;Ajax&#x54CD;&#x5E94;&#x4E8B;&#x4EF6;&#x540C;&#x65F6;&#x5F97;&#x5230;&#x5904;&#x7406;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4ECE;&#x65F6;&#x95F4;&#x8F74;&#x89D2;&#x5EA6;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#x8FD9;&#x4E9B;&#x4E8B;&#x4EF6;&#xFF1A;</p>
<pre><code class="lang-javascript">onscroll, request <span class="hljs-number">1</span>
onscroll, request <span class="hljs-number">2</span>          response <span class="hljs-number">1</span>
onscroll, request <span class="hljs-number">3</span>          response <span class="hljs-number">2</span>
response <span class="hljs-number">3</span>
onscroll, request <span class="hljs-number">4</span>
onscroll, request <span class="hljs-number">5</span>
onscroll, request <span class="hljs-number">6</span>          response <span class="hljs-number">4</span>
onscroll, request <span class="hljs-number">7</span>
response <span class="hljs-number">6</span>
response <span class="hljs-number">5</span>
response <span class="hljs-number">7</span>
</code></pre>
<p>&#x4F46;&#x662F;&#xFF0C;&#x8BF7;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#x672C;&#x7AE0;&#x524D;&#x9762;&#x90E8;&#x5206;&#x63D0;&#x5230;&#x7684;&#x6982;&#x5FF5;&#xFF0C;JS&#x5728;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x53EA;&#x80FD;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x8981;&#x4E48;<code>onscroll, request 2</code>&#x5148;&#x53D1;&#x751F;&#xFF0C;&#x8981;&#x4E48;<code>response 1</code>&#x5148;&#x53D1;&#x751F;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0D;&#x53EF;&#x80FD;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x53D1;&#x751F;&#x3002;&#x5C31;&#x50CF;&#x5B66;&#x6821;&#x81EA;&#x52A9;&#x9910;&#x5385;&#x7684;&#x5B69;&#x5B50;&#x4EEC;&#x4E00;&#x6837;&#xFF0C;&#x4E0D;&#x8BBA;&#x5728;&#x95E8;&#x5916;&#x6324;&#x6210;&#x4EC0;&#x4E48;&#x6837;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x5F97;&#x6392;&#x6210;&#x961F;&#x6765;&#x5403;&#x5348;&#x9910;!</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x628A;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4E8B;&#x4EF6;&#x60F3;&#x8C61;&#x4E3A;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x961F;&#x5217;&#x3002;</p>
<p>&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x961F;&#x5217;&#xFF1A;</p>
<pre><code class="lang-javascript">onscroll, request <span class="hljs-number">1</span>   &lt;--- Process <span class="hljs-number">1</span> starts
onscroll, request <span class="hljs-number">2</span>
response <span class="hljs-number">1</span>            &lt;--- Process <span class="hljs-number">2</span> starts
onscroll, request <span class="hljs-number">3</span>
response <span class="hljs-number">2</span>
response <span class="hljs-number">3</span>
onscroll, request <span class="hljs-number">4</span>
onscroll, request <span class="hljs-number">5</span>
onscroll, request <span class="hljs-number">6</span>
response <span class="hljs-number">4</span>
onscroll, request <span class="hljs-number">7</span>   &lt;--- Process <span class="hljs-number">1</span> finishes
response <span class="hljs-number">6</span>
response <span class="hljs-number">5</span>
response <span class="hljs-number">7</span>            &lt;--- Process <span class="hljs-number">2</span> finishes
</code></pre>
<p>&#x201C;&#x8FDB;&#x7A0B;1&#x201C;&#x548C;&#x201D;&#x8FDB;&#x7A0B;2&#x201C;&#x5E76;&#x53D1;&#x8FD0;&#x884C;&#xFF08;&#x4EFB;&#x52A1;&#x7EA7;&#x5E76;&#x884C;&#xFF09;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x5404;&#x81EA;&#x7684;&#x4E8B;&#x4EF6;&#x5728;&#x4E8B;&#x4EF6;&#x961F;&#x5217;&#x4E2D;&#x6309;&#x5E8F;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x987A;&#x4FBF;&#x63D0;&#x4E00;&#x53E5;&#xFF0C;&#x6CE8;&#x610F;&#x5230;<code>response 6</code>&#x548C;<code>response 5</code>&#x662F;&#x600E;&#x4E48;&#x6CA1;&#x6709;&#x6309;&#x7167;&#x9884;&#x671F;&#x987A;&#x5E8F;&#x8FD4;&#x56DE;&#x7684;&#x5417;&#xFF1F;</p>
<p>&#x5355;&#x7EBF;&#x7A0B;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x662F;&#x5E76;&#x53D1;&#x7684;&#x4E00;&#x79CD;&#x8868;&#x73B0;&#x5F62;&#x5F0F;&#xFF08;&#x5F53;&#x7136;&#x8FD8;&#x6709;&#x5176;&#x5B83;&#x5F62;&#x5F0F;&#xFF0C;&#x540E;&#x9762;&#x4F1A;&#x63D0;&#x53CA;&#xFF09;&#x3002;</p>
<h3 id="&#x975E;&#x4EA4;&#x4E92;&#xFF08;noninteracting&#xFF09;">&#x975E;&#x4EA4;&#x4E92;&#xFF08;Noninteracting&#xFF09;</h3>
<p>&#x5C3D;&#x7BA1;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x4E24;&#x4E2A;&#x6216;&#x66F4;&#x591A;&#x7684;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#x5E76;&#x53D1;&#x5730;&#x63D2;&#x5165;&#x5404;&#x81EA;&#x7684;&#x6B65;&#x9AA4;/&#x4E8B;&#x4EF6;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4EFB;&#x52A1;&#x4E0D;&#x76F8;&#x5173;&#xFF0C;&#x5B83;&#x4EEC;&#x6CA1;&#x5FC5;&#x8981;&#x4EA4;&#x4E92;&#x3002;<strong>&#x5982;&#x679C;&#x5B83;&#x4EEC;&#x4E0D;&#x4EA4;&#x4E92;&#xFF0C;&#x975E;&#x786E;&#x5B9A;&#x6027;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;</strong>&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> res = {};

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">foo</span>(<span class="hljs-params">results</span>) </span>{
    res.foo = results;
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">bar</span>(<span class="hljs-params">results</span>) </span>{
    res.bar = results;
}

<span class="hljs-comment">// ajax(..) is some arbitrary Ajax function given by a library</span>
ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, foo );
ajax( <span class="hljs-string">&quot;http://some.url.2&quot;</span>, bar );
</code></pre>
<p><code>foo()</code>&#x548C;<code>bar()</code>&#x662F;&#x4E24;&#x4E2A;&#x5E76;&#x53D1;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#xFF0C;&#x65E0;&#x6CD5;&#x786E;&#x5B9A;&#x54EA;&#x4E00;&#x4E2A;&#x5148;&#x89E6;&#x53D1;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x7684;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E0D;&#x7BA1;&#x54EA;&#x4E2A;&#x5148;&#x89E6;&#x53D1;&#x90FD;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4EA4;&#x4E92;&#x3002;</p>
<p>&#x8FD9;&#x4E0D;&#x662F;&#x4E2A;&#x201D;&#x7ADE;&#x6001;&#xFF08;race condition&#xFF09;&#x201C;bug&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x8BBA;&#x987A;&#x5E8F;&#x5982;&#x4F55;&#xFF0C;&#x4EE3;&#x7801;&#x90FD;&#x80FD;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x3002;</p>
<h3 id="&#x4EA4;&#x4E92;&#xFF08;interaction&#xFF09;">&#x4EA4;&#x4E92;&#xFF08;Interaction&#xFF09;</h3>
<p>&#x66F4;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x95F4;&#x63A5;&#x5730;&#x901A;&#x8FC7;&#x4F5C;&#x7528;&#x57DF;&#x548C;/&#x6216;DOM&#xFF0C;&#x5E76;&#x53D1;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#x6709;&#x5FC5;&#x8981;&#x4EA4;&#x4E92;&#x3002;&#x5F53;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x4EA4;&#x4E92;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x534F;&#x8C03;&#x8FD9;&#x4E9B;&#x4EA4;&#x4E92;&#x6765;&#x963B;&#x6B62;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x7684;&#x201D;&#x7ADE;&#x6001;&#x201C;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x4E00;&#x4E2A;&#x7531;&#x4E8E;&#x6F5C;&#x5728;&#x987A;&#x5E8F;&#x95EE;&#x9898;&#xFF0C;&#x4E24;&#x4E2A;&#x5E76;&#x53D1;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#x4EA4;&#x4E92;&#x7684;&#x7B80;&#x5355;&#x4F8B;&#x5B50;&#xFF0C;&#x6709;&#x65F6;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x5F02;&#x5E38;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> res = [];

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">response</span>(<span class="hljs-params">data</span>) </span>{
    res.push( data );
}

<span class="hljs-comment">// ajax(..) is some arbitrary Ajax function given by a library</span>
ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, response );
ajax( <span class="hljs-string">&quot;http://some.url.2&quot;</span>, response );
</code></pre>
<p>&#x5E76;&#x53D1;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#x662F;&#x4E24;&#x4E2A;<code>response()</code>&#x8C03;&#x7528;&#xFF0C;&#x7528;&#x6765;&#x5904;&#x7406;Ajax&#x54CD;&#x5E94;&#x3002;&#x5B83;&#x4EEC;&#x8C01;&#x90FD;&#x53EF;&#x80FD;&#x5148;&#x53D1;&#x751F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5047;&#x5B9A;&#x9884;&#x671F;&#x7684;&#x7ED3;&#x679C;&#x662F;<code>res[0]</code>&#x4FDD;&#x5B58;&#x4E86;<code>http://some.url.1</code>&#x8C03;&#x7528;&#x8FD4;&#x56DE;&#x7684;&#x7ED3;&#x679C;&#xFF0C;<code>res[1]</code>&#x4FDD;&#x5B58;&#x4E86;<code>http://some.url.2</code>&#x8C03;&#x7528;&#x8FD4;&#x56DE;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x6709;&#x65F6;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x7ED3;&#x679C;&#x5B8C;&#x5168;&#x53CD;&#x8FC7;&#x6765;&#xFF0C;&#x4F9D;&#x8C01;&#x5148;&#x5B8C;&#x6210;&#x800C;&#x5B9A;&#x3002;&#x8FD9;&#x4E00;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x5F88;&#x50CF;&#x4E00;&#x4E2A;&#x201D;&#x7ADE;&#x6001;&#x201C;bug&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong> &#x5728;&#x7C7B;&#x4F3C;&#x8FD9;&#x79CD;&#x60C5;&#x5F62;&#x4E0B;&#xFF0C;&#x4F5C;&#x51FA;&#x5047;&#x8BBE;&#x524D;&#x4E00;&#x5B9A;&#x8981;&#x8C28;&#x614E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6216;&#x8BB8;&#x6839;&#x636E;&#x5904;&#x7406;&#x4EFB;&#x52A1;&#xFF08;&#x6BD4;&#x5982;&#x6570;&#x636E;&#x5E93;&#x4EFB;&#x52A1;&#x6216;&#x8005;&#x5176;&#x5B83;&#x6293;&#x53D6;&#x9759;&#x6001;&#x6587;&#x4EF6;&#x4EFB;&#x52A1;&#xFF09;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6CE8;&#x610F;&#x5230;<code>http://some.url.2</code>&#x7684;&#x54CD;&#x5E94;&#x201D;&#x603B;&#x662F;&#x201C;&#x6BD4;<code>http://some.url.1</code>&#x6162;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x89C2;&#x6D4B;&#x7684;&#x7ED3;&#x679C;&#x603B;&#x662F;&#x548C;&#x9884;&#x671F;&#x7684;&#x987A;&#x5E8F;&#x4E00;&#x81F4;&#xFF0C;&#x8FD9;&#x5F88;&#x5E38;&#x89C1;&#x3002;&#x5373;&#x4F7F;&#x4E24;&#x4E2A;&#x8BF7;&#x6C42;&#x53D1;&#x5411;&#x4E86;&#x540C;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x670D;&#x52A1;&#x5668;&#x6309;&#x7167;&#x7279;&#x5B9A;&#x987A;&#x5E8F;&#x8FD4;&#x56DE;&#x4E86;&#x54CD;&#x5E94;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x8FD4;&#x56DE;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x54CD;&#x5E94;&#x7684;&#x987A;&#x5E8F;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x4E86;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x7ADE;&#x6001;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x534F;&#x8C03;&#x4E0B;&#x6709;&#x5E8F;&#x4EA4;&#x4E92;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> res = [];

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">response</span>(<span class="hljs-params">data</span>) </span>{
    <span class="hljs-keyword">if</span> (data.url == <span class="hljs-string">&quot;http://some.url.1&quot;</span>) {
        res[<span class="hljs-number">0</span>] = data;
    }
    <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (data.url == <span class="hljs-string">&quot;http://some.url.2&quot;</span>) {
        res[<span class="hljs-number">1</span>] = data;
    }
}

<span class="hljs-comment">// ajax(..) is some arbitrary Ajax function given by a library</span>
ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, response );
ajax( <span class="hljs-string">&quot;http://some.url.2&quot;</span>, response );
</code></pre>
<p>&#x4E0D;&#x7BA1;&#x54EA;&#x4E2A;Ajax&#x54CD;&#x5E94;&#x5148;&#x8FD4;&#x56DE;&#xFF0C;&#x6211;&#x4EEC;&#x68C0;&#x67E5;<code>data.url</code>&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x53EF;&#x4EE5;&#x5047;&#x5B9A;&#x662F;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x8FD4;&#x56DE;&#x7684;&#xFF09;&#xFF0C;&#x786E;&#x5B9A;&#x54CD;&#x5E94;&#x6570;&#x636E;&#x5E94;&#x8BE5;&#x5360;&#x636E;<code>res</code>&#x6570;&#x7EC4;&#x7684;&#x54EA;&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;<code>res[0]</code>&#x6C38;&#x8FDC;&#x5B58;&#x653E;&#x7740;<code>http://some.url.1</code>&#x7684;&#x7ED3;&#x679C;&#xFF0C;<code>res[1]</code>&#x6C38;&#x8FDC;&#x5B58;&#x653E;&#x7740;<code>http://some.url.2</code>&#x7684;&#x7ED3;&#x679C;&#x3002;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x7684;&#x534F;&#x8C03;&#xFF0C;&#x6211;&#x4EEC;&#x6D88;&#x9664;&#x4E86;&#x7ADE;&#x6001;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x3002;</p>
<p>&#x540C;&#x6837;&#x7684;&#x9053;&#x7406;&#xFF0C;&#x5982;&#x679C;&#x591A;&#x4E2A;&#x5E76;&#x53D1;&#x51FD;&#x6570;&#x901A;&#x8FC7;&#x5171;&#x4EAB;DOM&#x4EA4;&#x4E92;&#x8C03;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x66F4;&#x65B0;<code>&lt;div&gt;</code>&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5176;&#x5B83;&#x7684;&#x66F4;&#x65B0;<code>&lt;div&gt;</code>&#x7684;&#x6837;&#x5F0F;&#x6216;&#x8005;&#x5C5E;&#x6027;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x4E00;&#x65E6;&#x6709;&#x5185;&#x5BB9;&#xFF0C;&#x5219;&#x8BA9;DOM&#x5143;&#x7D20;&#x53EF;&#x89C1;&#xFF09;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x4E0D;&#x60F3;&#x5728;&#x6709;&#x5185;&#x5BB9;&#x524D;&#x663E;&#x793A;DOM&#x5143;&#x7D20;&#xFF0C;&#x56E0;&#x6B64;&#x534F;&#x8C03;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x5408;&#x9002;&#x7684;&#x4EA4;&#x4E92;&#x987A;&#x5E8F;&#x3002;</p>
<p>&#x6CA1;&#x6709;&#x534F;&#x8C03;&#x4EA4;&#x4E92;&#x7684;&#x8BDD;&#xFF0C;&#x4E00;&#x4E9B;&#x5E76;&#x53D1;&#x573A;&#x666F;&#x603B;&#x662F;&#x4F1A;&#x5BFC;&#x81F4;&#x5F02;&#x5E38;&#xFF08;&#x4E0D;&#x53EA;&#x662F;&#x6709;&#x65F6;&#xFF09;&#x3002;&#x8003;&#x8651;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> a, b;

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">foo</span>(<span class="hljs-params">x</span>) </span>{
    a = x * <span class="hljs-number">2</span>;
    baz();
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">bar</span>(<span class="hljs-params">y</span>) </span>{
    b = y * <span class="hljs-number">2</span>;
    baz();
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">baz</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log(a + b);
}

<span class="hljs-comment">// ajax(..) is some arbitrary Ajax function given by a library</span>
ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, foo );
ajax( <span class="hljs-string">&quot;http://some.url.2&quot;</span>, bar );
</code></pre>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x5F53;&#x4E2D;&#xFF0C;&#x4E0D;&#x8BBA;<code>foo()</code>&#x548C;<code>bar()</code>&#x8C01;&#x5148;&#x89E6;&#x53D1;&#xFF0C;&#x603B;&#x4F1A;&#x5BFC;&#x81F4;<code>baz()</code>&#x8FC7;&#x65E9;&#x8FD0;&#x884C;&#xFF08;<code>a</code>&#x6216;&#x8005;<code>b</code>&#x603B;&#x6709;&#x4E00;&#x4E2A;&#x662F;<code>undefined</code>&#xFF09;,&#x4F46;&#x5728;&#x7B2C;&#x4E8C;&#x6B21;&#x8C03;&#x7528;<code>baz()</code>&#x65F6;&#x5C31;&#x6B63;&#x5E38;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;<code>a</code>&#x548C;<code>b</code>&#x90FD;&#x6709;&#x503C;&#x4E86;&#x3002;</p>
<p>&#x6709;&#x4E0D;&#x540C;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4EE5;&#x4E0B;&#x662F;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> a, b;

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">foo</span>(<span class="hljs-params">x</span>) </span>{
    a = x * <span class="hljs-number">2</span>;
    <span class="hljs-keyword">if</span> (a &amp;&amp; b) {
        baz();
    }
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">bar</span>(<span class="hljs-params">y</span>) </span>{
    b = y * <span class="hljs-number">2</span>;
    <span class="hljs-keyword">if</span> (a &amp;&amp; b) {
        baz();
    }
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">baz</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log( a + b );
}

<span class="hljs-comment">// ajax(..) is some arbitrary Ajax function given by a library</span>
ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, foo );
ajax( <span class="hljs-string">&quot;http://some.url.2&quot;</span>, bar );
</code></pre>
<p><code>baz()</code>&#x5916;&#x56F4;&#x7684;<code>if (a &amp;&amp; b)</code>&#x6761;&#x4EF6;&#x4E00;&#x822C;&#x79F0;&#x4E3A;&#x201D;&#x95E8;&#xFF08;gate&#xFF09;&#x201C;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x786E;&#x5B9A;<code>a</code>&#x548C;<code>b</code>&#x7684;&#x5230;&#x8FBE;&#x987A;&#x5E8F;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x5728;&#x95E8;&#x6253;&#x5F00;&#xFF08;&#x8C03;&#x7528;<code>baz()</code>&#xFF09;&#x524D;&#xFF0C;&#x7B49;&#x4E24;&#x4E2A;&#x90FD;&#x5230;&#x8FBE;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x78B0;&#x5230;&#x7684;&#x5E76;&#x53D1;&#x4EA4;&#x4E92;&#x60C5;&#x5F62;&#x6709;&#x65F6;&#x79F0;&#x4E3A;&#x201D;&#x7ADE;&#x4E89;&#xFF08;race&#xFF09;&#x201C;&#xFF0C;&#x66F4;&#x786E;&#x5207;&#x5730;&#x5E94;&#x8BE5;&#x53EB;&#x201D;&#x95E9;&#xFF08;latch&#xFF09;&#x201C;&#x3002;&#x5B83;&#x7684;&#x7279;&#x70B9;&#x662F;&#x201D;&#x53EA;&#x6709;&#x7B2C;&#x4E00;&#x4E2A;&#x8D62;&#x201C;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x975E;&#x786E;&#x5B9A;&#x6027;&#x662F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x4F60;&#x660E;&#x786E;&#x8BF4;&#x660E;&#x4E86;&#x201D;&#x7ADE;&#x4E89;&#x201C;&#x76F4;&#x81F3;&#x7EC8;&#x70B9;&#xFF0C;&#x53EA;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x80DC;&#x8005;&#x662F;OK&#x7684;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5982;&#x4E0B;&#x5F02;&#x5E38;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> a;

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">foo</span>(<span class="hljs-params">x</span>) </span>{
    a = x * <span class="hljs-number">2</span>;
    baz();
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">bar</span>(<span class="hljs-params">x</span>) </span>{
    a = x / <span class="hljs-number">2</span>;
    baz();
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">baz</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log( a );
}

<span class="hljs-comment">// ajax(..) is some arbitrary Ajax function given by a library</span>
ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, foo );
ajax( <span class="hljs-string">&quot;http://some.url.2&quot;</span>, bar );
</code></pre>
<p>&#x65E0;&#x8BBA;&#x54EA;&#x4E00;&#x4E2A;&#xFF08;<code>foo()</code>&#x6216;&#x8005;<code>bar()</code>&#xFF09;&#x540E;&#x89E6;&#x53D1;&#xFF0C;&#x4E0D;&#x4EC5;&#x4F1A;&#x91CD;&#x5199;&#x53E6;&#x4E00;&#x4E2A;&#x5BF9;<code>a</code>&#x7684;&#x8D4B;&#x503C;&#xFF0C;&#x800C;&#x4E14;&#x4F1A;&#x91CD;&#x590D;&#x8C03;&#x7528;<code>baz()</code>&#xFF08;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x5E0C;&#x671B;&#x770B;&#x5230;&#x7684;&#xFF09;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x95E9;&#x6765;&#x534F;&#x8C03;&#x4EA4;&#x4E92;&#xFF0C;&#x53EA;&#x8BA9;&#x7B2C;&#x4E00;&#x4E2A;&#x901A;&#x8FC7;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> a;

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">foo</span>(<span class="hljs-params">x</span>) </span>{
    <span class="hljs-keyword">if</span> (a == <span class="hljs-literal">undefined</span>) {
        a = x * <span class="hljs-number">2</span>;
        baz();
    }
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">bar</span>(<span class="hljs-params">x</span>) </span>{
    <span class="hljs-keyword">if</span> (a == <span class="hljs-literal">undefined</span>) {
        a = x / <span class="hljs-number">2</span>;
        baz();
    }
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">baz</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log( a );
}

<span class="hljs-comment">// ajax(..) is some arbitrary Ajax function given by a library</span>
ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, foo );
ajax( <span class="hljs-string">&quot;http://some.url.2&quot;</span>, bar );
</code></pre>
<p><code>if (a == undefined)</code>&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#x53EA;&#x5141;&#x8BB8;<code>foo()</code>&#x548C;<code>bar()</code>&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x901A;&#x8FC7;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#xFF08;&#x4EE5;&#x53CA;&#x5176;&#x540E;&#x6240;&#x6709;&#x7684;&#xFF09;&#x8C03;&#x7528;&#x4F1A;&#x88AB;&#x5FFD;&#x7565;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong> &#x5728;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x4E3A;&#x4FBF;&#x4E8E;&#x8BF4;&#x660E;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x91C7;&#x7528;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x4F46;&#x5E76;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x4E00;&#x5B9A;&#x8981;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x53EA;&#x8981;&#x76F8;&#x5173;&#x7684;&#x51FD;&#x6570;&#x80FD;&#x591F;&#x8BBF;&#x95EE;&#x53D8;&#x91CF;&#xFF08;&#x901A;&#x8FC7;&#x4F5C;&#x7528;&#x57DF;&#xFF09;&#xFF0C;&#x540C;&#x6837;&#x80FD;&#x8FD0;&#x884C;&#x7684;&#x5F88;&#x597D;&#x3002;&#x4F9D;&#x8D56;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#x53D8;&#x91CF;&#xFF0C;&#x5373;&#x6B64;&#x5904;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x662F;&#x8FD9;&#x4E9B;&#x5E76;&#x53D1;&#x534F;&#x8C03;&#x5F62;&#x5F0F;&#x7684;&#x4E00;&#x4E2A;&#x660E;&#x663E;&#x7F3A;&#x70B9;&#x3002;&#x968F;&#x7740;&#x6211;&#x4EEC;&#x6DF1;&#x5165;&#x4E4B;&#x540E;&#x7684;&#x51E0;&#x7AE0;&#xFF0C;&#x4F1A;&#x770B;&#x5230;&#x5176;&#x5B83;&#x4E00;&#x4E9B;&#x66F4;&#x7B80;&#x6D01;&#x7684;&#x5F62;&#x5F0F;&#x3002;</p>
<h3 id="&#x534F;&#x4F5C;&#xFF08;cooperation&#xFF09;">&#x534F;&#x4F5C;&#xFF08;Cooperation&#xFF09;</h3>
<p>&#x53E6;&#x4E00;&#x79CD;&#x5E76;&#x53D1;&#x534F;&#x8C03;&#x7684;&#x8868;&#x73B0;&#x5F62;&#x5F0F;&#x662F;&#x201D;&#x5E76;&#x53D1;&#x534F;&#x4F5C;&#x201C;&#x3002;&#x6B64;&#x5904;&#x7684;&#x5173;&#x6CE8;&#x70B9;&#x4E0D;&#x662F;&#x901A;&#x8FC7;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x503C;&#x5171;&#x4EAB;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#xFF08;&#x5C3D;&#x7BA1;&#x4ECD;&#x7136;&#x5141;&#x8BB8;&#xFF01;&#xFF09;&#xFF0C;&#x800C;&#x662F;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x957F;&#x65F6;&#x7684;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x5206;&#x6210;&#x51E0;&#x6B65;&#x6216;&#x51E0;&#x4E2A;&#x6279;&#x6B21;&#xFF0C;&#x4F7F;&#x5F97;&#x5176;&#x5B83;&#x7684;&#x5E76;&#x53D1;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#x6709;&#x673A;&#x4F1A;&#x628A;&#x5B83;&#x4EEC;&#x7684;&#x64CD;&#x4F5C;&#x63D2;&#x5165;&#x5230;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x961F;&#x5217;&#x4E2D;&#x3002;</p>
<p>&#x4F8B;&#x5982;,&#x5047;&#x8BBE;&#x6709;&#x4E00;&#x4E2A;AJax&#x54CD;&#x5E94;&#x5904;&#x7406;&#x51FD;&#x6570;&#xFF0C;&#x9700;&#x8981;&#x904D;&#x5386;&#x4E00;&#x957F;&#x4E32;&#x7ED3;&#x679C;&#x4EE5;&#x6539;&#x53D8;&#x503C;&#x3002;&#x6B64;&#x5904;&#x4E3A;&#x4FDD;&#x6301;&#x4EE3;&#x7801;&#x7B80;&#x6D01;&#xFF0C;&#x6211;&#x4EEC;&#x91C7;&#x7528;<code>Array#map(..)</code>&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> res = [];

<span class="hljs-comment">// `response(..)` receives array of results from the Ajax call</span>
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">response</span>(<span class="hljs-params">data</span>) </span>{
    <span class="hljs-comment">// add onto existing `res` array</span>
    res = res.concat(
        <span class="hljs-comment">// make a new transformed array with all `data` values doubled</span>
        data.map( <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">val</span>)</span>{
            <span class="hljs-keyword">return</span> val * <span class="hljs-number">2</span>;
        } )
    );
}

<span class="hljs-comment">// ajax(..) is some arbitrary Ajax function given by a library</span>
ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, response );
ajax( <span class="hljs-string">&quot;http://some.url.2&quot;</span>, response );
</code></pre>
<p>&#x5982;&#x679C;<code>&quot;http://some.url.1&quot;</code>&#x9996;&#x5148;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#xFF0C;&#x6574;&#x4E2A;&#x7ED3;&#x679C;&#x4F1A;&#x9A6C;&#x4E0A;&#x6620;&#x5C04;&#x5230;<code>res</code>&#x4E2D;&#x53BB;&#x3002;&#x5982;&#x679C;&#x53EA;&#x662F;&#x51E0;&#x5343;&#x6216;&#x8005;&#x66F4;&#x5C11;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x901A;&#x5E38;&#x4E0D;&#x662F;&#x4E2A;&#x5927;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x5982;&#x679C;&#x6709;1000&#x4E07;&#x6761;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x82B1;&#x4E0A;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF08;&#x4E00;&#x53F0;&#x6027;&#x80FD;&#x5F3A;&#x52B2;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#x53EF;&#x80FD;&#x8981;&#x51E0;&#x79D2;&#x949F;&#xFF0C;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x5C31;&#x66F4;&#x957F;&#x4E86;&#xFF09;&#x3002;</p>
<p>&#x5F53;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9875;&#x9762;&#x4E0A;&#x7684;&#x5176;&#x5B83;&#x4E1C;&#x897F;&#x90FD;&#x4F1A;&#x505C;&#x6B62;&#xFF0C;&#x5305;&#x62EC;&#x5176;&#x5B83;<code>response(..)</code>&#x8C03;&#x7528;&#x3001;UI&#x66F4;&#x65B0;&#xFF0C;&#x66F4;&#x4E0D;&#x7528;&#x8BF4;&#x50CF;&#x6EDA;&#x52A8;&#x3001;&#x8F93;&#x5165;&#x3001;&#x6309;&#x94AE;&#x70B9;&#x51FB;&#x4EE5;&#x53CA;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#x7684;&#x7528;&#x6237;&#x4E8B;&#x4EF6;&#x4E86;&#x3002;&#x90A3;&#x771F;&#x75DB;&#x82E6;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x4E86;&#x8BA9;&#x5E76;&#x53D1;&#x7CFB;&#x7EDF;&#x66F4;&#x597D;&#x5730;&#x534F;&#x4F5C;&#xFF0C;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x4E00;&#x79CD;&#x66F4;&#x53CB;&#x597D;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x9738;&#x5360;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x961F;&#x5217;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x5F02;&#x6B65;&#x6279;&#x6B21;&#x7684;&#x65B9;&#x5F0F;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x3002;&#x5728;&#x6BCF;&#x4E2A;&#x6279;&#x6B21;&#x88AB;&#x63A8;&#x5165;&#x4E8B;&#x4EF6;&#x961F;&#x5217;&#x540E;&#xFF0C;&#x8BA9;&#x5176;&#x5B83;&#x6279;&#x6B21;&#x7B49;&#x5F85;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> res = [];

<span class="hljs-comment">// `response(..)` receives array of results from the Ajax call</span>
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">response</span>(<span class="hljs-params">data</span>) </span>{
    <span class="hljs-comment">// let&apos;s just do 1000 at a time</span>
    <span class="hljs-keyword">var</span> chunk = data.splice( <span class="hljs-number">0</span>, <span class="hljs-number">1000</span> );

    <span class="hljs-comment">// add onto existing `res` array</span>
    res = res.concat(
        <span class="hljs-comment">// make a new transformed array with all `chunk` values doubled</span>
        chunk.map( <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">val</span>)</span>{
            <span class="hljs-keyword">return</span> val * <span class="hljs-number">2</span>;
        } )
    );

    <span class="hljs-comment">// anything left to process?</span>
    <span class="hljs-keyword">if</span> (data.length &gt; <span class="hljs-number">0</span>) {
        <span class="hljs-comment">// async schedule next batch</span>
        setTimeout( <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>)</span>{
            response( data );
        }, <span class="hljs-number">0</span> );
    }
}

<span class="hljs-comment">// ajax(..) is some arbitrary Ajax function given by a library</span>
ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, response );
ajax( <span class="hljs-string">&quot;http://some.url.2&quot;</span>, response );
</code></pre>
<p>&#x6211;&#x4EEC;&#x628A;&#x6570;&#x636E;&#x96C6;&#x5206;&#x6210;&#x6BCF;&#x4E2A;&#x6700;&#x5927;1000&#x9879;&#x7684;&#x6570;&#x636E;&#x5757;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x786E;&#x4FDD;&#x4E00;&#x4E2A;&#x77ED;&#x65F6;&#x7684;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6709;&#x66F4;&#x591A;&#x7684;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#x968F;&#x4E4B;&#x800C;&#x6765;&#x3002;&#x5C06;&#x8FD9;&#x4E9B;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#x63D2;&#x5165;&#x5230;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x961F;&#x5217;&#x80FD;&#x591F;&#x8BA9;&#x6211;&#x7684;&#x7F51;&#x7AD9;/&#x5E94;&#x7528;&#x54CD;&#x5E94;&#x6027;&#x66F4;&#x597D;&#xFF0C;&#x6027;&#x80FD;&#x66F4;&#x4F73;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x534F;&#x8C03;&#x4EA4;&#x4E92;&#x6765;&#x63A7;&#x5236;&#x8FD9;&#x4E9B;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x56E0;&#x6B64;&#x7ED3;&#x679C;&#x7684;&#x987A;&#x5E8F;&#x4E5F;&#x662F;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#x3002;&#x5982;&#x679C;&#x987A;&#x5E8F;&#x662F;&#x5FC5;&#x987B;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x7684;&#x4EA4;&#x4E92;&#x6280;&#x672F;&#xFF0C;&#x6216;&#x8005;&#x4E0B;&#x4E00;&#x7AE0;&#x4E2D;&#x6211;&#x4EEC;&#x8981;&#x8BB2;&#x7684;&#x6280;&#x672F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x91C7;&#x7528;<code>setTimeout(..0)</code>(hack)&#x8FDB;&#x884C;&#x5F02;&#x6B65;&#x8C03;&#x5EA6;&#xFF0C;&#x8FD9;&#x4EC5;&#x4EC5;&#x610F;&#x5473;&#x7740;&#x201D;&#x628A;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x63D2;&#x5165;&#x5230;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x961F;&#x5217;&#x7684;&#x672B;&#x5C3E;&#x201C;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong> &#x6280;&#x672F;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;<code>setTimeout(..0)</code>&#x5E76;&#x4E0D;&#x4F1A;&#x76F4;&#x63A5;&#x628A;&#x4EFB;&#x52A1;&#x9879;&#x63D2;&#x5165;&#x5230;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x5B9A;&#x65F6;&#x5668;&#x4F1A;&#x5728;&#x4E0B;&#x6B21;&#x673A;&#x4F1A;&#x4E2D;&#x63D2;&#x5165;&#x4E8B;&#x4EF6;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E24;&#x4E2A;&#x5148;&#x540E;<code>setTimeout(..0)</code>&#x7684;&#x8C03;&#x7528;&#x5E76;&#x4E0D;&#x80FD;&#x4E25;&#x683C;&#x4FDD;&#x8BC1;&#x6309;&#x7167;&#x8C03;&#x7528;&#x987A;&#x5E8F;&#x5F97;&#x5230;&#x5904;&#x7406;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x53EF;&#x80FD;&#x770B;&#x5230;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x60C5;&#x5F62;&#xFF0C;&#x6BD4;&#x5982;&#x5B9A;&#x65F6;&#x5668;&#x6F02;&#x79FB;&#xFF0C;&#x8FD9;&#x6837;&#x4E8B;&#x4EF6;&#x7684;&#x987A;&#x5E8F;&#x662F;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#x3002;&#x5728;Node.js&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x6CD5;&#x53EB;<code>process.nextTick(..)</code>&#x3002;&#x5C3D;&#x7BA1;&#x5F88;&#x65B9;&#x4FBF;&#xFF08;&#x901A;&#x5E38;&#x6027;&#x80FD;&#x4E5F;&#x66F4;&#x597D;&#xFF09;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x76F4;&#x63A5;&#x3001;&#x6A2A;&#x8DE8;&#x6240;&#x6709;&#x73AF;&#x5883;&#x7684;&#x786E;&#x4FDD;&#x5F02;&#x6B65;&#x4E8B;&#x4EF6;&#x987A;&#x5E8F;&#x7684;&#x65B9;&#x5F0F;&#xFF08;&#x81F3;&#x5C11;&#x76EE;&#x524D;&#x5982;&#x6B64;&#xFF09;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x8BA8;&#x8BBA;&#x66F4;&#x591A;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x7684;&#x7EC6;&#x8282;&#x3002;</p>
<h2 id="&#x4F5C;&#x4E1A;&#xFF08;jobs&#xFF09;">&#x4F5C;&#x4E1A;&#xFF08;Jobs&#xFF09;</h2>
<p>ES6&#x4E2D;&#xFF0C;&#x9664;&#x4E86;&#x4E8B;&#x4EF6;&#x961F;&#x5217;&#x4EE5;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x65B0;&#x6982;&#x5FF5;&#xFF0C;&#x53EB;&#x201D;&#x4F5C;&#x4E1A;&#x961F;&#x5217;&#x201C;&#xFF08;Job queue&#xFF09;&#x3002;&#x4F60;&#x6700;&#x6709;&#x53EF;&#x80FD;&#x5728;Promises&#x7684;&#x5F02;&#x6B65;&#x884C;&#x4E3A;&#x4E2D;&#xFF08;&#x8BE6;&#x89C1;&#x7B2C;&#x4E09;&#x7AE0;&#xFF09;&#x63A5;&#x89E6;&#x5230;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6B64;&#x65F6;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x5916;&#x9732;&#x63A5;&#x53E3;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x8BC1;&#x660E;&#x5B83;&#x53EF;&#x80FD;&#x6709;&#x70B9;&#x590D;&#x6742;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x4ECE;&#x6982;&#x5FF5;&#x4E0A;&#x63CF;&#x8FF0;&#x5B83;&#xFF0C;&#x4EE5;&#x4FBF;&#x5F53;&#x6211;&#x4EEC;&#x5728;&#x7B2C;&#x4E09;&#x7AE0;&#x8BA8;&#x8BBA;Promises&#x7684;&#x5F02;&#x6B65;&#x884C;&#x4E3A;&#x65F6;&#xFF0C;&#x4F60;&#x80FD;&#x591F;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x662F;&#x600E;&#x6837;&#x8C03;&#x5EA6;&#x548C;&#x5904;&#x7406;&#x7684;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x5BF9;&#x201D;&#x4F5C;&#x4E1A;&#x961F;&#x5217;&#x201C;&#x7406;&#x89E3;&#x7684;&#x6700;&#x597D;&#x65B9;&#x5F0F;&#x662F;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6302;&#x8F7D;&#x5728;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x961F;&#x5217;&#x4E2D;&#x6BCF;&#x4E2A;tick&#x672B;&#x5C3E;&#x7684;&#x961F;&#x5217;&#x3002;&#x67D0;&#x4E9B;&#x53EF;&#x80FD;&#x5728;&#x4E8B;&#x4EF6;&#x961F;&#x5217;&#x7684;tick&#x671F;&#x95F4;&#x53D1;&#x751F;&#x7684;&#x6F5C;&#x5728;&#x5F02;&#x6B65;&#x64CD;&#x4F5C;&#x5E76;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x65B0;&#x4E8B;&#x4EF6;&#x63D2;&#x5165;&#x5230;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x961F;&#x5217;&#x4E2D;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x5F53;&#x524D;tick&#x7684;&#x4F5C;&#x4E1A;&#x961F;&#x5217;&#x672B;&#x5C3E;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF08;&#x5373;&#x4F5C;&#x4E1A;&#xFF09;&#x3002;</p>
<p>&#x5C31;&#x597D;&#x50CF;&#x8BF4;&#xFF1A;&#x201D;&#x54E6;&#xFF0C;&#x6211;&#x8FD9;&#x513F;&#x6709;&#x4E2A;&#x9700;&#x8981;&#x4E4B;&#x540E;&#x5904;&#x7406;&#x7684;&#x5176;&#x5B83;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x786E;&#x4FDD;&#x5728;&#x5176;&#x5B83;&#x4E8B;&#x60C5;&#x53D1;&#x751F;&#x4E4B;&#x524D;&#x7ACB;&#x5373;&#x53D1;&#x751F;&#x201C;&#x3002;</p>
<p>&#x6216;&#x8005;&#xFF0C;&#x6253;&#x4E2A;&#x6BD4;&#x65B9;&#xFF1A;&#x4E8B;&#x4EF6;&#x961F;&#x5217;&#x5C31;&#x50CF;&#x6E38;&#x4E50;&#x573A;&#x7684;&#x8FC7;&#x5C71;&#x8F66;&#xFF0C;&#x4E00;&#x65E6;&#x4F60;&#x73A9;&#x8FC7;&#x4E00;&#x6B21;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x5230;&#x961F;&#x5C3E;&#x53BB;&#x6392;&#x961F;&#x3002;&#x800C;&#x4F5C;&#x4E1A;&#x961F;&#x5217;&#x5C31;&#x50CF;&#x4E00;&#x65E6;&#x4F60;&#x73A9;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x4E4B;&#x540E;&#x63D2;&#x961F;&#x53C8;&#x7EE7;&#x7EED;&#x73A9;&#x4E86;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x53EF;&#x80FD;&#x5F15;&#x53D1;&#x66F4;&#x591A;&#x7684;&#x4F5C;&#x4E1A;&#x63D2;&#x5165;&#x5230;&#x540C;&#x4E00;&#x961F;&#x5217;&#x7684;&#x672B;&#x5C3E;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4ECE;&#x7406;&#x8BBA;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x201D;&#x5FAA;&#x73AF;&#x201C;&#xFF08;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x4E0D;&#x65AD;&#x5730;&#x52A0;&#x5165;&#x53E6;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#xFF09;&#x5F88;&#x53EF;&#x80FD;&#x65E0;&#x9650;&#x5EF6;&#x4F38;&#xFF0C;&#x56E0;&#x800C;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x65E0;&#x6CD5;&#x79FB;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;tick&#x4E2D;&#x3002;&#x4ECE;&#x6982;&#x5FF5;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x8DDF;&#x4E00;&#x4E2A;&#x957F;&#x65F6;&#x8FD0;&#x884C;&#x6216;&#x8005;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#xFF08;&#x6BD4;&#x5982;<code>while(true)...</code>&#xFF09;&#x51E0;&#x4E4E;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x4F5C;&#x4E1A;&#x6709;&#x70B9;&#x50CF;<code>setTimeout(..0)</code>hack&#xFF0C;&#x4F46;&#x662F;&#x80FD;&#x591F;&#x66F4;&#x597D;&#x5730;&#x5B9A;&#x4E49;&#x548C;&#x786E;&#x4FDD;&#x987A;&#x5E8F;&#xFF1A;<strong>&#x4EE5;&#x540E;&#xFF0C;&#x4F46;&#x5C3D;&#x53EF;&#x80FD;&#x5FEB;&#x70B9;</strong>&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x8C03;&#x5EA6;Jobs&#xFF08;&#x76F4;&#x63A5;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x91C7;&#x7528;hacks&#xFF09;&#x7684;API&#xFF0C;&#x53EB;&#x505A;<code>schedule(..)</code>&#xFF0C;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-built_in">console</span>.log( <span class="hljs-string">&quot;A&quot;</span> );

setTimeout( <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>)</span>{
    <span class="hljs-built_in">console</span>.log( <span class="hljs-string">&quot;B&quot;</span> );
}, <span class="hljs-number">0</span> );

<span class="hljs-comment">// theoretical &quot;Job API&quot;</span>
schedule( <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>)</span>{
    <span class="hljs-built_in">console</span>.log( <span class="hljs-string">&quot;C&quot;</span> );

    schedule( <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>)</span>{
        <span class="hljs-built_in">console</span>.log( <span class="hljs-string">&quot;D&quot;</span> );
    } );
} );
</code></pre>
<p>&#x4F60;&#x53EF;&#x80FD;&#x8BA4;&#x4E3A;&#x4F1A;&#x8F93;&#x51FA;<code>A B C D</code>&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x662F;&#x8F93;&#x51FA;<code>A C D B</code>&#xFF0C;&#x56E0;&#x4E3A;&#x4F5C;&#x4E1A;&#x662F;&#x5728;&#x5F53;&#x524D;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;tick&#x7684;&#x672B;&#x5C3E;&#x53D1;&#x751F;&#x7684;&#xFF0C;&#x800C;&#x5B9A;&#x65F6;&#x5668;&#x89E6;&#x53D1;&#x65F6;&#xFF0C;&#x662F;&#x8C03;&#x5EA6;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;tick&#x7684;&#xFF08;&#x5982;&#x679C;&#x5B58;&#x5728;&#x7684;&#x8BDD;&#xFF09;&#x3002;</p>
<p>&#x5728;&#x7B2C;&#x4E09;&#x7AE0;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x770B;&#x5230;&#xFF0C;Promises&#x7684;&#x5F02;&#x6B65;&#x884C;&#x4E3A;&#x662F;&#x57FA;&#x4E8E;Jobs&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x6709;&#x5FC5;&#x8981;&#x641E;&#x6E05;&#x695A;&#x5B83;&#x548C;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<h2 id="&#x8BED;&#x53E5;&#x6392;&#x5E8F;&#xFF08;statement-ordering&#xFF09;">&#x8BED;&#x53E5;&#x6392;&#x5E8F;&#xFF08;Statement Ordering&#xFF09;</h2>
<p>&#x6211;&#x4EEC;&#x4EE3;&#x7801;&#x4E2D;&#x5199;&#x7684;&#x8BED;&#x53E5;&#x987A;&#x5E8F;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x548C;JS&#x5F15;&#x64CE;&#x6267;&#x884C;&#x7684;&#x987A;&#x5E8F;&#x4E00;&#x81F4;&#x3002;&#x8FD9;&#x4E00;&#x8BBA;&#x65AD;&#x770B;&#x8D77;&#x6765;&#x4F3C;&#x4E4E;&#x6709;&#x70B9;&#x5947;&#x602A;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x7B80;&#x5355;&#x5730;&#x770B;&#x4E0B;&#x3002;</p>
<p>&#x4F46;&#x5728;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x641E;&#x6E05;&#x695A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF1A;&#x4ECE;&#x7A0B;&#x5E8F;&#x89D2;&#x5EA6;&#x800C;&#x8A00;&#xFF0C;&#x8BED;&#x8A00;&#x7684;&#x89C4;&#x5219;/&#x8BED;&#x6CD5;&#x51B3;&#x5B9A;&#x4E86;&#x8BED;&#x53E5;&#x6392;&#x5E8F;&#x662F;&#x53EF;&#x9884;&#x6D4B;&#x548C;&#x53EF;&#x4FE1;&#x8D56;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x8BA8;&#x8BBA;&#x7684;<strong>&#x4E0D;&#x662F;&#x4F60;&#x5728;JS&#x7A0B;&#x5E8F;&#x4E2D;&#x80FD;&#x89C2;&#x5BDF;&#x5230;&#x7684;&#x4E1C;&#x897F;</strong>&#x3002;</p>
<p><strong>&#x8B66;&#x544A;&#xFF1A;</strong> &#x5982;&#x679C;&#x4F60;&#x80FD;&#x89C2;&#x5BDF;&#x5230;&#x7F16;&#x8BD1;&#x5668;&#x8BED;&#x53E5;&#x91CD;&#x6392;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x8FD9;&#x5F88;&#x660E;&#x663E;&#x8FDD;&#x80CC;&#x4E86;&#x89C4;&#x8303;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#x4F1A;&#x662F;JS&#x5F15;&#x64CE;&#x7684;&#x4E00;&#x4E2A;&#x5927;bug--&#x4E00;&#x4E2A;&#x5E94;&#x8BE5;&#x7ACB;&#x5373;&#x62A5;&#x544A;&#x5E76;&#x4FEE;&#x590D;&#x7684;bug&#xFF01;&#x4F46;&#x662F;&#x5F53;&#x90A3;&#x5C31;&#x662F;&#x4F60;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;bug&#x65F6;&#xFF08;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x201D;&#x7ADE;&#x6001;&#x201C;&#xFF09;&#xFF0C;&#x4F60;&#x6000;&#x7591;JS&#x5F15;&#x64CE;&#x53D1;&#x751F;&#x4E86;&#x4E00;&#x4E9B;&#x4E0D;&#x53EF;&#x601D;&#x8BAE;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x8FD9;&#x975E;&#x5E38;&#x666E;&#x904D;--&#x56E0;&#x6B64;&#xFF0C;&#x9996;&#x5148;&#x770B;&#x770B;&#x662F;&#x4E0D;&#x662F;&#x91CD;&#x6392;&#x5BFC;&#x81F4;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4ED4;&#x7EC6;&#x770B;&#x3002;&#x91C7;&#x7528;JS&#x8C03;&#x8BD5;&#x5668;&#xFF0C;&#x8BBE;&#x7F6E;&#x65AD;&#x70B9;&#xFF0C;&#x4E00;&#x884C;&#x884C;&#x5355;&#x6B65;&#x8DDF;&#x8E2A;&#x4EE3;&#x7801;&#xFF0C;&#x4F1A;&#x6210;&#x4E3A;&#x4F60;&#x63EA;&#x51FA;&#x4EE3;&#x7801;&#x4E2D;&#x8FD9;&#x4E00;&#x7C7B;bug&#x6700;&#x5F3A;&#x6709;&#x529B;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
<p>&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> a, b;

a = <span class="hljs-number">10</span>;
b = <span class="hljs-number">30</span>;

a = a + <span class="hljs-number">1</span>;
b = b + <span class="hljs-number">1</span>;

<span class="hljs-built_in">console</span>.log( a + b ); <span class="hljs-comment">// 42</span>
</code></pre>
<p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x6CA1;&#x6709;&#x5F02;&#x6B65;&#x64CD;&#x4F5C;&#xFF08;&#x9664;&#x4E86;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x7684;<code>console</code>&#x5F02;&#x6B65;I/O&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x6700;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x5047;&#x8BBE;&#x662F;&#x5B83;&#x4F1A;&#x4ECE;&#x5934;&#x5230;&#x5C3E;&#x4E00;&#x884C;&#x884C;&#x5730;&#x6267;&#x884C;&#x3002;</p>
<p>&#x4F46;&#x5F88;&#x53EF;&#x80FD;&#x5728;JS&#x5F15;&#x64CE;&#x7F16;&#x8BD1;&#x5B8C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x540E;&#xFF08;&#x662F;&#x7684;&#xFF0C;JS&#x4F1A;&#x7F16;&#x8BD1;&#xFF09;&#xFF0C;&#x53D1;&#x73B0;&#x91CD;&#x6392;&#xFF08;&#x5B89;&#x5168;&#x5730;&#xFF09;&#x4E00;&#x4E0B;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x8BA9;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#x4E9B;&#x3002;&#x672C;&#x8D28;&#x800C;&#x8A00;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x770B;&#x4E0D;&#x5230;&#x8FD9;&#x79CD;&#x91CD;&#x6392;&#xFF0C;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x7126;&#x70B9;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x5927;&#x6982;&#x610F;&#x601D;&#x662F;&#x5173;&#x6CE8;&#x70B9;&#x5C31;&#x4E0D;&#x5728;&#x91CD;&#x6392;&#x4E0A;&#x4E86;&#xFF09;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5F15;&#x64CE;&#x53D1;&#x73B0;&#x50CF;&#x8FD9;&#x6837;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x4E5F;&#x8BB8;&#x66F4;&#x5FEB;&#x4E9B;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> a, b;

a = <span class="hljs-number">10</span>;
a++;

b = <span class="hljs-number">30</span>;
b++;

<span class="hljs-built_in">console</span>.log( a + b ); <span class="hljs-comment">// 42</span>
</code></pre>
<p>&#x6216;&#x8005;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> a, b;

a = <span class="hljs-number">11</span>;
b = <span class="hljs-number">31</span>;

<span class="hljs-built_in">console</span>.log( a + b ); <span class="hljs-comment">// 42</span>
</code></pre>
<p>&#x751A;&#x81F3;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-comment">// because `a` and `b` aren&apos;t used anymore, we can</span>
<span class="hljs-comment">// inline and don&apos;t even need them!</span>
<span class="hljs-built_in">console</span>.log( <span class="hljs-number">42</span> ); <span class="hljs-comment">// 42</span>
</code></pre>
<p>&#x5728;&#x4EE5;&#x4E0A;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x5F53;&#x4E2D;&#xFF0C;JS&#x5F15;&#x64CE;&#x5728;&#x7F16;&#x8BD1;&#x9636;&#x6BB5;&#x8FDB;&#x884C;&#x5B89;&#x5168;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x7ED3;&#x679C;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x6709;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x79CD;&#x7279;&#x5B9A;&#x7684;&#x4F18;&#x5316;&#x53EF;&#x80FD;&#x4E0D;&#x5B89;&#x5168;&#xFF0C;&#x56E0;&#x800C;&#x4E0D;&#x5141;&#x8BB8;&#x8FD9;&#x6837;&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x4F18;&#x5316;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> a, b;

a = <span class="hljs-number">10</span>;
b = <span class="hljs-number">30</span>;

<span class="hljs-comment">// we need `a` and `b` in their preincremented state!</span>
<span class="hljs-built_in">console</span>.log( a * b ); <span class="hljs-comment">// 300</span>

a = a + <span class="hljs-number">1</span>;
b = b + <span class="hljs-number">1</span>;

<span class="hljs-built_in">console</span>.log( a + b ); <span class="hljs-comment">// 42</span>
</code></pre>
<p>&#x5176;&#x5B83;&#x56E0;&#x7F16;&#x8BD1;&#x5668;&#x91CD;&#x6392;&#x5BFC;&#x81F4;&#x526F;&#x4F5C;&#x7528;&#x7684;&#x4F8B;&#x5B50;&#xFF08;&#x56E0;&#x6B64;&#x4E5F;&#x5FC5;&#x987B;&#x7981;&#x6B62;&#xFF09;&#x53EF;&#x80FD;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x50CF;&#x5177;&#x6709;&#x526F;&#x4F5C;&#x7528;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF08;&#x5C24;&#x5176;&#x662F;getter&#x51FD;&#x6570;&#xFF09;&#xFF0C;&#x6216;&#x8005;ES6&#x7684;Proxy&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5982;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">foo</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-built_in">console</span>.log( b );
    <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
}

<span class="hljs-keyword">var</span> a, b, c;

<span class="hljs-comment">// ES5.1 getter literal syntax</span>
c = {
    get bar() {
        <span class="hljs-built_in">console</span>.log( a );
        <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
    }
};

a = <span class="hljs-number">10</span>;
b = <span class="hljs-number">30</span>;

a += foo();             <span class="hljs-comment">// 30</span>
b += c.bar;             <span class="hljs-comment">// 11</span>

<span class="hljs-built_in">console</span>.log( a + b );   <span class="hljs-comment">// 42</span>
</code></pre>
<p>&#x8981;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;<code>console.log(...)</code>&#x8BED;&#x53E5;&#xFF08;&#x4EC5;&#x662F;&#x4E3A;&#x4E86;&#x8BF4;&#x660E;&#x8FD9;&#x79CD;&#x53EF;&#x89C2;&#x6D4B;&#x7684;&#x526F;&#x4F5C;&#x7528;&#x800C;&#x91C7;&#x7528;&#x7684;&#x7B80;&#x4FBF;&#x5F62;&#x5F0F;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x4E50;&#x610F;&#xFF08;&#x8C01;&#x77E5;&#x9053;&#x5B83;&#x662F;&#x5426;&#x4F1A;&#x5462;&#xFF09;&#xFF0C;JS&#x5F15;&#x64CE;&#x65E9;&#x628A;&#x4EE3;&#x7801;&#x91CD;&#x6392;&#x6210;&#x8FD9;&#x6837;&#x4E86;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-comment">// ...</span>

a = <span class="hljs-number">10</span> + foo();
b = <span class="hljs-number">30</span> + c.bar;

<span class="hljs-comment">// ...</span>
</code></pre>
<p>&#x8C22;&#x5929;&#x8C22;&#x5730;&#xFF0C;&#x5C3D;&#x7BA1;JS&#x8BED;&#x6CD5;&#x80FD;&#x591F;&#x8BA9;&#x6211;&#x4EEC;&#x514D;&#x4E8E;&#x906D;&#x53D7;&#x7F16;&#x8BD1;&#x5668;&#x8BED;&#x53E5;&#x91CD;&#x6392;&#x5E26;&#x6765;&#x7684;&#x5669;&#x68A6;&#x56F0;&#x6270;&#xFF0C;&#x4F46;&#x8BA4;&#x8BC6;&#x5230;&#x7F16;&#x5199;&#x7684;&#x6E90;&#x7801;&#xFF08;&#x81F3;&#x4E0A;&#x800C;&#x4E0B;&#x7684;&#x65B9;&#x5F0F;&#xFF09;&#x548C;&#x5B9E;&#x9645;&#x7F16;&#x8BD1;&#x540E;&#x6267;&#x884C;&#x7684;&#x65B9;&#x5F0F;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x6709;&#x591A;&#x8584;&#x5F31;&#x662F;&#x5341;&#x5206;&#x91CD;&#x8981;&#x7684;&#x3002;</p>
<p>&#x7F16;&#x8BD1;&#x5668;&#x8BED;&#x53E5;&#x91CD;&#x6392;&#x662F;&#x5E76;&#x53D1;&#x548C;&#x4EA4;&#x4E92;&#xFF08;interaction&#xFF09;&#x7684;&#x5FAE;&#x9690;&#x55BB;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x666E;&#x904D;&#x6982;&#x5FF5;&#xFF0C;&#x77E5;&#x6653;&#x8FD9;&#x4E9B;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x4F60;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;JS&#x4EE3;&#x7801;&#x7684;&#x5F02;&#x6B65;&#x6D41;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="&#x56DE;&#x987E;&#xFF08;review&#xFF09;">&#x56DE;&#x987E;&#xFF08;Review&#xFF09;</h2>
<p>&#x65E5;&#x5E38;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;JS&#x7A0B;&#x5E8F;&#x603B;&#x662F;&#x88AB;&#x5206;&#x6210;&#x4E24;&#x4E2A;&#x6216;&#x66F4;&#x591A;&#x7684;&#x5757;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x5757;<em>&#x73B0;&#x5728;</em>&#x6267;&#x884C;&#xFF0C;&#x4E0B;&#x4E00;&#x4E2A;&#x5757;<em>&#x4EE5;&#x540E;</em>&#x6267;&#x884C;&#xFF0C;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x3002;&#x5C3D;&#x7BA1;&#x7A0B;&#x5E8F;&#x662F;&#x6309;&#x5757;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x6240;&#x6709;&#x5757;&#x5171;&#x4EAB;&#x5BF9;&#x7A0B;&#x5E8F;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x548C;&#x72B6;&#x6001;&#x7684;&#x8BBF;&#x95EE;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x6BCF;&#x6B21;&#x5BF9;&#x72B6;&#x6001;&#x7684;&#x4FEE;&#x6539;&#x90FD;&#x662F;&#x5728;&#x524D;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x7684;&#x3002;</p>
<p>&#x53EA;&#x8981;&#x6709;&#x4E8B;&#x4EF6;&#x8981;&#x8FD0;&#x884C;&#xFF0C;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x4F1A;&#x4E00;&#x76F4;&#x8FD0;&#x884C;&#x76F4;&#x81F3;&#x961F;&#x5217;&#x4E3A;&#x7A7A;&#x3002;&#x5BF9;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x7684;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x79F0;&#x4E3A;&#x4E00;&#x4E2A;&#x201D;tick&#x201C;&#x3002;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x3001;IO&#x548C;&#x5B9A;&#x65F6;&#x5668;&#x90FD;&#x4F1A;&#x5728;&#x4E8B;&#x4EF6;&#x961F;&#x5217;&#x4E2D;&#x8FDB;&#x884C;&#x4E8B;&#x4EF6;&#x6392;&#x961F;&#x3002;</p>
<p>&#x5E76;&#x53D1;&#x662F;&#x4E24;&#x6761;&#x6216;&#x591A;&#x6761;&#x4E8B;&#x4EF6;&#x94FE;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x76F8;&#x4E92;&#x4EA4;&#x53C9;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x4ECE;&#x66F4;&#x9AD8;&#x5C42;&#x9762;&#x6765;&#x770B;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F3C;&#x4E4E;&#x662F;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x7684;&#xFF08;&#x5373;&#x4F7F;&#x5728;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x65F6;&#x523B;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x88AB;&#x5904;&#x7406;&#xFF09;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF0C;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x987A;&#x5E8F;&#x6216;&#x8005;&#x4E3A;&#x4E86;&#x963B;&#x6B62;&#x201D;&#x7ADE;&#x6001;&#x201C;&#xFF0C;&#x901A;&#x5E38;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#x5728;&#x8FD9;&#x4E9B;&#x5E76;&#x53D1;&#x7684;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#xFF08;&#x6709;&#x522B;&#x4E8E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7EA7;&#x7684;&#x8FDB;&#x7A0B;&#x6982;&#x5FF5;&#xFF09;&#x95F4;&#x8FDB;&#x884C;&#x67D0;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x4EA4;&#x4E92;&#x534F;&#x8C03;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x628A;&#x8FD9;&#x4E9B;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#x62C6;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x5C0F;&#x5757;&#xFF0C;&#x4ECE;&#x800C;&#x5141;&#x8BB8;&#x5176;&#x5B83;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#x63D2;&#x5165;&#x8FDB;&#x6765;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch2.html" class="navigation navigation-next " aria-label="Next page: 第二章：回调">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一章：异步：现在 & 以后","level":"1.2","depth":1,"next":{"title":"第二章：回调","level":"1.3","depth":1,"path":"ch2.md","ref":"ch2.md","articles":[]},"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch1.md","mtime":"2017-04-12T08:19:23.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-04-12T08:25:25.932Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

