
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第二章：回调 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch3.html" />
    
    
    <link rel="prev" href="ch1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：异步：现在 & 以后
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：回调
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：Promises
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：生成器
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第二章：回调</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4F60;&#x4E0D;&#x77E5;&#x9053;js&#xFF1A;&#x5F02;&#x6B65;">&#x4F60;&#x4E0D;&#x77E5;&#x9053;JS&#xFF1A;&#x5F02;&#x6B65;</h1>
<h1 id="&#x7B2C;&#x4E8C;&#x7AE0;&#xFF1A;&#x56DE;&#x8C03;&#xFF08;callbacks&#xFF09;">&#x7B2C;&#x4E8C;&#x7AE0;&#xFF1A;&#x56DE;&#x8C03;&#xFF08;Callbacks&#xFF09;</h1>
<p>&#x5728;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x63A2;&#x7A76;&#x4E86;JS&#x4E2D;&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#x65B9;&#x9762;&#x7684;&#x4E00;&#x4E9B;&#x672F;&#x8BED;&#x548C;&#x6982;&#x5FF5;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x91CD;&#x70B9;&#x5728;&#x4E8E;&#x7406;&#x89E3;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;&#xFF0C;&#x5373;&#x5355;&#x7EBF;&#x7A0B;&#xFF08;&#x4E00;&#x6B21;&#x4E00;&#x4E2A;&#xFF09;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x961F;&#x5217;&#x9A71;&#x52A8;&#x7740;&#x6240;&#x6709;&#x7684;&#x201D;&#x4E8B;&#x4EF6;&#x201C;&#xFF08;&#x5F02;&#x6B65;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x63A2;&#x7A76;&#x4E86;&#x7528;&#x5E76;&#x53D1;&#x6A21;&#x5F0F;&#x6765;&#x89E3;&#x91CA;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x7684;&#x4E8B;&#x4EF6;&#x94FE;&#x4E4B;&#x95F4;&#x6216;&#x8005;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#xFF08;&#x4EFB;&#x52A1;&#xFF0C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7B49;&#xFF09;&#x4E4B;&#x95F4;&#x5173;&#x7CFB;&#xFF08;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#xFF09;&#x7684;&#x5404;&#x79CD;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4F8B;&#x5B50;&#x91C7;&#x7528;&#x7684;&#x51FD;&#x6570;&#x90FD;&#x662F;&#x5355;&#x72EC;&#x7684;&#x3001;&#x4E0D;&#x53EF;&#x5206;&#x5272;&#x7684;&#x64CD;&#x4F5C;&#x5355;&#x5143;&#xFF0C;&#x4ECE;&#x800C;&#x5728;&#x51FD;&#x6570;&#x5185;&#x90E8;&#xFF0C;&#x8BED;&#x53E5;&#x90FD;&#x662F;&#x6309;&#x7167;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#x987A;&#x5E8F;&#x8FD0;&#x884C;&#x7684;&#xFF08;&#x9AD8;&#x4E8E;&#x7F16;&#x8BD1;&#x5668;&#x7EA7;&#xFF09;,&#x4F46;&#x5728;&#x51FD;&#x6570;&#x987A;&#x5E8F;&#x7EA7;&#xFF0C;&#x4E8B;&#x4EF6;&#xFF08;&#x5373;&#x5F02;&#x6B65;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF09;&#x53EF;&#x80FD;&#x4EE5;&#x5404;&#x79CD;&#x987A;&#x5E8F;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x5728;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x60C5;&#x5F62;&#x5F53;&#x4E2D;&#xFF0C;&#x51FD;&#x6570;&#x5145;&#x5F53;&#x4E86;&#x201D;&#x56DE;&#x8C03;&#x201C;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x5904;&#x7406;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x67D0;&#x9879;&#x4EFB;&#x52A1;&#x65F6;&#xFF0C;&#x5B83;&#x7528;&#x4E8E;&#x5C06;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x201D;&#x56DE;&#x8C03;&#x5165;&#x201C;&#x7A0B;&#x5E8F;&#x5F53;&#x4E2D;&#x3002;</p>
<p>&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#xFF0C;&#x4F60;&#x5DF2;&#x7ECF;&#x6CE8;&#x610F;&#x5230;&#x4E86;&#xFF0C;&#x56DE;&#x8C03;&#x662F;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;JS&#x4E2D;&#x8868;&#x793A;&#x548C;&#x7BA1;&#x7406;&#x5F02;&#x6B65;&#x6700;&#x666E;&#x904D;&#x7684;&#x65B9;&#x5F0F;&#x4E86;&#x3002;&#x8BDA;&#x7136;&#xFF0C;&#x56DE;&#x8C03;&#x662F;&#x8BE5;&#x8BED;&#x8A00;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5F02;&#x6B65;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x65E0;&#x6570;&#x7684;JS&#x7A0B;&#x5E8F;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x5F02;&#x6B65;&#x90FD;&#x662F;&#x5EFA;&#x7ACB;&#x5728;&#x56DE;&#x8C03;&#x57FA;&#x7840;&#x4E0A;&#x7684;&#xFF0C;&#x522B;&#x65E0;&#x5176;&#x5B83;&#xFF08;&#x5F53;&#x7136;&#x4E5F;&#x5305;&#x62EC;&#x6211;&#x4EEC;&#x5728;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x6240;&#x63A2;&#x7A76;&#x7684;&#x5E76;&#x53D1;&#x4EA4;&#x4E92;&#x6A21;&#x5F0F;&#xFF09;&#x3002;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x662F;JS&#x5F02;&#x6B65;&#x7684;&#x9A6E;&#x9A6C;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x610F;&#x6307;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x7684;&#x5F02;&#x6B65;&#x662F;&#x901A;&#x8FC7;&#x56DE;&#x8C03;&#x5B9E;&#x73B0;&#x7684;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x505A;&#x7684;&#x8FD8;&#x4E0D;&#x9519;&#x3002;</p>
<p>&#x9664;&#x4E86;...&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4E5F;&#x5E76;&#x4E0D;&#x662F;&#x6CA1;&#x6709;&#x7F3A;&#x70B9;&#x3002;&#x5F88;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x5BF9;&#x66F4;&#x597D;&#x7684;&#x5F02;&#x6B65;&#x6A21;&#x5F0F;promise&#xFF08;&#x53CC;&#x5173;&#xFF0C;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x65E2;&#x6307;&#x627F;&#x8BFA;&#xFF0C;&#x53C8;&#x6307;ES6&#x4E2D;&#x5F15;&#x5165;&#x7684;Promise&#x5F02;&#x6B65;&#xFF09;&#x611F;&#x5230;&#x5341;&#x5206;&#x6FC0;&#x52A8;&#x3002;
&#x4F46;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x7406;&#x89E3;&#x5B83;&#x62BD;&#x8C61;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4EE5;&#x53CA;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x6837;&#xFF0C;&#x5C31;&#x4E0D;&#x53EF;&#x80FD;&#x6709;&#x6548;&#x5730;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x62BD;&#x8C61;&#x3002;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x597D;&#x62BD;&#x8C61;&#xFF01;&#xFF01;&#xFF01;&#xFF09;</p>
<p>&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x6DF1;&#x5165;&#x63A2;&#x7A76;&#x4E0B;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x4EE5;&#x4FC3;&#x4F7F;&#x6211;&#x4EEC;&#x7814;&#x7A76;&#x4E3A;&#x4EC0;&#x4E48;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5F02;&#x6B65;&#x6A21;&#x5F0F;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#x4EE5;&#x53CA;&#x66F4;&#x53D7;&#x671F;&#x5F85;&#x3002;</p>
<h2 id="&#x5EF6;&#x7EED;&#xFF08;continuations&#xFF09;">&#x5EF6;&#x7EED;&#xFF08;Continuations&#xFF09;</h2>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x56DE;&#x5230;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x5F00;&#x59CB;&#x65F6;&#x7684;&#x5F02;&#x6B65;&#x56DE;&#x8C03;&#x4F8B;&#x5B50;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x8BF4;&#x660E;&#x4E00;&#x70B9;&#xFF0C;&#x8BA9;&#x6211;&#x7A0D;&#x5FAE;&#x4FEE;&#x6539;&#x4E00;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-comment">// A</span>
ajax( <span class="hljs-string">&quot;..&quot;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">..</span>)</span>{
    <span class="hljs-comment">// C</span>
} );
<span class="hljs-comment">// B</span>
</code></pre>
<p><code>// A</code>&#x548C;<code>// B</code>&#x4EE3;&#x8868;&#x7A0B;&#x5E8F;&#x7684;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#xFF08;&#x5373;<em>&#x73B0;&#x5728;</em>&#xFF09;&#xFF0C;<code>// C</code>&#x4EE3;&#x8868;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF08;&#x5373;<em>&#x4EE5;&#x540E;</em>&#xFF09;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#x7ACB;&#x5373;&#x6267;&#x884C;&#xFF0C;&#x7136;&#x540E;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x786E;&#x5B9A;&#x65F6;&#x95F4;&#x7684;&#x201D;&#x6682;&#x505C;&#x201C;&#x3002;&#x5728;&#x672A;&#x6765;&#x7684;&#x67D0;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;Ajax&#x8C03;&#x7528;&#x5B8C;&#x6210;&#xFF0C;&#x7A0B;&#x5E8F;&#x4F1A;&#x4ECE;&#x505C;&#x4E0B;&#x7684;&#x5730;&#x65B9;&#x5F00;&#x59CB;&#xFF0C;&#x7EE7;&#x7EED;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x5C01;&#x88C5;&#x4E86;&#x7A0B;&#x5E8F;&#x7684;<em>&#x5EF6;&#x7EED;</em>&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x518D;&#x7B80;&#x5316;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-comment">// A</span>
setTimeout( <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>)</span>{
    <span class="hljs-comment">// C</span>
}, <span class="hljs-number">1000</span> );
<span class="hljs-comment">// B</span>
</code></pre>
<p>&#x7B49;&#x4E00;&#x4E0B;&#xFF0C;&#x95EE;&#x95EE;&#x81EA;&#x5DF1;&#x8BE5;&#x5982;&#x4F55;&#xFF08;&#x5411;&#x5176;&#x4ED6;&#x5BF9;JS&#x5982;&#x4F55;&#x8FD0;&#x4F5C;&#x77E5;&#x4E4B;&#x751A;&#x5C11;&#x7684;&#x4EBA;&#xFF09;&#x63CF;&#x8FF0;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x65B9;&#x5F0F;&#x3002;&#x7EE7;&#x7EED;&#xFF0C;&#x5927;&#x58F0;&#x70B9;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x6B21;&#x5F88;&#x597D;&#x7684;&#x5C1D;&#x8BD5;&#xFF0C;&#x4F1A;&#x8BA9;&#x6211;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x89C2;&#x70B9;&#x66F4;&#x6709;&#x610F;&#x4E49;&#x3002;</p>
<p>&#x7EDD;&#x5927;&#x591A;&#x6570;&#x8BFB;&#x8005;&#x76EE;&#x524D;&#x7684;&#x60F3;&#x6CD5;&#x4E5F;&#x53EA;&#x80FD;&#x8FBE;&#x5230;&#x8FD9;&#x79CD;&#x7A0B;&#x5EA6;&#xFF1A;&#x201D;&#x6267;&#x884C;A&#xFF0C;&#x7136;&#x540E;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;1000&#x6BEB;&#x79D2;&#x7684;&#x5B9A;&#x65F6;&#x5668;&#xFF0C;&#x4E4B;&#x540E;&#x4E00;&#x65E6;&#x89E6;&#x53D1;&#xFF0C;&#x6267;&#x884C;C&#x201C;&#x3002;&#x4F60;&#x7684;&#x89E3;&#x91CA;&#x6709;&#x591A;&#x63A5;&#x8FD1;&#xFF1F;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x53C8;&#x4FEE;&#x6539;&#x6210;&#xFF1A;&#x201D;&#x6267;&#x884C;A&#xFF0C;&#x8BBE;&#x7F6E;&#x4E2A;1000&#x6BEB;&#x79D2;&#x7684;&#x5B9A;&#x65F6;&#x5668;&#xFF0C;&#x4E4B;&#x540E;&#x6267;&#x884C;B&#xFF0C;&#x7136;&#x540E;&#x5F85;&#x5B9A;&#x65F6;&#x5668;&#x89E6;&#x53D1;&#xFF0C;&#x6267;&#x884C;C&#x201C;&#x3002;&#x8FD9;&#x6BD4;&#x7B2C;&#x4E00;&#x7248;&#x66F4;&#x7CBE;&#x786E;&#xFF0C;&#x4F60;&#x80FD;&#x6CE8;&#x610F;&#x5230;&#x5176;&#x4E2D;&#x7684;&#x5DEE;&#x5F02;&#x5417;?</p>
<p>&#x5373;&#x4F7F;&#x7B2C;&#x4E8C;&#x7248;&#x66F4;&#x7CBE;&#x786E;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x7248;&#x672C;&#x90FD;&#x4E0D;&#x8DB3;&#x591F;&#x4EE5;&#x60F3;&#x6CD5;&#x543B;&#x5408;&#x4EE3;&#x7801;&#x3001;&#x4EE3;&#x7801;&#x543B;&#x5408;JS&#x5F15;&#x64CE;&#x7684;&#x65B9;&#x5F0F;&#x89E3;&#x91CA;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x79CD;&#x65AD;&#x5C42;&#x65E2;&#x5FAE;&#x5999;&#x53C8;&#x610F;&#x4E49;&#x91CD;&#x5927;&#xFF0C;&#x662F;&#x7406;&#x89E3;&#x8868;&#x8FBE;&#x548C;&#x7BA1;&#x7406;&#x5F02;&#x6B65;&#x7684;&#x56DE;&#x8C03;&#x7F3A;&#x70B9;&#x7684;&#x5173;&#x952E;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x4EE5;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7684;&#x5F62;&#x5F0F;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x5EF6;&#x7EED;&#xFF08;Continuations&#xFF09;&#xFF08;&#x6216;&#x8005;&#x5982;&#x8BB8;&#x591A;&#x7A0B;&#x5E8F;&#x90A3;&#x6837;&#x5F15;&#x5165;&#x597D;&#x51E0;&#x4E2A;&#xFF09;&#xFF0C;&#x5C31;&#x4F1A;&#x5728;&#x8111;&#x4E2D;&#x6240;&#x60F3;&#x7684;&#x548C;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x7684;&#x65B9;&#x5F0F;&#x4E4B;&#x95F4;&#x4EA7;&#x751F;&#x5206;&#x6B67;&#x3002;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x7684;&#x5206;&#x6B67;&#x90FD;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#xFF0C;&#x63A8;&#x8BBA;&#xFF0C;&#x8C03;&#x8BD5;&#x548C;&#x7EF4;&#x62A4;&#x3002;</p>
<h2 id="&#x5E8F;&#x5217;&#x5316;&#x7684;&#x5927;&#x8111;&#xFF08;sequential-brain&#xFF09;">&#x5E8F;&#x5217;&#x5316;&#x7684;&#x5927;&#x8111;&#xFF08;Sequential Brain&#xFF09;</h2>
<p>&#x6211;&#x5F88;&#x786E;&#x5B9A;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x8BFB;&#x8005;&#x66FE;&#x7ECF;&#x542C;&#x8FC7;&#x67D0;&#x4E9B;&#x4EBA;&#x8BF4;&#xFF08;&#x751A;&#x81F3;&#x4F60;&#x4E5F;&#x8BF4;&#x8FC7;&#xFF09;&#xFF0C;&#x201D;&#x6211;&#x662F;&#x4E2A;&#x4E00;&#x5FC3;&#x591A;&#x7528;&#x7684;&#x4EBA;&#x201C;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x6307;&#x80FD;&#x540C;&#x65F6;&#x5904;&#x7406;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#xFF09;&#x3002;&#x4ECE;&#x5E7D;&#x9ED8;&#x7684;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x611A;&#x8822;&#x7684;&#x8FB9;&#x62CD;&#x8111;&#x888B;&#x8FB9;&#x63C9;&#x809A;&#x5B50;&#x7684;&#x5B69;&#x5B50;&#x6E38;&#x620F;&#xFF09;&#x5230;&#x5E73;&#x5E38;&#x7684;&#xFF08;&#x8FB9;&#x8D70;&#x8FB9;&#x56BC;&#x53E3;&#x9999;&#x7CD6;&#xFF09;&#xFF0C;&#x518D;&#x5230;&#x975E;&#x5E38;&#x5371;&#x9669;&#x7684;&#xFF08;&#x8FB9;&#x5F00;&#x8F66;&#x8FB9;&#x53D1;&#x77ED;&#x4FE1;&#xFF09;&#xFF0C;&#x5F62;&#x5982;&#x8FD9;&#x4E9B;&#x79CD;&#x79CD;&#x3002;</p>
<p>&#x4F46;&#x6211;&#x4EEC;&#x662F;&#x4E00;&#x5FC3;&#x591A;&#x7528;&#x7684;&#x4EBA;&#x5417;&#xFF1F;&#x6211;&#x4EEC;&#x771F;&#x7684;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x505A;&#x5E76;&#x601D;&#x8003;&#x4E24;&#x4EF6;&#x6709;&#x610F;&#x8BC6;&#x7684;&#x4E8B;&#x60C5;&#x5417;&#xFF1F;&#x6211;&#x4EEC;&#x5927;&#x8111;&#x6700;&#x9AD8;&#x7B49;&#x7EA7;&#x7684;&#x529F;&#x80FD;&#x4E2D;&#x6709;&#x5E76;&#x884C;&#x591A;&#x7EBF;&#x7A0B;&#x5728;&#x8FD0;&#x884C;&#x5417;&#xFF1F;</p>
<p>&#x7B54;&#x6848;&#x53EF;&#x80FD;&#x8BA9;&#x4F60;&#x611F;&#x5230;&#x60CA;&#x8BB6;&#xFF1A;<strong>&#x6216;&#x8BB8;&#x4E0D;&#x662F;</strong>&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7684;&#x5927;&#x8111;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x6837;&#x8BBE;&#x5B9A;&#x7684;&#x3002;&#x5C3D;&#x7BA1;&#x8BB8;&#x591A;&#x4EBA;&#xFF08;&#x5C24;&#x5176;&#x662F;A&#x7C7B;&#x578B;&#x4EBA;&#x683C;&#x7684;&#x4EBA;&#xFF09;&#x4E0D;&#x613F;&#x627F;&#x8BA4;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x4E00;&#x5FC3;&#x4E00;&#x7528;&#x7684;&#x4EBA;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x4EFB;&#x4E00;&#x65F6;&#x523B;&#x53EA;&#x80FD;&#x60F3;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x6211;&#x4E0D;&#x662F;&#x8981;&#x8BA8;&#x8BBA;&#x6240;&#x6709;&#x65E0;&#x610F;&#x8BC6;&#x7684;&#x3001;&#x6F5C;&#x610F;&#x8BC6;&#x7684;&#x3001;&#x81EA;&#x52A8;&#x7684;&#x5927;&#x8111;&#x529F;&#x80FD;&#xFF0C;&#x6BD4;&#x5982;&#x5FC3;&#x8DF3;&#x3001;&#x547C;&#x5438;&#x548C;&#x7728;&#x773C;&#x775B;&#x7B49;&#x3002;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x7EF4;&#x6301;&#x751F;&#x547D;&#x6240;&#x5FC5;&#x987B;&#x7684;&#x91CD;&#x8981;&#x4EFB;&#x52A1;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x7279;&#x610F;&#x5206;&#x914D;&#x8111;&#x529B;&#x5230;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x4E0A;&#x3002;&#x8C22;&#x5929;&#x8C22;&#x5730;&#xFF0C;&#x5C31;&#x7B97;&#x6211;&#x4EEC;&#x5728;&#x4E09;&#x5206;&#x949F;&#x5185;&#x67E5;&#x770B;&#x4E86;15&#x6B21;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x63D0;&#x793A;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5927;&#x8111;&#x4E5F;&#x4F1A;&#x5728;&#x5E55;&#x540E;&#xFF08;&#x591A;&#x7EBF;&#x7A0B;&#xFF09;&#x5904;&#x7406;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x4EFB;&#x52A1;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x7684;&#x53CD;&#x800C;&#x662F;&#x6B64;&#x523B;&#x5FC3;&#x91CC;&#x5E55;&#x524D;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x76F8;&#x6BD4;&#x4E8E;&#x5E55;&#x540E;&#xFF09;&#x5728;&#x5904;&#x7406;&#x4EC0;&#x4E48;&#x4EFB;&#x52A1;&#x3002;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x6B63;&#x5728;&#x5199;&#x8FD9;&#x672C;&#x4E66;&#x3002;&#x6B64;&#x65F6;&#x6B64;&#x523B;&#x6211;&#x8FD8;&#x505A;&#x7740;&#x5176;&#x5B83;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x8111;&#x90E8;&#x529F;&#x80FD;&#x5417;&#xFF1F;&#x4E0D;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x3002;&#x6211;&#x5F88;&#x5FEB;&#x5E76;&#x4E14;&#x5F88;&#x5BB9;&#x6613;&#x5206;&#x5FC3;--&#x6700;&#x8FD1;&#x51E0;&#x6BB5;&#x6587;&#x5B57;&#x5DF2;&#x7ECF;&#x5206;&#x5FC3;&#x597D;&#x51E0;&#x6B21;&#x4E86;&#xFF01;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x5047;&#x88C5;&#x591A;&#x4EFB;&#x52A1;&#x65F6;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x548C;&#x670B;&#x53CB;&#x6216;&#x8005;&#x5BB6;&#x4EBA;&#x6253;&#x7535;&#x8BDD;&#x65F6;&#x6253;&#x5B57;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x505A;&#x7684;&#x5176;&#x5B9E;&#x662F;&#x5728;&#x5C3D;&#x53EF;&#x80FD;&#x5FEB;&#x5730;&#x5728;&#x591A;&#x4E2A;&#x60C5;&#x5883;&#x4E2D;&#x6765;&#x56DE;&#x5207;&#x6362;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x4E24;&#x4E2A;&#x6216;&#x66F4;&#x591A;&#x7684;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x6301;&#x7EED;&#x7684;&#x5FEB;&#x901F;&#x5207;&#x6362;&#xFF0C;&#x5904;&#x7406;&#x5F88;&#x77ED;&#x5F88;&#x5C0F;&#x7684;&#x4EFB;&#x52A1;&#x5757;&#x3002;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#x5982;&#x6B64;&#x4E4B;&#x5FEB;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x4ECE;&#x8868;&#x9762;&#x770B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x597D;&#x50CF;&#x5728;&#x5E76;&#x884C;&#x5730;&#x505A;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x5BF9;&#x4F60;&#x800C;&#x8A00;&#xFF0C;&#x542C;&#x8D77;&#x6765;&#x662F;&#x4E0D;&#x662F;&#x6000;&#x7591;&#x6709;&#x70B9;&#x50CF;&#x5F02;&#x6B65;&#x4E8B;&#x4EF6;&#x5E76;&#x53D1;&#xFF08;&#x5C31;&#x8DDF;JS&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x5DEE;&#x4E0D;&#x591A;&#xFF09;&#xFF1F;&#x5982;&#x679C;&#x4E0D;&#x662F;&#xFF0C;&#x56DE;&#x53BB;&#x91CD;&#x8BFB;&#x7B2C;&#x4E00;&#x7AE0;&#xFF01;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5C06;&#x590D;&#x6742;&#x7684;&#x795E;&#x7ECF;&#x4E16;&#x754C;&#x7B80;&#x5316;&#x4E3A;&#x6211;&#x60F3;&#x5728;&#x6B64;&#x8BA8;&#x8BBA;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5927;&#x8111;&#x5C31;&#x50CF;&#x662F;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x961F;&#x5217;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x628A;&#x6211;&#x5199;&#x7684;&#x6BCF;&#x4E2A;&#x5B57;&#x6BCD;&#xFF08;&#x6216;&#x8005;&#x5355;&#x8BCD;&#xFF09;&#x60F3;&#x8C61;&#x662F;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x4E8B;&#x4EF6;&#xFF0C;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#xFF0C;&#x5C31;&#x5728;&#x8FD9;&#x4E00;&#x53E5;&#x8BDD;&#x91CC;&#xFF0C;&#x6211;&#x7684;&#x5927;&#x8111;&#x601D;&#x7EF4;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x591A;&#x6B21;&#x88AB;&#x5176;&#x5B83;&#x4E8B;&#x4EF6;&#x6253;&#x65AD;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x4EA6;&#x6216;&#x8005;&#x5176;&#x5B83;&#x968F;&#x673A;&#x7684;&#x60F3;&#x6CD5;&#x3002;</p>
<p>&#x4F46;&#x6BCF;&#x6B21;&#x6211;&#x90FD;&#x4E0D;&#x4F1A;&#x88AB;&#x6253;&#x65AD;&#x5E76;&#x62C9;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#x5F53;&#x4E2D;&#x53BB;&#xFF08;&#x8C22;&#x5929;&#x8C22;&#x5730;--&#x8981;&#x4E0D;&#x7136;&#x5C31;&#x4E0D;&#x4F1A;&#x5199;&#x8FD9;&#x672C;&#x4E66;&#x4E86;&#xFF09;&#x3002;&#x4F46;&#x6211;&#x7ECF;&#x5E38;&#x611F;&#x89C9;&#x5230;&#x6211;&#x7684;&#x5927;&#x8111;&#x5728;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x60C5;&#x5883;&#xFF08;&#x5373;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#xFF09;&#x95F4;&#x4E0D;&#x65AD;&#x5207;&#x6362;&#x3002;&#x5982;&#x679C;JS&#x5F15;&#x64CE;&#x6709;&#x611F;&#x89C9;&#x7684;&#x8BDD;&#xFF0C;&#x5B83;&#x4E5F;&#x4F1A;&#x611F;&#x5230;&#x5F88;&#x75DB;&#x82E6;&#x3002;</p>
<h3 id="&#x6267;&#x884C;-vs-&#x8BA1;&#x5212;&#xFF08;doing-versus-planning&#xFF09;">&#x6267;&#x884C; VS &#x8BA1;&#x5212;&#xFF08;Doing Versus Planning&#xFF09;</h3>
<p>&#x597D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5927;&#x8111;&#x60F3;&#x50CF;&#x4E3A;&#x4EE5;&#x5355;&#x7EBF;&#x7A0B;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x961F;&#x5217;&#x7684;&#x65B9;&#x5F0F;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x5C31;&#x50CF;JS&#x5F15;&#x64CE;&#x4E00;&#x6837;&#x3002;&#x542C;&#x8D77;&#x6765;&#x633A;&#x642D;&#x7684;&#x3002;</p>
<p>&#x4F46;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x66F4;&#x7EC6;&#x81F4;&#x5730;&#x5206;&#x6790;&#x5176;&#x4E2D;&#x7684;&#x5FAE;&#x5999;&#x5DEE;&#x5F02;&#x3002;&#x5728;&#x5982;&#x4F55;&#x89C4;&#x5212;&#x5404;&#x79CD;&#x4EFB;&#x52A1;&#x548C;&#x5982;&#x4F55;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#xFF0C;&#x6709;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x3001;&#x53EF;&#x89C1;&#x7684;&#x5DEE;&#x5F02;&#x3002;</p>
<p>&#x518D;&#x62FF;&#x6211;&#x5199;&#x6587;&#x7AE0;&#x8FD9;&#x4E00;&#x6BD4;&#x55BB;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x7C97;&#x7565;&#x7684;&#x7F57;&#x5217;&#x4E86;&#x4E0B;&#x8BA1;&#x5212;&#xFF0C;&#x6309;&#x7167;&#x5FC3;&#x4E2D;&#x60F3;&#x5230;&#x7684;&#x70B9;&#x6309;&#x987A;&#x5E8F;&#x4E00;&#x76F4;&#x5199;&#x4E00;&#x76F4;&#x5199;&#x3002;&#x5728;&#x5199;&#x4F5C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x5E76;&#x6CA1;&#x6709;&#x5BF9;&#x9047;&#x5230;&#x7684;&#x4EFB;&#x4F55;&#x4E2D;&#x65AD;&#x6216;&#x8005;&#x975E;&#x7EBF;&#x6027;&#x6D3B;&#x52A8;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x6307;&#x8DDF;&#x5199;&#x4F5C;&#x65E0;&#x5173;&#x7684;&#x4E1C;&#x897F;&#xFF09;&#x4F5C;&#x8BA1;&#x5212;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x7684;&#x5927;&#x8111;&#x4E00;&#x76F4;&#x5728;&#x5207;&#x6362;&#x3002;</p>
<p>&#x5373;&#x4F7F;&#x4ECE;&#x64CD;&#x4F5C;&#x5C42;&#x9762;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x7684;&#x5927;&#x8111;&#x662F;&#x5F02;&#x6B65;&#x4E8B;&#x4EF6;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4F3C;&#x4E4E;&#x559C;&#x6B22;&#x4EE5;&#x540C;&#x6B65;&#x3001;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x89C4;&#x5212;&#x4EFB;&#x52A1;&#x3002;&#x201D;&#x6211;&#x8981;&#x53BB;&#x5546;&#x5E97;&#xFF0C;&#x7136;&#x540E;&#x4E70;&#x4E00;&#x4E9B;&#x725B;&#x5976;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8863;&#x7269;&#x4EA4;&#x7ED9;&#x5E72;&#x6D17;&#x5E97;&#x201C;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x8FD9;&#x79CD;&#x9AD8;&#x5C42;&#x7EA7;&#x7684;&#x60F3;&#x6CD5;&#xFF08;&#x8BA1;&#x5212;&#xFF09;&#x4ECE;&#x5F62;&#x5F0F;&#x4E0A;&#x6765;&#x770B;&#x5E76;&#x4E0D;&#x662F;&#x5F02;&#x6B65;&#x4E8B;&#x4EF6;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5BF9;&#x6211;&#x4EEC;&#x800C;&#x8A00;&#xFF0C;&#x5355;&#x72EC;&#x6309;&#x7167;&#x4E8B;&#x4EF6;&#x6765;&#x60F3;&#x5F88;&#x5C11;&#x89C1;&#x3002;&#x53CD;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x5E8F;&#x5217;&#x5316;&#x5730;&#x89C4;&#x5212;&#x4E8B;&#x60C5;&#xFF08;A&#x7136;&#x540E;B&#x7136;&#x540E;C&#xFF09;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x6709;&#x67D0;&#x79CD;&#x65F6;&#x95F4;&#x963B;&#x585E;&#x5F3A;&#x5236;B&#x7B49;A&#xFF0C;C&#x7B49;B&#x4E00;&#x6837;&#x3002;</p>
<p>&#x5F53;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x89C4;&#x5212;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x5C06;&#x8981;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x662F;&#x4F18;&#x79C0;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F1A;&#x4ED4;&#x7EC6;&#x89C4;&#x5212;&#x3002;&#x201D;&#x6211;&#x8981;&#x628A;<code>z</code>&#x8BBE;&#x4E3A;<code>x</code>&#x7684;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x628A;<code>x</code>&#x8BBE;&#x4E3A;<code>y</code>&#x7684;&#x503C;&#x201C;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x4E00;&#x53E5;&#x4E00;&#x53E5;&#x5730;&#x5199;&#x51FA;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-comment">// swap `x` and `y` (via temp variable `z`)</span>
z = x;
x = y;
y = z;
</code></pre>
<p>&#x8FD9;&#x4E09;&#x4E2A;&#x8D4B;&#x503C;&#x8BED;&#x53E5;&#x65F6;&#x540C;&#x6B65;&#x7684;&#xFF0C;&#x56E0;&#x6B64;<code>x=y</code>&#x7B49;<code>z=x</code>&#x7ED3;&#x675F;&#xFF0C;&#x800C;<code>y=z</code>&#x7B49;<code>x=y</code>&#x7ED3;&#x675F;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E09;&#x4E2A;&#x8BED;&#x53E5;&#x5E94;&#x8BE5;&#x6309;&#x7167;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x987A;&#x5E8F;&#x6267;&#x884C;&#xFF0C;&#x4E00;&#x4E2A;&#x63A5;&#x7740;&#x4E00;&#x4E2A;&#x3002;&#x4E07;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x513F;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x9762;&#x5BF9;&#x607C;&#x4EBA;&#x7684;&#x5F02;&#x6B65;&#x4E8B;&#x4EF6;&#x7EC6;&#x8282;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x7684;&#x8BDD;&#xFF0C;&#x4EE3;&#x7801;&#x7ACB;&#x523B;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x590D;&#x6742;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x540C;&#x6B65;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x7684;&#x5BF9;&#x5E94;&#x5230;&#x540C;&#x6B65;&#x7684;&#x4EE3;&#x7801;&#x8BED;&#x53E5;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x7684;&#x5927;&#x8111;&#x5728;&#x89C4;&#x5212;&#x5F02;&#x6B65;&#x4EE3;&#x7801;&#x65F6;&#x80FD;&#x505A;&#x5F97;&#x6709;&#x591A;&#x597D;&#x5462;&#xFF1F;</p>
<p>&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x6211;&#x4EEC;&#x4EE3;&#x7801;&#x8868;&#x8FBE;&#x5F02;&#x6B65;&#xFF08;&#x7528;&#x56DE;&#x8C03;&#xFF09;&#x7684;&#x65B9;&#x5F0F;&#x5E76;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x7B26;&#x5408;&#x6211;&#x4EEC;&#x5927;&#x8111;&#x7684;&#x540C;&#x6B65;&#x89C4;&#x5212;&#x4E8B;&#x60C5;&#x8FD9;&#x4E00;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x4F60;&#x80FD;&#x50CF;&#x8FD9;&#x6837;&#x6309;&#x65F6;&#x95F4;&#x7EBF;&#x5B9E;&#x9645;&#x60F3;&#x8C61;&#x4E0B;&#x8BA1;&#x5212;&#x7684;&#x5F85;&#x505A;&#x4E8B;&#x4EF6;&#x5417;&#xFF1F;</p>
<blockquote>
<p>&quot;&#x6211;&#x8981;&#x53BB;&#x8D9F;&#x5546;&#x5E97;&#xFF0C;&#x4F46;&#x8DEF;&#x4E0A;&#x6211;&#x4F1A;&#x6253;&#x4E2A;&#x7535;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x2019;&#x55E8;&#xFF0C;&#x5988;&#x5988;&#x2018;&#xFF0C;&#x5728;&#x5979;&#x8BF4;&#x8BDD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4F1A;&#x5728;GPS&#x4E0A;&#x67E5;&#x8BE2;&#x5546;&#x5E97;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x82B1;&#x51E0;&#x5206;&#x949F;&#x52A0;&#x8F7D;&#xFF0C;&#x4E4B;&#x540E;&#x6211;&#x8C03;&#x4F4E;&#x6536;&#x97F3;&#x673A;&#x7684;&#x97F3;&#x91CF;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x6211;&#x80FD;&#x591F;&#x542C;&#x6E05;&#x695A;&#x5988;&#x5988;&#x8BF4;&#x8BDD;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x610F;&#x8BC6;&#x5230;&#x6211;&#x5FD8;&#x4E86;&#x7A7F;&#x5939;&#x514B;&#xFF0C;&#x5916;&#x9762;&#x633A;&#x51B7;&#x7684;&#xFF0C;&#x4F46;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x7EE7;&#x7EED;&#x5F00;&#xFF0C;&#x5E76;&#x4E14;&#x548C;&#x5988;&#x5988;&#x6253;&#x7535;&#x8BDD;&#x3002;&#x4E4B;&#x540E;&#x542C;&#x5230;&#x53EE;&#x7684;&#x4E00;&#x58F0;&#xFF0C;&#x63D0;&#x9192;&#x6211;&#x7CFB;&#x7D27;&#x5B89;&#x5168;&#x5E26;&#xFF0C;&#x2019;&#x662F;&#x7684;&#xFF0C;&#x5988;&#x5988;&#xFF0C;&#x6211;&#x6B63;&#x5728;&#x7CFB;&#x5B89;&#x5168;&#x5E26;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x90FD;&#x7CFB;&#x7684;&#x2018;&#xFF0C;&#x554A;&#x54C8;&#xFF0C;&#x6700;&#x7EC8;GPS&#x627E;&#x5230;&#x7684;&#x6B63;&#x786E;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x73B0;&#x5728;...&quot;</p>
</blockquote>
<p>&#x5C3D;&#x7BA1;&#x5728;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x4E2D;&#xFF0C;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x89C4;&#x5212;&#x3001;&#x601D;&#x8003;&#x505A;&#x4EC0;&#x4E48;&#x4EE5;&#x53CA;&#x505A;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x542C;&#x8D77;&#x6765;&#x6709;&#x70B9;&#x53EF;&#x7B11;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x6B63;&#x662F;&#x6211;&#x4EEC;&#x5927;&#x8111;&#x8FD0;&#x884C;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x8BB0;&#x4F4F;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x591A;&#x4EFB;&#x52A1;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x5FEB;&#x901F;&#x5207;&#x6362;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x5199;&#x5F02;&#x6B65;&#x4E8B;&#x4EF6;&#x4EE3;&#x7801;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x90FD;&#x662F;&#x91C7;&#x7528;&#x56DE;&#x8C03;&#x5B9E;&#x73B0;&#x7684;&#x8BDD;&#xFF0C;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#x7684;&#x3002;&#x7A76;&#x5176;&#x539F;&#x56E0;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x610F;&#x8BC6;&#x6D41;&#x5F0F;&#x7684;&#x601D;&#x8003;/&#x8BA1;&#x5212;&#x4E0D;&#x7B26;&#x5408;&#x6211;&#x4EEC;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x7684;&#x672C;&#x6027;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x662F;&#x6309;&#x7167;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x7684;&#x987A;&#x5E8F;&#x6765;&#x60F3;&#x4E8B;&#x60C5;&#x7684;&#xFF0C;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x4ECE;&#x540C;&#x6B65;&#x8F6C;&#x5411;&#x5F02;&#x6B65;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EE3;&#x7801;&#x4E2D;&#x53EF;&#x7528;&#x7684;&#x5DE5;&#x5177;&#xFF08;&#x56DE;&#x8C03;&#xFF09;&#x4E0D;&#x662F;&#x6309;&#x7167;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8868;&#x8FBE;&#x7684;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5F88;&#x96BE;&#x7528;&#x56DE;&#x8C03;&#x51C6;&#x786E;&#x5730;&#x7F16;&#x5199;&#x548C;&#x89E3;&#x91CA;&#x5F02;&#x6B65;&#x4EE3;&#x7801;&#xFF1A;&#x56E0;&#x4E3A;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x5927;&#x8111;&#x601D;&#x8003;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong> </p>
<p>&#x552F;&#x4E00;&#x4E00;&#x4EF6;&#x6BD4;&#x4E0D;&#x77E5;&#x9053;&#x4EE3;&#x7801;&#x4E3A;&#x4EC0;&#x4E48;&#x5F02;&#x5E38;&#x66F4;&#x7CDF;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x521A;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#x597D;&#x597D;&#x7684;&#xFF01;&#x8FD9;&#x662F;&#x7ECF;&#x5178;&#x7684;&#x201D;&#x7EB8;&#x724C;&#x5C4B;&#x201C;&#x5FC3;&#x7406;&#xFF1A;&#x201D;&#x5B83;&#x8FD0;&#x884C;&#x6B63;&#x5E38;&#xFF0C;&#x4F46;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#xFF0C;&#x56E0;&#x800C;&#x4E5F;&#x5C31;&#x6CA1;&#x4EBA;&#x53BB;&#x78B0;&#x5B83;&#x4E86;&#xFF01;&#x201C;&#x4F60;&#x53EF;&#x80FD;&#x542C;&#x8BF4;&#x8FC7;&#xFF0C;&#x201D;&#x4ED6;&#x4EBA;&#x5373;&#x662F;&#x5730;&#x72F1;&#x201C;&#xFF08;&#x8428;&#x7279;&#xFF09;&#xFF0C;&#x7F16;&#x7A0B;&#x4EBA;&#x5458;&#x7A0D;&#x5FAE;&#x6539;&#x52A8;&#x4E00;&#x4E0B;&#xFF0C;&#x201D;&#x4ED6;&#x4EBA;&#x7684;&#x4EE3;&#x7801;&#x5C31;&#x662F;&#x5730;&#x72F1;&#x201C;&#x3002;&#x6211;&#x771F;&#x7684;&#x8BA4;&#x4E3A;&#xFF1A;&#x201D;&#x4E0D;&#x4E86;&#x89E3;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x624D;&#x662F;&#x5730;&#x72F1;&#x201C;&#x3002;&#x800C;&#x56DE;&#x8C03;&#x5219;&#x662F;&#x7F6A;&#x9B41;&#x7978;&#x9996;&#x3002;</p>
<h3 id="&#x5D4C;&#x5957;&#x94FE;&#x5F0F;&#x56DE;&#x8C03;&#xFF08;nestedchained-callbacks&#xFF09;">&#x5D4C;&#x5957;/&#x94FE;&#x5F0F;&#x56DE;&#x8C03;&#xFF08;Nested/Chained Callbacks&#xFF09;</h3>
<p>&#x8003;&#x8651;&#x5982;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-javascript">listen( <span class="hljs-string">&quot;click&quot;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">handler</span>(<span class="hljs-params">evt</span>)</span>{
    setTimeout( <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">request</span>(<span class="hljs-params"></span>)</span>{
        ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">response</span>(<span class="hljs-params">text</span>)</span>{
            <span class="hljs-keyword">if</span> (text == <span class="hljs-string">&quot;hello&quot;</span>) {
                handler();
            }
            <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (text == <span class="hljs-string">&quot;world&quot;</span>) {
                request();
            }
        } );
    }, <span class="hljs-number">500</span>) ;
} );
</code></pre>
<p>&#x50CF;&#x8FD9;&#x6837;&#x7684;&#x4EE3;&#x7801;&#x4F60;&#x4E00;&#x5B9A;&#x5F88;&#x719F;&#x6089;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x4E09;&#x4E2A;&#x51FD;&#x6570;&#x5D4C;&#x5957;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x64CD;&#x4F5C;&#xFF08;&#x4EFB;&#x52A1;&#xFF0C;&#x201D;&#x8FDB;&#x7A0B;&#x201C;&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x4EE3;&#x7801;&#x5E38;&#x79F0;&#x4E3A;&#x201D;&#x56DE;&#x8C03;&#x5730;&#x72F1;&#x201C;&#xFF08;callback hell&#xFF09;&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x6210;&#x4E3A;&#x201D;&#x672B;&#x65E5;&#x91D1;&#x5B57;&#x5854;&#x201C;&#xFF08;pyramid of doom&#xFF09;&#xFF08;&#x56E0;&#x4E3A;&#x7531;&#x4E8E;&#x5D4C;&#x5957;&#x7F29;&#x8FDB;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x4E00;&#x8FB9;&#x503E;&#x659C;&#x7684;&#x4E09;&#x89D2;&#x5F62;&#xFF09;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x201D;&#x56DE;&#x8C03;&#x5730;&#x72F1;&#x201C;&#x548C;&#x5D4C;&#x5957;/&#x7F29;&#x8FDB;&#x51E0;&#x4E4E;&#x6CA1;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#x3002;&#x95EE;&#x9898;&#x8FDC;&#x4E0D;&#x6B62;&#x5982;&#x6B64;&#x3002;&#x968F;&#x7740;&#x6DF1;&#x5165;&#x672C;&#x7AE0;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x660E;&#x767D;&#x5176;&#x4E2D;&#x7684;&#x9053;&#x7406;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x7B49;&#x5F85;&#x201D;click&#x201C;&#x4E8B;&#x4EF6;&#xFF0C;&#x4E4B;&#x540E;&#x7B49;&#x5F85;&#x5B9A;&#x65F6;&#x5668;&#x89E6;&#x53D1;&#xFF0C;&#x4E4B;&#x540E;&#x518D;&#x7B49;&#x5F85;Ajax&#x54CD;&#x5E94;&#x8FD4;&#x56DE;&#xFF0C;&#x6B64;&#x65F6;&#x53EF;&#x80FD;&#x4ECE;&#x5934;&#x518D;&#x6765;&#x4E00;&#x904D;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x773C;&#x770B;&#x4E0A;&#x53BB;&#xFF0C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4F3C;&#x4E4E;&#x5F88;&#x81EA;&#x7136;&#x5730;&#x5C06;&#x5F02;&#x6B65;&#x5BF9;&#x5E94;&#x5230;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x5927;&#x8111;&#x8BA1;&#x5212;&#x65B9;&#x5F0F;&#x4E0A;&#x53BB;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF08;<em>&#x73B0;&#x5728;</em>&#xFF09;,&#x6211;&#x4EEC;&#xFF1A;</p>
<pre><code class="lang-javascript">listen( <span class="hljs-string">&quot;..&quot;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">handler</span>(<span class="hljs-params">..</span>)</span>{
    <span class="hljs-comment">// ..</span>
} );
</code></pre>
<p><em>&#x4E4B;&#x540E;</em>&#xFF0C;&#x6211;&#x4EEC;&#xFF1A;</p>
<pre><code class="lang-javascript">setTimeout( <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">request</span>(<span class="hljs-params">..</span>)</span>{
    <span class="hljs-comment">// ..</span>
}, <span class="hljs-number">500</span>) ;
</code></pre>
<p>&#x518D;<em>&#x4E4B;&#x540E;</em>&#xFF0C;&#x6211;&#x4EEC;&#xFF1A;</p>
<pre><code class="lang-javascript">ajax( <span class="hljs-string">&quot;..&quot;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">response</span>(<span class="hljs-params">..</span>)</span>{
    <span class="hljs-comment">// ..</span>
} );
</code></pre>
<p>&#x6700;&#x7EC8;&#xFF08;&#x518D;<em>&#x4E4B;&#x540E;</em>&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">if</span> ( .. ) {
    <span class="hljs-comment">// ..</span>
}
<span class="hljs-keyword">else</span> ..
</code></pre>
<p>&#x4F46;&#x4EE5;&#x8FD9;&#x79CD;&#x7EBF;&#x6027;&#x65B9;&#x5F0F;&#x89E3;&#x91CA;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x6709;&#x4E9B;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x5F88;&#x5DE7;&#x5408;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x662F;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x6765;&#x7684;&#xFF08;1,2,3,4...&#xFF09;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x5F02;&#x6B65;JS&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x6709;&#x8BB8;&#x591A;&#x5E72;&#x6270;&#x9879;&#x51FA;&#x73B0;&#xFF0C;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x5728;&#x4ECE;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x8DF3;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x8111;&#x4E2D;&#x7075;&#x5DE7;&#x5730;&#x7ED5;&#x8FC7;&#x8FD9;&#x4E9B;&#x5E72;&#x6270;&#x9879;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x56DE;&#x8C03;&#x8D1F;&#x62C5;&#x4E0B;&#x7406;&#x89E3;&#x5F02;&#x6B65;&#x6D41;&#x4E0D;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#xFF0C;&#x4F46;&#x5373;&#x4F7F;&#x6709;&#x8FC7;&#x591A;&#x6B21;&#x5B9E;&#x8DF5;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x81EA;&#x7136;&#x548C;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x66F4;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x5728;&#x5B9E;&#x4F8B;&#x4EE3;&#x7801;&#x4E2D;&#x5E76;&#x4E0D;&#x660E;&#x663E;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x4E3E;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF08;&#x4F2A;&#x4EE3;&#x7801;&#xFF09;&#x6765;&#x8BF4;&#x660E;&#xFF1A;</p>
<pre><code class="lang-javascript">doA( <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>)</span>{
    doB();

    doC( <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>)</span>{
        doD();
    } )

    doE();
} );

doF();
</code></pre>
<p>&#x5C3D;&#x7BA1;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x4EBA;&#x80FD;&#x591F;&#x6B63;&#x786E;&#x5730;&#x8BC6;&#x522B;&#x8FD0;&#x884C;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x6211;&#x6253;&#x8D4C;&#x7B2C;&#x4E00;&#x773C;&#x770B;&#x4E0A;&#x53BB;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x662F;&#x6709;&#x70B9;&#x56F0;&#x60D1;&#x7684;&#xFF0C;&#x53EF;&#x80FD;&#x5728;&#x5FC3;&#x91CC;&#x60F3;&#x4F1A;&#x513F;&#x624D;&#x884C;&#x3002;&#x4EE3;&#x7801;&#x5C06;&#x4F1A;&#x6309;&#x4EE5;&#x4E0B;&#x987A;&#x5E8F;&#x8FD0;&#x884C;&#xFF1A;</p>
<ul>
<li><code>doA()</code></li>
<li><code>doF()</code></li>
<li><code>doB()</code></li>
<li><code>doC()</code></li>
<li><code>doE()</code></li>
<li><code>doD()</code></li>
</ul>
<p>&#x4F60;&#x7B2C;&#x4E00;&#x6B21;&#x770B;&#x5230;&#x4EE3;&#x7801;&#x65F6;&#x505A;&#x5BF9;&#x4E86;&#x5417;&#xFF1F;</p>
<p>&#x597D;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x4F1A;&#x60F3;&#x6211;&#x7684;&#x51FD;&#x6570;&#x547D;&#x540D;&#x5E76;&#x4E0D;&#x516C;&#x5E73;&#xFF0C;&#x6545;&#x610F;&#x628A;&#x4EBA;&#x5F15;&#x5165;&#x8FF7;&#x9014;&#x3002;&#x6211;&#x53D1;&#x8A93;&#x6211;&#x53EA;&#x662F;&#x6309;&#x7167;&#x4ECE;&#x4E0A;&#x5230;&#x4E0B;&#x7684;&#x65B9;&#x5F0F;&#x6309;&#x5E8F;&#x547D;&#x540D;&#x7684;&#x3002;&#x90A3;&#x6211;&#x4EEC;&#x518D;&#x8BD5;&#x4E00;&#x6B21;&#xFF1A;</p>
<pre><code class="lang-javascript">doA( <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>)</span>{
    doC();

    doD( <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>)</span>{
        doF();
    } )

    doE();
} );

doB();
</code></pre>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6309;&#x7167;&#x5B9E;&#x9645;&#x6267;&#x884C;&#x7684;&#x5B57;&#x6BCD;&#x987A;&#x5E8F;&#x91CD;&#x547D;&#x540D;&#x4E86;&#x3002;&#x4F46;&#x6211;&#x6253;&#x8D4C;&#x5373;&#x4F7F;&#x5BF9;&#x8FD9;&#x4E2A;&#x60C5;&#x5F62;&#x6709;&#x7ECF;&#x9A8C;&#x4E86;&#xFF0C;&#x5BF9;&#x591A;&#x6570;&#x8BFB;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x901A;&#x8FC7;&#x8DDF;&#x8E2A;<code>A -&gt; B -&gt; C -&gt; D -&gt; E -&gt; F</code>&#x7684;&#x987A;&#x5E8F;&#x5E76;&#x4E0D;&#x81EA;&#x7136;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x4F60;&#x7684;&#x773C;&#x775B;&#x5728;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x4E4B;&#x95F4;&#x75DB;&#x82E6;&#x5730;&#x8DF3;&#x6765;&#x8DF3;&#x53BB;&#xFF0C;&#x662F;&#x5417;&#xFF1F;</p>
<p>&#x4F46;&#x5373;&#x4F7F;&#x4F60;&#x8BA4;&#x4E3A;&#x770B;&#x8D77;&#x6765;&#x8FD8;&#x7B97;&#x81EA;&#x7136;&#xFF0C;&#x4ECD;&#x7136;&#x6709;&#x4E2A;&#x66F4;&#x5371;&#x9669;&#x7684;&#x4E1C;&#x897F;&#x53EF;&#x80FD;&#x6363;&#x4E71;&#xFF0C;&#x4F60;&#x6CE8;&#x610F;&#x5230;&#x662F;&#x4EC0;&#x4E48;&#x4E86;&#x5417;&#xFF1F;</p>
<p>&#x5047;&#x5982;<code>doA(..)</code>&#x6216;<code>doD(..)</code>&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x7684;&#x5F02;&#x6B65;&#x5462;&#xFF1F;&#x54E6;&#xFF0C;&#x73B0;&#x5728;&#x987A;&#x5E8F;&#x4E0D;&#x540C;&#x4E86;&#x3002;&#x5982;&#x679C;&#x5B83;&#x4EEC;&#x4E24;&#x4E2A;&#x90FD;&#x662F;&#x540C;&#x6B65;&#x7684;&#xFF08;&#x6709;&#x65F6;&#x53EF;&#x80FD;&#x662F;&#xFF0C;&#x4F9D;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x6761;&#x4EF6;&#x800C;&#x5B9A;&#xFF09;&#xFF0C;&#x73B0;&#x5728;&#x987A;&#x5E8F;&#x662F;<code>A -&gt; C -&gt; D -&gt; F -&gt; E -&gt; B</code>&#x3002;</p>
<p>&#x4F3C;&#x4E4E;&#x542C;&#x5230;&#x4E86;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7684;JS&#x7A0B;&#x5E8F;&#x5458;&#x4E00;&#x58F0;&#x8F7B;&#x5FAE;&#x7684;&#x53F9;&#x606F;&#xFF0C;&#x4ED6;&#x4EEC;&#x521A;&#x521A;&#x4EE5;&#x624B;&#x63A9;&#x9762;&#x3002;</p>
<p>&#x662F;&#x5D4C;&#x5957;&#x7684;&#x95EE;&#x9898;&#x5417;&#xFF1F;&#x662F;&#x5B83;&#x8BA9;&#x5F02;&#x6B65;&#x6D41;&#x8FFD;&#x8E2A;&#x53D8;&#x5F97;&#x56F0;&#x96BE;&#x4E86;&#x5417;&#xFF1F;&#x5F53;&#x7136;&#xFF0C;&#x90E8;&#x5206;&#x662F;&#x3002;</p>
<p>&#x4F46;&#x8BA9;&#x6211;&#x4EEC;&#x91CD;&#x5199;&#x4E4B;&#x524D;&#x7684;&#x5D4C;&#x5957;&#x4E8B;&#x4EF6;/&#x5B9A;&#x65F6;&#x5668;/Ajax&#xFF0C;&#x4E0D;&#x7528;&#x5D4C;&#x5957;&#xFF1A;</p>
<pre><code class="lang-javascript">listen( <span class="hljs-string">&quot;click&quot;</span>, handler );

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">handler</span>(<span class="hljs-params"></span>) </span>{
    setTimeout( request, <span class="hljs-number">500</span> );
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">request</span>(<span class="hljs-params"></span>)</span>{
    ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, response );
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">response</span>(<span class="hljs-params">text</span>)</span>{
    <span class="hljs-keyword">if</span> (text == <span class="hljs-string">&quot;hello&quot;</span>) {
        handler();
    }
    <span class="hljs-keyword">else</span> <span class="hljs-keyword">if</span> (text == <span class="hljs-string">&quot;world&quot;</span>) {
        request();
    }
}
</code></pre>
<p>&#x76F8;&#x6BD4;&#x4E8E;&#x4E4B;&#x524D;&#x7684;&#x5D4C;&#x5957;/&#x7F29;&#x8FDB;&#xFF0C;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x4EE3;&#x7801;&#x5E76;&#x6CA1;&#x6709;&#x53D8;&#x5F97;&#x66F4;&#x5BB9;&#x6613;&#x8BC6;&#x522B;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x53D7;&#x201D;&#x5730;&#x72F1;&#x56DE;&#x8C03;&#x201C;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;</p>
<p>&#x5F53;&#x5E8F;&#x5217;&#x5316;&#x5730;&#x89E3;&#x91CA;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x8DF3;&#x8FC7;&#x4E00;&#x4E2A;&#x53C8;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x56F4;&#x7ED5;&#x7740;&#x57FA;&#x672C;&#x4EE3;&#x7801;&#x6765;&#x201C;&#x770B;&#x201D;&#x5E8F;&#x5217;&#x6D41;&#x3002;&#x8BB0;&#x4F4F;&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x6700;&#x597D;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x7B80;&#x5316;&#x4EE3;&#x7801;&#x3002;&#x6211;&#x4EEC;&#x90FD;&#x77E5;&#x9053;&#x771F;&#x6B63;&#x7684;&#x5F02;&#x6B65;JS&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x66F4;&#x590D;&#x6742;&#xFF0C;&#x4F7F;&#x5F97;&#x89E3;&#x91CA;&#x8FD9;&#x79CD;&#x89C4;&#x6A21;&#x4EE3;&#x7801;&#x7684;&#x987A;&#x5E8F;&#x53D8;&#x5F97;&#x66F4;&#x56F0;&#x96BE;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF1A;&#x4E3A;&#x4E86;&#x5C06;&#x6B65;&#x9AA4;2,3,4&#x4E32;&#x8054;&#x8D77;&#x6765;&#x4EE5;&#x4FBF;&#x8FDE;&#x7EED;&#x53D1;&#x751F;&#xFF0C;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x552F;&#x4E00;&#x542F;&#x793A;&#x662F;&#x5C06;&#x6B65;&#x9AA4;2&#x786C;&#x7F16;&#x7801;&#x8FDB;&#x6B65;&#x9AA4;1&#xFF0C;&#x6B65;&#x9AA4;3&#x786C;&#x7F16;&#x7801;&#x8FDB;&#x6B65;&#x9AA4;2&#xFF0C;&#x6B65;&#x9AA4;4&#x786C;&#x7F16;&#x7801;&#x8FDB;&#x6B65;&#x9AA4;3&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x786C;&#x7F16;&#x7801;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x574F;&#x4E8B;&#xFF0C;&#x5982;&#x679C;&#x6B65;&#x9AA4;2&#x603B;&#x662F;&#x5BFC;&#x81F4;&#x6B65;&#x9AA4;3&#x53D1;&#x751F;&#x7684;&#x8BDD;&#x3002;</p>
<p>&#x4F46;&#x786C;&#x7F16;&#x7801;&#x80AF;&#x5B9A;&#x4F1A;&#x4F7F;&#x7A0B;&#x5E8F;&#x53D8;&#x5F97;&#x8106;&#x5F31;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5E76;&#x4E0D;&#x4F1A;&#x5BF9;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x6B65;&#x9AA4;&#x8FD0;&#x884C;&#x504F;&#x5DEE;&#x7684;&#x9519;&#x8BEF;&#x8D1F;&#x8D23;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6B65;&#x9AA4;2&#x5931;&#x8D25;&#x4E86;&#xFF0C;&#x5219;&#x6C38;&#x8FDC;&#x4E5F;&#x4E0D;&#x4F1A;&#x8FD0;&#x884C;&#x5230;&#x6B65;&#x9AA4;3&#xFF0C;&#x66F4;&#x6CA1;&#x6709;&#x91CD;&#x8BD5;&#x6B65;&#x9AA4;2&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x79FB;&#x5230;&#x4E00;&#x4E2A;&#x53EF;&#x9009;&#x7684;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x6D41;&#x4E2D;&#xFF0C;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#x3002;</p>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x624B;&#x52A8;&#x5730;&#x7F16;&#x5165;&#x5230;&#x6BCF;&#x4E00;&#x6B65;&#x5F53;&#x4E2D;&#x53BB;&#x89E3;&#x51B3;&#xFF0C;&#x4F46;&#x90A3;&#x6837;&#x7684;&#x4EE3;&#x7801;&#x901A;&#x5E38;&#x975E;&#x5E38;&#x91CD;&#x590D;&#xFF0C;&#x5728;&#x7A0B;&#x5E8F;&#x7684;&#x5176;&#x5B83;&#x6B65;&#x9AA4;&#x6216;&#x8005;&#x5F02;&#x6B65;&#x6D41;&#x4E2D;&#x96BE;&#x4EE5;&#x590D;&#x7528;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x53EF;&#x80FD;&#x662F;&#x4EE5;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#xFF08;&#x8FD9;&#x6837;&#xFF0C;&#x7136;&#x540E;&#x8FD9;&#x6837;&#xFF0C;&#x7136;&#x540E;&#x8FD9;&#x6837;&#xFF09;&#x8BA1;&#x5212;&#x4E00;&#x7CFB;&#x5217;&#x4EFB;&#x52A1;&#xFF0C;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x5927;&#x8111;&#x4E8B;&#x4EF6;&#x5316;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x6D41;&#x7A0B;&#x63A7;&#x5236;&#x7684;&#x6062;&#x590D;/&#x91CD;&#x8BD5;/&#x5206;&#x53C9;&#x53D8;&#x5F97;&#x6BEB;&#x4E0D;&#x8D39;&#x529B;&#x3002;&#x5982;&#x679C;&#x4F60;&#x51FA;&#x53BB;&#x529E;&#x4E8B;&#xFF0C;&#x53D1;&#x73B0;&#x628A;&#x8D2D;&#x7269;&#x6E05;&#x5355;&#x843D;&#x5728;&#x5BB6;&#x4E86;&#x3002;&#x4E00;&#x5929;&#x5E76;&#x6CA1;&#x6709;&#x7ED3;&#x675F;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x6CA1;&#x6709;&#x4E8B;&#x5148;&#x8BA1;&#x5212;&#x3002;&#x4F60;&#x7684;&#x5927;&#x8111;&#x53EA;&#x4F1A;&#x7B80;&#x5355;&#x5730;&#x7ED5;&#x8FC7;&#x8FD9;&#x4EF6;&#x5C0F;&#x4E8B;&#xFF1A;&#x56DE;&#x5230;&#x5BB6;&#x3001;&#x62FF;&#x4E0A;&#x6E05;&#x5355;&#xFF0C;&#x7136;&#x540E;&#x7ACB;&#x523B;&#x56DE;&#x5230;&#x5546;&#x5E97;&#x53BB;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x624B;&#x52A8;&#x786C;&#x7F16;&#x7801;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7531;&#x4E8E;&#x5176;&#x8106;&#x5F31;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5F88;&#x4E0D;&#x4F18;&#x96C5;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x6307;&#x5B9A;&#xFF08;&#x5373;&#x9884;&#x5148;&#x8BA1;&#x5212;&#xFF09;&#x5B8C;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x96BE;&#x7EF4;&#x62A4;&#x548C;&#x5347;&#x7EA7;&#x3002;</p>
<p><strong>&#x90A3;</strong>&#x624D;&#x662F;&#x201C;&#x56DE;&#x8C03;&#x5730;&#x72F1;&#x201D;&#x7684;&#x771F;&#x6B63;&#x542B;&#x4E49;&#xFF01;&#x5D4C;&#x5957;/&#x7F29;&#x8FDB;&#x53EA;&#x662F;&#x57FA;&#x672C;&#x7684;&#x969C;&#x773C;&#x6CD5;&#x3002;</p>
<p>&#x90A3;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x63D0;&#x5230;&#x5F53;&#x4E24;&#x4E2A;&#x6216;&#x66F4;&#x591A;&#x7684;&#x56DE;&#x8C03;&#x94FE;&#x540C;&#x65F6;&#x53D1;&#x751F;&#x65F6;&#x4F1A;&#x51FA;&#x73B0;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x3002;&#x6216;&#x8005;&#x7B2C;&#x4E09;&#x6B65;&#x6269;&#x5C55;&#x5230;&#x6709;&#x201C;&#x95E8;&#x201D;&#xFF08;gate&#xFF09;&#x6216;&#x201C;&#x95E9;&#x201D;&#xFF08;latch&#xFF09;&#x7684;&#x5E76;&#x884C;&#x56DE;&#x8C03;&#x4E2D;&#xFF0C;&#x6216;&#x8005;...OMG&#xFF0C;&#x6211;&#x8111;&#x888B;&#x75BC;&#xFF0C;&#x4F60;&#x4EEC;&#x5462;&#xFF1F;</p>
<p>&#x6B64;&#x523B;&#xFF0C;&#x4F60;&#x6CE8;&#x610F;&#x5230;&#x4E86;&#x5417;&#xFF1F;&#x6211;&#x4EEC;&#x5E8F;&#x5217;&#x5316;&#x3001;&#x963B;&#x585E;&#x6027;&#x7684;&#x5927;&#x8111;&#x8BA1;&#x5212;&#x884C;&#x4E3A;&#x5E76;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x5BF9;&#x5E94;&#x5230;&#x56DE;&#x8C03;&#x5BFC;&#x5411;&#x7684;&#x5F02;&#x6B65;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x662F;&#x9610;&#x8FF0;&#x56DE;&#x8C03;&#x65F6;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x7F3A;&#x9677;&#xFF1A;&#x4EE3;&#x7801;&#x4E2D;&#x91C7;&#x7528;&#x56DE;&#x8C03;&#x8868;&#x793A;&#x5F02;&#x6B65;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5927;&#x8111;&#x5FC5;&#x987B;&#x5F88;&#x52AA;&#x529B;&#x624D;&#x80FD;&#x8DDF;&#x4E0A;&#x3002;</p>
<h2 id="&#x4FE1;&#x4EFB;&#x95EE;&#x9898;&#xFF08;trust-issues&#xFF09;">&#x4FE1;&#x4EFB;&#x95EE;&#x9898;&#xFF08;Trust Issues&#xFF09;</h2>
<p>&#x5E8F;&#x5217;&#x5316;&#x7684;&#x5927;&#x8111;&#x884C;&#x4E3A;&#x548C;&#x56DE;&#x8C03;&#x9A71;&#x52A8;&#x7684;&#x5F02;&#x6B65;&#x4EE3;&#x7801;&#x4E4B;&#x95F4;&#x7684;&#x4E0D;&#x543B;&#x5408;&#x4EC5;&#x4EC5;&#x662F;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x8FD8;&#x6709;&#x66F4;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x4E1C;&#x897F;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x518D;&#x770B;&#x770B;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x5EF6;&#x7EED;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;&#xFF08;&#x5373;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-comment">// A</span>
ajax( <span class="hljs-string">&quot;..&quot;</span>, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">..</span>)</span>{
    <span class="hljs-comment">// C</span>
} );
<span class="hljs-comment">// B</span>
</code></pre>
<p>&#x5728;JS&#x4E3B;&#x7A0B;&#x5E8F;&#x7684;&#x63A7;&#x5236;&#x4E0B;&#xFF0C;<code>// A</code>&#x548C;<code>// B</code><em>&#x73B0;&#x5728;</em>&#x6267;&#x884C;&#xFF0C;&#x4F46;&#x662F;<code>// C</code>&#x63A8;&#x8FDF;&#x5230;<em>&#x4EE5;&#x540E;</em>&#x6267;&#x884C;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x5728;&#x7B2C;&#x4E09;&#x65B9;&#x7684;&#x63A7;&#x5236;&#x4E4B;&#x4E0B;--&#x8FD9;&#x91CC;&#x6307;<code>ajax(..)</code>&#x51FD;&#x6570;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x79CD;&#x4EA4;&#x51FA;&#x63A7;&#x5236;&#x6743;&#x7684;&#x65B9;&#x5F0F;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x592A;&#x5927;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x5F88;&#x5C11;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x4E0D;&#x8981;&#x88AB;&#x9A97;&#x4E86;&#xFF0C;&#x4EE5;&#x4E3A;&#x4EA4;&#x51FA;&#x63A7;&#x5236;&#x6743;&#x4E0D;&#x662F;&#x5927;&#x95EE;&#x9898;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x662F;&#x4EE5;&#x56DE;&#x8C03;&#x4E3A;&#x9A71;&#x52A8;&#x7684;&#x8BBE;&#x8BA1;&#x6700;&#x7CDF;&#x7CD5;&#xFF08;&#x4E5F;&#x662F;&#x6700;&#x5FAE;&#x5999;&#xFF09;&#x7684;&#x95EE;&#x9898;&#x4E4B;&#x4E00;&#x3002;&#x6709;&#x65F6;&#xFF0C;<code>ajax(..)</code>&#xFF08;&#x5373;&#x4F60;&#x628A;&#x56DE;&#x8C03;&#x4EA4;&#x7ED9;&#x7684;&#x4E00;&#x65B9;&#xFF09;&#x5E76;&#x4E0D;&#x662F;&#x4F60;&#x5199;&#x7684;&#x6216;&#x76F4;&#x63A5;&#x63A7;&#x5236;&#x7684;&#x51FD;&#x6570;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x662F;&#x7531;&#x7B2C;&#x4E09;&#x65B9;&#x63D0;&#x4F9B;&#x7684;utility&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x628A;&#x7A0B;&#x5E8F;&#x7684;&#x90E8;&#x5206;&#x6267;&#x884C;&#x63A7;&#x5236;&#x6743;&#x4EA4;&#x7ED9;&#x7B2C;&#x4E09;&#x65B9;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x63A7;&#x5236;&#x53CD;&#x8F6C;&#x201D;&#x3002;&#x5728;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x548C;&#x7B2C;&#x4E09;&#x65B9;utility&#x95F4;&#x5B58;&#x5728;&#x7740;&#x4E00;&#x79CD;&#x65E0;&#x4EE5;&#x8A00;&#x8868;&#x7684;&#x201C;&#x5951;&#x7EA6;&#x201D;--&#x4E00;&#x4E9B;&#x4F60;&#x60F3;&#x7EF4;&#x62A4;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<h3 id="&#x4E94;&#x4E2A;&#x56DE;&#x8C03;&#x7684;&#x6545;&#x4E8B;tale-of-five-callbacks">&#x4E94;&#x4E2A;&#x56DE;&#x8C03;&#x7684;&#x6545;&#x4E8B;(Tale of Five Callbacks)</h3>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x662F;&#x4E2A;&#x5927;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x5F88;&#x660E;&#x663E;&#x3002;&#x8BA9;&#x6211;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5938;&#x5927;&#x7684;&#x573A;&#x666F;&#x6765;&#x8BF4;&#x660E;&#x7F3A;&#x4E4F;&#x4FE1;&#x4EFB;&#x7684;&#x5371;&#x5BB3;&#x3002;</p>
<p>&#x5047;&#x5982;&#x4F60;&#x662F;&#x4E00;&#x540D;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x8D1F;&#x8D23;&#x4E3A;&#x4E00;&#x4E2A;&#x552E;&#x5356;&#x9AD8;&#x4EF7;&#x7535;&#x89C6;&#x673A;&#x7684;&#x7F51;&#x7AD9;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x7535;&#x5B50;&#x7ED3;&#x8D26;&#x7CFB;&#x7EDF;&#x3002;&#x4F60;&#x5DF2;&#x7ECF;&#x628A;&#x6240;&#x6709;&#x7ED3;&#x8D26;&#x7CFB;&#x7EDF;&#x7684;&#x9875;&#x9762;&#x90FD;&#x505A;&#x597D;&#x4E86;&#x3002;&#x5728;&#x6700;&#x540E;&#x4E00;&#x9875;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x201C;&#x786E;&#x8BA4;&#x201D;&#x8D2D;&#x4E70;&#x7535;&#x89C6;&#x673A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8C03;&#x7528;&#x7B2C;&#x4E09;&#x65B9;&#x51FD;&#x6570;&#xFF08;&#x5047;&#x5982;&#x7531;&#x67D0;&#x4E2A;&#x5206;&#x6790;&#x8DDF;&#x8E2A;&#x516C;&#x53F8;&#x63D0;&#x4F9B;&#xFF09;&#x6765;&#x8DDF;&#x8E2A;&#x6B64;&#x6B21;&#x8BA2;&#x5355;&#x3002;</p>
<p>&#x4F60;&#x6CE8;&#x610F;&#x5230;&#x4ED6;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x5F02;&#x6B65;&#x7684;&#x8DDF;&#x8E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x6216;&#x8BB8;&#x4E3A;&#x4E86;&#x8003;&#x8651;&#x6027;&#x80FD;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;&#x5728;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x5F53;&#x4E2D;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5BF9;&#x7528;&#x6237;&#x7684;&#x4FE1;&#x7528;&#x5361;&#x8FDB;&#x884C;&#x6263;&#x6B3E;&#x5E76;&#x4E14;&#x5C55;&#x793A;&#x611F;&#x8C22;&#x9875;&#x9762;&#x3002;</p>
<p>&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code class="lang-javascript">analytics.trackPurchase( purchaseData, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>)</span>{
    chargeCreditCard();
    displayThankyouPage();
} );
</code></pre>
<p>&#x5F88;&#x5BB9;&#x6613;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#xFF1F;&#x5199;&#x5B8C;&#x4EE3;&#x7801;&#xFF0C;&#x6D4B;&#x8BD5;&#x6B63;&#x5E38;&#xFF0C;&#x4F60;&#x628A;&#x5B83;&#x90E8;&#x7F72;&#x5230;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x3002;&#x4E07;&#x4E8B;&#x5927;&#x5409;&#xFF01;</p>
<p>6&#x4E2A;&#x6708;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x3002;&#x4F60;&#x5DEE;&#x4E0D;&#x591A;&#x90FD;&#x5FD8;&#x4E86;&#x4F60;&#x5199;&#x8FC7;&#x90A3;&#x6BB5;&#x4EE3;&#x7801;&#x3002;&#x4E00;&#x5929;&#x65E9;&#x4E0A;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x5728;&#x5496;&#x5561;&#x5E97;&#x60A0;&#x60A0;&#x54C9;&#x54C9;&#x5730;&#x559D;&#x7740;&#x62FF;&#x94C1;&#x3002;&#x8FD9;&#x65F6;&#xFF0C;&#x4E00;&#x58F0;&#x7535;&#x8BDD;&#x94C3;&#x54CD;&#xFF0C;&#x4F60;&#x7684;&#x8001;&#x677F;&#x8BA9;&#x4F60;&#x6254;&#x6389;&#x5496;&#x5561;&#xFF0C;&#x9A6C;&#x4E0A;&#x56DE;&#x53BB;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x5F53;&#x4F60;&#x5230;&#x65F6;&#xFF0C;&#x4F60;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x9AD8;&#x7EA7;&#x7528;&#x6237;&#x4E70;&#x7684;&#x7535;&#x89C6;&#x673A;&#x88AB;&#x6263;&#x4E86;&#x4E94;&#x6B21;&#x6B3E;&#xFF0C;&#x5E76;&#x4E14;&#x4ED6;&#x5F88;&#x5FC3;&#x70E6;&#x3002;&#x5BA2;&#x670D;&#x5DF2;&#x7ECF;&#x9053;&#x8FC7;&#x6B49;&#x5E76;&#x4E14;&#x9000;&#x6B3E;&#x4E86;&#x3002;&#x4F46;&#x4F60;&#x7684;&#x8001;&#x677F;&#x60F3;&#x77E5;&#x9053;&#x8FD9;&#x662F;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#x3002;&#x201C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x6211;&#x4EEC;&#x4E0D;&#x662F;&#x6D4B;&#x8BD5;&#x8FC7;&#x4E86;&#x5417;&#xFF1F;&#x201D;</p>
<p>&#x4F60;&#x751A;&#x81F3;&#x4E0D;&#x8BB0;&#x5F97;&#x5199;&#x8FC7;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x4F46;&#x662F;&#x4F60;&#x56DE;&#x5934;&#x4ED4;&#x7EC6;&#x67E5;&#x770B;&#xFF0C;&#x5230;&#x5E95;&#x54EA;&#x51FA;&#x95EE;&#x9898;&#x4E86;&#x3002;</p>
<p>&#x5728;&#x67E5;&#x770B;&#x4E86;&#x4E00;&#x4E9B;&#x65E5;&#x5FD7;&#x540E;&#xFF0C;&#x4F60;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x89E3;&#x91CA;&#x5C31;&#x662F;utility&#x4E0D;&#x77E5;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#x8C03;&#x7528;&#x4E86;&#x4E94;&#x6B21;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x6B21;&#x3002;&#x4ED6;&#x4EEC;&#x7684;&#x6587;&#x6863;&#x4E2D;&#x4ECE;&#x6CA1;&#x63D0;&#x8FC7;&#x8FD9;&#x4E8B;&#x3002;</p>
<p>&#x4F60;&#x5F88;&#x6CAE;&#x4E27;&#xFF0C;&#x8054;&#x7CFB;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x5BA2;&#x670D;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F53;&#x7136;&#x548C;&#x4F60;&#x4E00;&#x6837;&#x5403;&#x60CA;&#x3002;&#x4ED6;&#x4EEC;&#x540C;&#x610F;&#x4E0A;&#x62A5;&#x7ED9;&#x4ED6;&#x4EEC;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x5E76;&#x4E14;&#x8BB8;&#x8BFA;&#x5F88;&#x5FEB;&#x7ED9;&#x4F60;&#x56DE;&#x590D;&#x3002;&#x7B2C;&#x4E8C;&#x5929;&#xFF0C;&#x4F60;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x5F88;&#x957F;&#x7684;&#x90AE;&#x4EF6;&#xFF0C;&#x90AE;&#x4EF6;&#x4E2D;&#x89E3;&#x91CA;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x53D1;&#x73B0;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x628A;&#x5B83;&#x5448;&#x9012;&#x7ED9;&#x4F60;&#x7684;&#x8001;&#x677F;&#x3002;</p>
<p>&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x5206;&#x6790;&#x516C;&#x53F8;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8FC7;&#x53BB;&#x4E00;&#x76F4;&#x5728;&#x67D0;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x505A;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x5B9E;&#x9A8C;&#xFF0C;&#x53EF;&#x80FD;&#x5728;&#x8D85;&#x65F6;&#x4E4B;&#x524D;&#xFF0C;&#x6BCF;&#x79D2;&#x949F;&#x91CD;&#x6267;&#x884C;&#x4E0B;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x603B;&#x5171;5&#x79D2;&#x949F;&#x3002;&#x4ED6;&#x4EEC;&#x4ECE;&#x6CA1;&#x60F3;&#x8FC7;&#x628A;&#x5B83;&#x653E;&#x5230;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x4F46;&#x4E0D;&#x77E5;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#xFF0C;&#x786E;&#x5B9E;&#x653E;&#x4E0A;&#x53BB;&#x4E86;&#x3002;&#x4ED6;&#x4EEC;&#x611F;&#x5230;&#x5F88;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x5E76;&#x9053;&#x4E86;&#x6B49;&#x3002;&#x4ED6;&#x4EEC;&#x62AB;&#x9732;&#x4E86;&#x5927;&#x91CF;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x5B9A;&#x4F4D;&#x95EE;&#x9898;&#x7684;&#x7EC6;&#x8282;&#x4EE5;&#x53CA;&#x5C06;&#x8981;&#x600E;&#x4E48;&#x505A;&#xFF0C;&#x786E;&#x4FDD;&#x4E0D;&#x4F1A;&#x518D;&#x53D1;&#x751F;&#x4E86;&#x3002;&#x7B49;&#x7B49;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x5462;&#xFF1F;</p>
<p>&#x4F60;&#x8DDF;&#x8001;&#x677F;&#x8BF4;&#x4E86;&#x8FD9;&#x4EF6;&#x4E8B;&#xFF0C;&#x4F46;&#x4ED6;&#x5BF9;&#x8FD9;&#x4EF6;&#x4E8B;&#x611F;&#x5230;&#x4E0D;&#x662F;&#x5F88;&#x723D;&#x3002;&#x575A;&#x6301;&#x8981;&#x4F60;&#x4E0D;&#x80FD;&#x518D;&#x76F8;&#x4FE1;&#x4ED6;&#x4EEC;&#x4E86;&#xFF08;&#x8FD9;&#x4E5F;&#x662F;&#x4F60;&#x8981;&#x8BF4;&#x7684;&#xFF09;&#xFF0C;&#x4F60;&#x4E5F;&#x52C9;&#x5F3A;&#x540C;&#x610F;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x641E;&#x660E;&#x767D;&#x5982;&#x4F55;&#x4FDD;&#x62A4;&#x7ED3;&#x8D26;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x514D;&#x518D;&#x53D7;&#x5176;&#x5BB3;&#x3002;</p>
<p>&#x505A;&#x4E86;&#x4E9B;&#x4FEE;&#x6539;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x5199;&#x4E86;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x4E13;&#x7528;&#x4EE3;&#x7801;&#xFF0C;&#x5982;&#x4E0B;&#xFF0C;&#x56E2;&#x961F;&#x6210;&#x5458;&#x5BF9;&#x6B64;&#x4E5F;&#x5F88;&#x4E50;&#x610F;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-keyword">var</span> tracked = <span class="hljs-literal">false</span>;

analytics.trackPurchase( purchaseData, <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>)</span>{
    <span class="hljs-keyword">if</span> (!tracked) {
        tracked = <span class="hljs-literal">true</span>;
        chargeCreditCard();
        displayThankyouPage();
    }
} );
</code></pre>
<p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong>&#x770B;&#x8FC7;&#x7B2C;&#x4E00;&#x7AE0;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x89C9;&#x5F97;&#x5F88;&#x719F;&#x6089;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x95E9;&#xFF08;latch&#xFF09;&#x6765;&#x5904;&#x7406;&#x7A81;&#x7136;&#x591A;&#x6B21;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x4F46;&#x4E00;&#x4E2A;QA&#x5DE5;&#x7A0B;&#x5E08;&#x95EE;&#x4E86;&#xFF1A;&#x201C;&#x8981;&#x662F;&#x4ED6;&#x4EEC;&#x4ECE;&#x6765;&#x4E0D;&#x8C03;&#x7528;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x5462;&#xFF1F;&#x201D;&#x54CE;&#x5466;&#x3002;&#x8C01;&#x90FD;&#x6CA1;&#x60F3;&#x8FC7;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4F60;&#x5F00;&#x59CB;&#x8003;&#x8651;&#x4ED6;&#x4EEC;&#x8C03;&#x7528;&#x4F60;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x65F6;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x5404;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x4F60;&#x60F3;&#x51FA;&#x6765;&#x7684;utility&#x53EF;&#x80FD;&#x51FA;&#x9519;&#x7684;&#x5730;&#x65B9;&#xFF1A;</p>
<ul>
<li>&#x592A;&#x65E9;&#x8C03;&#x7528;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF08;&#x5728;&#x8DDF;&#x8E2A;&#x4E4B;&#x524D;&#xFF09;</li>
<li>&#x592A;&#x665A;&#x8C03;&#x7528;&#xFF08;&#x6216;&#x8005;&#x4ECE;&#x4E0D;&#x8C03;&#x7528;&#xFF09;</li>
<li>&#x8C03;&#x7528;&#x592A;&#x5C11;&#x6216;&#x8005;&#x592A;&#x591A;&#x6B21;&#xFF08;&#x5C31;&#x50CF;&#x4F60;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF01;&#xFF09;</li>
<li>&#x65E0;&#x6CD5;&#x5411;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4F20;&#x9012;&#x4EFB;&#x4F55;&#x5FC5;&#x8981;&#x7684;&#x73AF;&#x5883;/&#x53C2;&#x6570;</li>
<li>&#x63A9;&#x76D6;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x7684;&#x9519;&#x8BEF;/&#x5F02;&#x5E38;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x5373;&#x6709;&#x5F02;&#x5E38;&#x5374;&#x4E0D;&#x62A5;&#x51FA;&#x6765;&#xFF09;</li>
<li>...</li>
</ul>
<p>&#x597D;&#x9EBB;&#x70E6;&#x7684;&#x4E00;&#x957F;&#x4E32;&#x5217;&#x8868;&#xFF0C;&#x786E;&#x5B9E;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x6162;&#x6162;&#x610F;&#x8BC6;&#x5230;&#x9700;&#x8981;&#x5728;&#x6BCF;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x56DE;&#x8C03;&#xFF08;&#x4F20;&#x5165;&#x5230;&#x4F60;&#x4E0D;&#x786E;&#x5B9A;&#x662F;&#x5426;&#x80FD;&#x76F8;&#x4FE1;&#x7684;utility&#x4E2D;&#x53BB;&#xFF09;&#x5F53;&#x4E2D;&#x5199;&#x5927;&#x91CF;&#x4E13;&#x95E8;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x597D;&#x75DB;&#x82E6;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x4F60;&#x5BF9;&#x201C;&#x5730;&#x72F1;&#x56DE;&#x8C03;&#x201D;&#x7684;&#x7406;&#x89E3;&#x66F4;&#x6DF1;&#x4E00;&#x5C42;&#x4E86;&#x3002;</p>
<h3 id="&#x4E0D;&#x53EA;&#x662F;&#x522B;&#x4EBA;&#x7684;&#x4EE3;&#x7801;&#xFF08;not-just-others-code&#xFF09;">&#x4E0D;&#x53EA;&#x662F;&#x522B;&#x4EBA;&#x7684;&#x4EE3;&#x7801;&#xFF08;Not Just Others&apos; Code&#xFF09;</h3>
<p>&#x6B64;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x4EBA;&#x4F1A;&#x6000;&#x7591;&#xFF0C;&#x6211;&#x6240;&#x8BF4;&#x7684;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#x5426;&#x662F;&#x4E2A;&#x5927;&#x95EE;&#x9898;&#x3002;&#x6216;&#x8BB8;&#x4F60;&#x4E0D;&#x600E;&#x4E48;&#x548C;&#x7B2C;&#x4E09;&#x65B9;utility&#x6253;&#x4EA4;&#x9053;&#x3002;&#x6216;&#x8BB8;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x7248;&#x672C;&#x5316;&#x7684;API&#x6216;&#x8005;&#x81EA;&#x6258;&#x7BA1;&#x7684;&#x5E93;&#xFF0C;&#x56E0;&#x6B64;&#x7A0B;&#x5E8F;&#x7684;&#x884C;&#x4E3A;&#x4E0D;&#x4F1A;&#x88AB;&#x9664;&#x4F60;&#x4E4B;&#x5916;&#x7684;&#x4EBA;&#x6539;&#x53D8;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x4ED4;&#x7EC6;&#x60F3;&#x60F3;&#xFF1A;&#x4F60;&#x771F;&#x7684;&#x80FD;&#x76F8;&#x4FE1;&#x4F60;&#x7406;&#x8BBA;&#x4E0A;&#x63A7;&#x5236;&#x7684;utility&#x5417;&#xFF08;&#x5728;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x5E93;&#x4E2D;&#xFF09;&#xFF1F;</p>
<p>&#x8FD9;&#x6837;&#x60F3;&#x60F3;&#xFF1A;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x610F;&#x5916;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x90FD;&#x4F1A;&#x5728;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x5BF9;&#x8F93;&#x5165;&#x53C2;&#x6570;&#x4F5C;&#x4E00;&#x4E9B;&#x9632;&#x5FA1;&#x6027;&#x68C0;&#x67E5;&#x3002;</p>
<p>&#x8FC7;&#x5EA6;&#x4FE1;&#x4EFB;&#x8F93;&#x5165;&#x503C;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">addNumbers</span>(<span class="hljs-params">x,y</span>) </span>{
    <span class="hljs-comment">// + is overloaded with coercion to also be</span>
    <span class="hljs-comment">// string concatenation, so this operation</span>
    <span class="hljs-comment">// isn&apos;t strictly safe depending on what&apos;s</span>
    <span class="hljs-comment">// passed in.</span>
    <span class="hljs-keyword">return</span> x + y;
}

addNumbers( <span class="hljs-number">21</span>, <span class="hljs-number">21</span> );   <span class="hljs-comment">// 42</span>
addNumbers( <span class="hljs-number">21</span>, <span class="hljs-string">&quot;21&quot;</span> ); <span class="hljs-comment">// &quot;2121&quot;</span>
</code></pre>
<p>&#x9632;&#x8303;&#x4E0D;&#x4FE1;&#x4EFB;&#x7684;&#x8F93;&#x5165;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">addNumbers</span>(<span class="hljs-params">x,y</span>) </span>{
    <span class="hljs-comment">// ensure numerical input</span>
    <span class="hljs-keyword">if</span> (<span class="hljs-keyword">typeof</span> x != <span class="hljs-string">&quot;number&quot;</span> || <span class="hljs-keyword">typeof</span> y != <span class="hljs-string">&quot;number&quot;</span>) {
        <span class="hljs-keyword">throw</span> <span class="hljs-built_in">Error</span>( <span class="hljs-string">&quot;Bad parameters&quot;</span> );
    }

    <span class="hljs-comment">// if we get here, + will safely do numeric addition</span>
    <span class="hljs-keyword">return</span> x + y;
}

addNumbers( <span class="hljs-number">21</span>, <span class="hljs-number">21</span> );   <span class="hljs-comment">// 42</span>
addNumbers( <span class="hljs-number">21</span>, <span class="hljs-string">&quot;21&quot;</span> ); <span class="hljs-comment">// Error: &quot;Bad parameters&quot;</span>
</code></pre>
<p>&#x6216;&#x8BB8;&#x5728;&#x5B89;&#x5168;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x66F4;&#x53CB;&#x597D;&#x4E00;&#x70B9;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">addNumbers</span>(<span class="hljs-params">x,y</span>) </span>{
    <span class="hljs-comment">// ensure numerical input</span>
    x = <span class="hljs-built_in">Number</span>( x );
    y = <span class="hljs-built_in">Number</span>( y );

    <span class="hljs-comment">// + will safely do numeric addition</span>
    <span class="hljs-keyword">return</span> x + y;
}

addNumbers( <span class="hljs-number">21</span>, <span class="hljs-number">21</span> );   <span class="hljs-comment">// 42</span>
addNumbers( <span class="hljs-number">21</span>, <span class="hljs-string">&quot;21&quot;</span> ); <span class="hljs-comment">// 42</span>
</code></pre>
<p>&#x7136;&#x800C;&#xFF0C;&#x5F53;&#x4F60;&#x7740;&#x624B;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x8FD9;&#x4E9B;&#x5BF9;&#x51FD;&#x6570;&#x8F93;&#x5165;&#x7684;&#x68C0;&#x67E5;/&#x89C4;&#x8303;&#x5316;&#x76F8;&#x5F53;&#x5E38;&#x89C1;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x7406;&#x8BBA;&#x4E0A;&#x6211;&#x4EEC;&#x5B8C;&#x5168;&#x76F8;&#x4FE1;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x3002;&#x4ECE;&#x7C97;&#x6D45;&#x7684;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x79CD;&#x7F16;&#x7A0B;&#x7B49;&#x4EF7;&#x4E8E;&#x5730;&#x7F18;&#x653F;&#x6CBB;&#x5B66;&#x4E2D;&#x7684;&#x201C;&#x4FE1;&#x4EFB;&#x4F46;&#x8981;&#x9A8C;&#x8BC1;&#x201D;&#x7684;&#x539F;&#x5219;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x5F88;&#x663E;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x5305;&#x542B;&#x5F02;&#x6B65;&#x51FD;&#x6570;&#x56DE;&#x8C03;&#x7684;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x4E5F;&#x8BE5;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x5916;&#x90E8;&#x4EE3;&#x7801;&#xFF0C;&#x8FD8;&#x6709;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x8BA4;&#x4E3A;&#x201C;&#x5728;&#x6211;&#x4EEC;&#x63A7;&#x5236;&#x4E4B;&#x4E0B;&#x201D;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4E0D;&#x662F;&#x5417;&#xFF1F;<strong>&#x5F53;&#x7136;&#x662F;&#x7684;&#x3002;</strong></p>
<p>&#x4F46;&#x56DE;&#x8C03;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x6765;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x3002;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x81EA;&#x5DF1;&#x6784;&#x5EFA;&#x6240;&#x6709;&#x7684;&#x68C0;&#x67E5;&#x673A;&#x5236;&#xFF0C;&#x6700;&#x7EC8;&#x90FD;&#x662F;&#x4E00;&#x4E9B;&#x5728;&#x6BCF;&#x4E2A;&#x56DE;&#x8C03;&#x4E2D;&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#x7684;&#x6837;&#x677F;/&#x5F00;&#x9500;&#x3002;</p>
<p>&#x56DE;&#x8C03;&#x6700;&#x4EE4;&#x4EBA;&#x5934;&#x75BC;&#x7684;&#x95EE;&#x9898;&#x662F;<em>&#x63A7;&#x5236;&#x6743;&#x53CD;&#x8F6C;</em>&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4FE1;&#x4EFB;&#x7684;&#x5B8C;&#x5168;&#x5D29;&#x6E83;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x56DE;&#x8C03;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x6709;&#x7B2C;&#x4E09;&#x65B9;utility&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5BF9;<em>&#x63A7;&#x5236;&#x6743;&#x53CD;&#x8F6C;</em>&#x4FE1;&#x4EFB;&#x95EE;&#x9898;&#x6CA1;&#x6709;&#x4F5C;&#x4E00;&#x4E9B;&#x7F13;&#x548C;&#x903B;&#x8F91;&#x63A7;&#x5236;&#xFF0C;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x5C31;&#x6709;bug&#x4E86;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x73B0;&#x5728;&#x53EF;&#x80FD;&#x4E0D;&#x51FA;&#x73B0;&#x3002;&#x6F5C;&#x5728;&#x7684;bug&#x8FD8;&#x662F;bug&#x3002;</p>
<p>&#x786E;&#x5B9E;&#x662F;&#x5730;&#x72F1;&#x3002;</p>
<h2 id="&#x8BD5;&#x56FE;&#x62EF;&#x6551;&#x56DE;&#x8C03;&#xFF08;trying-to-save-callbacks&#xFF09;">&#x8BD5;&#x56FE;&#x62EF;&#x6551;&#x56DE;&#x8C03;&#xFF08;Trying to Save Callbacks&#xFF09;</h2>
<p>&#x6709;&#x51E0;&#x79CD;&#x56DE;&#x8C03;&#x8BBE;&#x8BA1;&#x8BD5;&#x56FE;&#x89E3;&#x51B3;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x7684;&#x90E8;&#x5206;&#xFF08;&#x4E0D;&#x662F;&#x5168;&#x90E8;&#xFF09;&#x4FE1;&#x4EFB;&#x95EE;&#x9898;&#x3002;&#x62EF;&#x6551;&#x56DE;&#x8C03;&#x514D;&#x4E8E;&#x81EA;&#x6211;&#x5D29;&#x6E83;&#x662F;&#x4E2A;&#x52C7;&#x6562;&#x4F46;&#x6CE8;&#x5B9A;&#x5931;&#x8D25;&#x7684;&#x5C1D;&#x8BD5;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5173;&#x4E8E;&#x66F4;&#x4F18;&#x96C5;&#x7684;&#x9519;&#x8BEF;&#x5904;&#x7406;&#xFF0C;&#x4E00;&#x4E9B;API&#x8BBE;&#x8BA1;&#x63D0;&#x4F9B;&#x4E86;&#x5206;&#x79BB;&#x5F0F;&#x56DE;&#x8C03;&#xFF08;&#x4E00;&#x4E2A;&#x662F;&#x6210;&#x529F;&#x56DE;&#x8C03;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x9519;&#x8BEF;&#x56DE;&#x8C03;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">success</span>(<span class="hljs-params">data</span>) </span>{
    <span class="hljs-built_in">console</span>.log( data );
}

<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">failure</span>(<span class="hljs-params">err</span>) </span>{
    <span class="hljs-built_in">console</span>.error( err );
}

ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, success, failure );
</code></pre>
<p>&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x8BBE;&#x8BA1;&#x7684;API&#x4E2D;&#xFF0C;&#x901A;&#x5E38;<code>failure()</code>&#x662F;&#x53EF;&#x9009;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#xFF0C;&#x5219;&#x5047;&#x5B9A;&#x4F60;&#x60F3;&#x63A9;&#x76D6;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x3002;&#x5443;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong> ES6 Promise API&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x5206;&#x79BB;&#x5F0F;&#x56DE;&#x8C03;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x6211;&#x4EEC;&#x4F1A;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;ES6 Promises&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x56DE;&#x8C03;&#x6A21;&#x5F0F;&#x79F0;&#x4E3A;&#x201C;&#x9519;&#x8BEF;&#x4F18;&#x5148;&#x7C7B;&#x578B;&#x201D;&#xFF08;&#x6709;&#x65F6;&#x53EB;&#x505A;&#x201C;Node&#x7C7B;&#x578B;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x51E0;&#x4E4E;&#x6240;&#x6709;Node.js API&#x7684;&#x7EA6;&#x5B9A;&#x5F62;&#x5F0F;&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#xFF0C;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x4FDD;&#x7559;&#x7528;&#x4F5C;&#x9519;&#x8BEF;&#x5BF9;&#x8C61;&#xFF08;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#xFF09;&#x3002;&#x5982;&#x679C;&#x6210;&#x529F;&#xFF0C;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x5C31;&#x4E3A;&#x7A7A;/falsy(&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x6307;&#x80FD;&#x8F6C;&#x5316;&#x4E3A;false)&#xFF08;&#x4E4B;&#x540E;&#x7684;&#x53C2;&#x6570;&#x90FD;&#x662F;&#x6210;&#x529F;&#x6570;&#x636E;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x9519;&#x8BEF;&#xFF0C;&#x5219;&#x8BBE;&#x4E3A;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;/truthy&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x6307;&#x80FD;&#x8F6C;&#x5316;&#x4E3A;true&#xFF09;&#xFF08;&#x901A;&#x5E38;&#x53EA;&#x6709;&#x8BE5;&#x9519;&#x8BEF;&#x5BF9;&#x8C61;&#x6CA1;&#x6709;&#x5176;&#x5B83;&#x53C2;&#x6570;&#x4F20;&#x5165;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">response</span>(<span class="hljs-params">err,data</span>) </span>{
    <span class="hljs-comment">// error?</span>
    <span class="hljs-keyword">if</span> (err) {
        <span class="hljs-built_in">console</span>.error( err );
    }
    <span class="hljs-comment">// otherwise, assume success</span>
    <span class="hljs-keyword">else</span> {
        <span class="hljs-built_in">console</span>.log( data );
    }
}

ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, response );
</code></pre>
<p>&#x4EE5;&#x4E0A;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6709;&#x51E0;&#x70B9;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF1A;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x89E3;&#x51B3;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x5927;&#x591A;&#x6570;&#x4FE1;&#x4EFB;&#x95EE;&#x9898;&#x3002;&#x5BF9;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x91CD;&#x590D;&#x8C03;&#x7528;&#x64CD;&#x4F5C;&#x65E2;&#x6CA1;&#x6709;&#x963B;&#x6B62;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x8FC7;&#x6EE4;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x60C5;&#x51B5;&#x53D8;&#x5F97;&#x66F4;&#x7CDF;&#x4E86;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x83B7;&#x5F97;&#x6210;&#x529F;&#x548C;&#x5931;&#x8D25;&#x4FE1;&#x53F7;&#xFF0C;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x90FD;&#x5F97;&#x4E0D;&#x5230;&#xFF0C;&#x4F60;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x9488;&#x5BF9;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x5199;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x5FFD;&#x7565;&#x7684;&#x4E8B;&#x5B9E;&#x662F;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4F60;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x7684;&#x6807;&#x51C6;&#x6A21;&#x5F0F;&#xFF0C;&#x4F46;&#x5B83;&#x80AF;&#x5B9A;&#x66F4;&#x5197;&#x957F;&#x5E76;&#x4E14;&#x6837;&#x677F;&#x5316;&#xFF0C;&#x6CA1;&#x6CD5;&#x8FDB;&#x884C;&#x592A;&#x591A;&#x7684;&#x590D;&#x7528;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6BCF;&#x4E2A;&#x56DE;&#x8C03;&#x4E2D;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E0D;&#x538C;&#x5176;&#x70E6;&#x5730;&#x7F16;&#x5199;&#x90A3;&#x4E9B;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x90A3;&#x4ECE;&#x4E0D;&#x8C03;&#x7528;&#x8FD9;&#x4E00;&#x4FE1;&#x4EFB;&#x95EE;&#x9898;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x8FD9;&#x662F;&#x4E2A;&#x95EE;&#x9898;&#xFF08;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x662F;&#x4E2A;&#x95EE;&#x9898;&#xFF01;&#xFF09;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x5B9A;&#x65F6;&#x5668;&#x6765;&#x53D6;&#x6D88;&#x4E8B;&#x4EF6;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x67D0;&#x4E2A;utility&#xFF08;&#x4EC5;&#x4F5C;&#x6982;&#x5FF5;&#x5C55;&#x793A;&#xFF09;&#x6765;&#x5E2E;&#x52A9;&#x4F60;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">timeoutify</span>(<span class="hljs-params">fn,delay</span>) </span>{
    <span class="hljs-keyword">var</span> intv = setTimeout( <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>)</span>{
            intv = <span class="hljs-literal">null</span>;
            fn( <span class="hljs-keyword">new</span> <span class="hljs-built_in">Error</span>( <span class="hljs-string">&quot;Timeout!&quot;</span> ) );
        }, delay )
    ;

    <span class="hljs-keyword">return</span> <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
        <span class="hljs-comment">// timeout hasn&apos;t happened yet?</span>
        <span class="hljs-keyword">if</span> (intv) {
            clearTimeout( intv );
            fn.apply( <span class="hljs-keyword">this</span>, [ <span class="hljs-literal">null</span> ].concat( [].slice.call( <span class="hljs-built_in">arguments</span> ) ) );
        }
    };
}
</code></pre>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-comment">// using &quot;error-first style&quot; callback design</span>
<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">foo</span>(<span class="hljs-params">err,data</span>) </span>{
    <span class="hljs-keyword">if</span> (err) {
        <span class="hljs-built_in">console</span>.error( err );
    }
    <span class="hljs-keyword">else</span> {
        <span class="hljs-built_in">console</span>.log( data );
    }
}

ajax( <span class="hljs-string">&quot;http://some.url.1&quot;</span>, timeoutify( foo, <span class="hljs-number">500</span> ) );
</code></pre>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x4FE1;&#x4EFB;&#x95EE;&#x9898;&#x79F0;&#x4E3A;&#x201C;&#x592A;&#x65E9;&#x8C03;&#x7528;&#x201D;&#x3002;&#x5728;&#x5177;&#x4F53;&#x5E94;&#x7528;&#x65B9;&#x9762;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x67D0;&#x4E9B;&#x91CD;&#x8981;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x4E4B;&#x524D;&#x5C31;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x4F46;&#x66F4;&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7B49;&#x4EF7;&#x4E8E;utility&#x4E2D;<em>&#x73B0;&#x5728;</em>&#xFF08;&#x540C;&#x6B65;&#xFF09;&#x6216;&#x8005;<em>&#x4EE5;&#x540E;</em>&#xFF08;&#x5F02;&#x6B65;&#xFF09;&#x8FD0;&#x884C;&#x4F60;&#x63D0;&#x4F9B;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x540C;&#x6B65;&#x6216;&#x5F02;&#x6B65;&#x4E0D;&#x5B9A;&#x7684;&#x884C;&#x4E3A;&#x603B;&#x662F;&#x4F7F;&#x5F97;bug&#x96BE;&#x4EE5;&#x8FFD;&#x8E2A;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x5708;&#x5B50;&#x4E2D;&#xFF0C;&#x91C7;&#x7528;&#x79D1;&#x5E7B;&#x4E16;&#x754C;&#x4E2D;&#x7684;&#x7CBE;&#x795E;&#x8BF1;&#x5BFC;&#x602A;&#x517D;Zalgo&#x6765;&#x63CF;&#x8FF0;&#x540C;&#x6B65;/&#x5F02;&#x6B65;&#x5669;&#x68A6;&#x3002;&#x201C;&#x4E0D;&#x8981;&#x91CA;&#x653E;Zalgo&#xFF01;&#x201D;&#x662F;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#x8BC9;&#x6C42;&#xFF0C;&#x542C;&#x8D77;&#x6765;&#x597D;&#x50CF;&#x662F;&#x5EFA;&#x8BAE;&#xFF1A;&#x603B;&#x662F;&#x5F02;&#x6B65;&#x8C03;&#x7528;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x8F6E;&#x8BE2;&#x4E2D;&#x201C;&#x7ACB;&#x5373;&#x201D;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x6240;&#x6709;&#x7684;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x90FD;&#x662F;&#x5F02;&#x6B65;&#x7684;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong>&#x82E5;&#x60F3;&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x5173;&#x4E8E;Zalgo&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x770B;Oren Golan&#x7684;&#x201C;Don&apos;t Release Zalgo!&#x201D;&#xFF08;<a href="https://github.com/oren/oren.github.io/blob/master/posts/zalgo.md" target="_blank">https://github.com/oren/oren.github.io/blob/master/posts/zalgo.md</a>&#xFF09;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x539F;&#x6587;&#x597D;&#x50CF;&#x5DF2;&#x7ECF;&#x4E0D;&#x5B58;&#x5728;&#x4E86;&#xFF09;&#x548C; Isaac Z. Schlueter&#x7684;&#x201C;&#x5F02;&#x6B65;&#x63A5;&#x53E3;&#x8BBE;&#x8BA1;&#x201D;&#xFF08;<a href="http://blog.izs.me/post/59142742143/designing-apis-for-asynchrony" target="_blank">http://blog.izs.me/post/59142742143/designing-apis-for-asynchrony</a>&#xFF09;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">result</span>(<span class="hljs-params">data</span>) </span>{
    <span class="hljs-built_in">console</span>.log( a );
}

<span class="hljs-keyword">var</span> a = <span class="hljs-number">0</span>;

ajax( <span class="hljs-string">&quot;..pre-cached-url..&quot;</span>, result );
a++;
</code></pre>
<p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4F1A;&#x8F93;&#x51FA;<code>0</code>(&#x540C;&#x6B65;&#x56DE;&#x8C03;&#x8C03;&#x7528;)&#x8FD8;&#x662F;<code>1</code>(&#x5F02;&#x6B65;&#x56DE;&#x8C03;&#x8C03;&#x7528;)&#xFF1F;&#x6839;&#x636E;...&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x4ECE;&#x8FD9;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5230;Zalgo&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x5BF9;&#x4EFB;&#x4E00;JS&#x7A0B;&#x5E8F;&#x9020;&#x6210;&#x7684;&#x5A01;&#x80C1;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x201C;&#x4E0D;&#x8981;&#x91CA;&#x653E;Zalgo&#x201D;&#x542C;&#x8D77;&#x6765;&#x6709;&#x70B9;&#x611A;&#x8822;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5E38;&#x89C1;&#x4E14;&#x53EF;&#x9760;&#x7684;&#x5EFA;&#x8BAE;&#x3002;&#x603B;&#x662F;&#x91C7;&#x7528;&#x5F02;&#x6B65;&#x3002;</p>
<p>&#x8981;&#x662F;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x6240;&#x6D89;&#x53CA;&#x7684;API&#x662F;&#x5426;&#x662F;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x7684;&#x5462;&#xFF1F;&#x4F60;&#x53EF;&#x4EE5;&#x5199;&#x4E2A;utility&#x5982;<code>asyncify(..)</code>,&#x4EC5;&#x4F5C;&#x6982;&#x5FF5;&#x5C55;&#x793A;&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">asyncify</span>(<span class="hljs-params">fn</span>) </span>{
    <span class="hljs-keyword">var</span> orig_fn = fn,
        intv = setTimeout( <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>)</span>{
            intv = <span class="hljs-literal">null</span>;
            <span class="hljs-keyword">if</span> (fn) fn();
        }, <span class="hljs-number">0</span> )
    ;

    fn = <span class="hljs-literal">null</span>;

    <span class="hljs-keyword">return</span> <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params"></span>) </span>{
        <span class="hljs-comment">// firing too quickly, before `intv` timer has fired to</span>
        <span class="hljs-comment">// indicate async turn has passed?</span>
        <span class="hljs-keyword">if</span> (intv) {
            fn = orig_fn.bind.apply(
                orig_fn,
                <span class="hljs-comment">// add the wrapper&apos;s `this` to the `bind(..)`</span>
                <span class="hljs-comment">// call parameters, as well as currying any</span>
                <span class="hljs-comment">// passed in parameters</span>
                [<span class="hljs-keyword">this</span>].concat( [].slice.call( <span class="hljs-built_in">arguments</span> ) )
            );
        }
        <span class="hljs-comment">// already async</span>
        <span class="hljs-keyword">else</span> {
            <span class="hljs-comment">// invoke original function</span>
            orig_fn.apply( <span class="hljs-keyword">this</span>, <span class="hljs-built_in">arguments</span> );
        }
    };
}
</code></pre>
<p>&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x4F7F;&#x7528;<code>asyncify(..)</code>&#xFF1A;</p>
<pre><code class="lang-javascript"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">result</span>(<span class="hljs-params">data</span>) </span>{
    <span class="hljs-built_in">console</span>.log( a );
}

<span class="hljs-keyword">var</span> a = <span class="hljs-number">0</span>;

ajax( <span class="hljs-string">&quot;..pre-cached-url..&quot;</span>, asyncify( result ) );
a++;
</code></pre>
<p>&#x4E0D;&#x7BA1;Ajax&#x8BF7;&#x6C42;&#x662F;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#xFF0C;&#x8FDB;&#x800C;&#x8BD5;&#x56FE;&#x7ACB;&#x5373;&#x8C03;&#x7528;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x8FD8;&#x662F;&#x5FC5;&#x987B;&#x4ECE;&#x8FDC;&#x7AEF;&#x83B7;&#x53D6;&#x4E4B;&#x540E;&#x5F02;&#x6B65;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x603B;&#x662F;&#x8F93;&#x51FA;<code>1</code>&#x800C;&#x4E0D;&#x662F;<code>0</code>--<code>result(..)</code>&#x4E0D;&#x5F97;&#x4E0D;&#x5F02;&#x6B65;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;<code>a++</code>&#x6709;&#x673A;&#x4F1A;&#x5728;<code>result(..)</code>&#x4E4B;&#x524D;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x8036;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x4FE1;&#x4EFB;&#x95EE;&#x9898;&#x201C;&#x89E3;&#x51B3;&#x4E86;&#x201D;&#xFF01;&#x4F46;&#x5F88;&#x4F4E;&#x6548;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x6837;&#x677F;&#x4EE3;&#x7801;&#x4F7F;&#x5F97;&#x4F60;&#x7684;&#x9879;&#x76EE;&#x81C3;&#x80BF;&#x4E0D;&#x582A;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x904D;&#x4E00;&#x904D;&#x91C7;&#x7528;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7684;&#x6545;&#x4E8B;&#x3002;&#x56DE;&#x8C03;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x5B8C;&#x6210;&#x4F60;&#x7684;&#x4EFB;&#x4F55;&#x6240;&#x9700;&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x82B1;&#x5F88;&#x5927;&#x529F;&#x592B;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4EFD;&#x52AA;&#x529B;&#x901A;&#x5E38;&#x6BD4;&#x4F60;&#x5E94;&#x8BE5;&#x82B1;&#x8D39;&#x7684;&#x8981;&#x591A;&#x5F97;&#x591A;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x6709;&#x5185;&#x5EFA;&#x7684;API&#x6216;&#x8005;&#x5176;&#x5B83;&#x8BED;&#x8A00;&#x673A;&#x5236;&#x6765;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x6700;&#x7EC8;&#xFF0C;ES6&#x6765;&#x5230;&#x5E55;&#x524D;&#xFF0C;&#x7ED9;&#x51FA;&#x4E86;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x90A3;&#x4E48;&#x7EE7;&#x7EED;&#x5F80;&#x4E0B;&#x8BFB;&#xFF01;</p>
<h2 id="&#x56DE;&#x987E;&#xFF08;review&#xFF09;">&#x56DE;&#x987E;&#xFF08;Review&#xFF09;</h2>
<p>&#x56DE;&#x8C03;&#x662F;JS&#x4E2D;&#x91CD;&#x8981;&#x7684;&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#x5355;&#x5143;&#x3002;&#x4F46;&#x968F;&#x7740;JS&#x7684;&#x65E5;&#x8D8B;&#x6210;&#x719F;&#xFF0C;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x5E76;&#x4E0D;&#x8DB3;&#x4EE5;&#x652F;&#x6491;&#x5F02;&#x6B65;&#x7F16;&#x7A0B;&#x7684;&#x6F14;&#x8FDB;&#x3002;</p>
<p>&#x9996;&#x5148;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x5927;&#x8111;&#x662F;&#x4EE5;&#x5E8F;&#x5217;&#x5316;&#x3001;&#x963B;&#x585E;&#x6027;&#x3001;&#x5355;&#x7EBF;&#x7A0B;&#xFF08;&#x4ECE;&#x8BED;&#x4E49;&#x4E0A;&#x6765;&#x8BF4;&#xFF09;&#x7684;&#x65B9;&#x5F0F;&#x8BA1;&#x5212;&#x4E8B;&#x60C5;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x662F;&#x4EE5;&#x975E;&#x7EBF;&#x6027;&#x3001;&#x975E;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x8868;&#x8FBE;&#x5F02;&#x6B65;&#x6D41;&#x7684;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x63A8;&#x6F14;&#x4EE3;&#x7801;&#x66F4;&#x56F0;&#x96BE;&#x3002;&#x4F1A;&#x4EA7;&#x751F;&#x7CDF;&#x7CD5;bug&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x5229;&#x4E8E;&#x63A8;&#x6F14;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4EE5;&#x4E00;&#x79CD;&#x66F4;&#x540C;&#x6B65;&#x3001;&#x5E8F;&#x5217;&#x5316;&#x3001;&#x963B;&#x585E;&#x6027;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8868;&#x8FBE;&#x5F02;&#x6B65;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x5927;&#x8111;&#x6240;&#x505A;&#x7684;&#x90A3;&#x6837;&#x3002;</p>
<p>&#x5176;&#x6B21;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x56DE;&#x8C03;&#x6DF1;&#x53D7;<em>&#x63A7;&#x5236;&#x6743;&#x53CD;&#x8F6C;</em>&#x4E4B;&#x5BB3;&#xFF0C;&#x56E0;&#x4E3A;&#x63A7;&#x5236;&#x6743;&#x4F1A;&#x9690;&#x5F0F;&#x5730;&#x8F6C;&#x7ED9;&#x5176;&#x5B83;&#x65B9;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x53D7;&#x4F60;&#x63A7;&#x5236;&#x7684;&#x7B2C;&#x4E09;&#x65B9;utility&#xFF01;&#xFF09;&#x6765;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x7684;<em>&#x5EF6;&#x7EED;</em>&#x3002;&#x8FD9;&#x79CD;&#x63A7;&#x5236;&#x6743;&#x53CD;&#x8F6C;&#x7ED9;&#x6211;&#x4EEC;&#x9020;&#x6210;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x4FE1;&#x4EFB;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7684;&#x8C03;&#x7528;&#x6B21;&#x6570;&#x662F;&#x5426;&#x8D85;&#x8FC7;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x9884;&#x671F;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5199;&#x4E9B;&#x4E13;&#x95E8;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x89E3;&#x51B3;&#x4FE1;&#x4EFB;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x5B83;&#x672C;&#x4E0D;&#x5E94;&#x8BE5;&#x8FD9;&#x4E48;&#x56F0;&#x96BE;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x4F7F;&#x5F97;&#x4EE3;&#x7801;&#x66F4;&#x52A0;&#x81C3;&#x80BF;&#x4E14;&#x96BE;&#x4E8E;&#x7EF4;&#x62A4;&#x3002;&#x76F4;&#x5230;&#x4F60;&#x78B0;&#x5230;bug&#x65F6;&#x4F60;&#x624D;&#x89C9;&#x5F97;&#x9632;&#x62A4;&#x5DE5;&#x4F5C;&#x505A;&#x5F97;&#x4E0D;&#x591F;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;<strong>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;</strong>&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;,&#x4E00;&#x4E2A;&#x4E00;&#x65E6;&#x521B;&#x5EFA;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x591A;&#x4E2A;&#x56DE;&#x8C03;&#x590D;&#x7528;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x989D;&#x5916;&#x6837;&#x677F;&#x5F00;&#x9500;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x6BD4;&#x56DE;&#x8C03;&#x66F4;&#x597D;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#xFF0C;&#x56DE;&#x8C03;&#x8868;&#x73B0;&#x5F97;&#x8FD8;&#x884C;&#xFF0C;&#x4F46;JS&#x7684;&#x672A;&#x6765;&#x9700;&#x8981;&#x66F4;&#x590D;&#x6742;&#x548C;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x5F02;&#x6B65;&#x6A21;&#x5F0F;&#x3002;&#x672C;&#x4E66;&#x7684;&#x4E0B;&#x4E00;&#x7AE0;&#x5C06;&#x4F1A;&#x8BA8;&#x8BBA;&#x90A3;&#x4E9B;&#x65B0;&#x51FA;&#x73B0;&#x7684;&#x6F14;&#x8FDB;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch1.html" class="navigation navigation-prev " aria-label="Previous page: 第一章：异步：现在 & 以后">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch3.html" class="navigation navigation-next " aria-label="Next page: 第三章：Promises">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第二章：回调","level":"1.3","depth":1,"next":{"title":"第三章：Promises","level":"1.4","depth":1,"path":"ch3.md","ref":"ch3.md","articles":[]},"previous":{"title":"第一章：异步：现在 & 以后","level":"1.2","depth":1,"path":"ch1.md","ref":"ch1.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch2.md","mtime":"2017-04-12T08:19:23.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-04-12T08:25:25.932Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

